Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h

/**
 * \file IfxGtm_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: tc39x_its_SFR_V1.0.1_1.3_230715.xml dated 28.07.2015
 * Specification: its_V1.0.1_1.3.pdf
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Gtm Gtm
 * \ingroup IfxLld
 *
 * \defgroup IfxLld_Gtm_Bitfields Bitfields
 * \ingroup IfxLld_Gtm
 *
 * \defgroup IfxLld_Gtm_union Union
 * \ingroup IfxLld_Gtm
 *
 * \defgroup IfxLld_Gtm_struct Struct
 * \ingroup IfxLld_Gtm
 *
 */
#ifndef IFXGTM_REGDEF_H
#define IFXGTM_REGDEF_H 1
/******************************************************************************/
#if defined(__TASKING__)
#pragma warning 586
#endif
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_Bitfields
 * \{  */

/** \\brief  ADC Trigger 3Output Select 1 Register */
typedef struct _Ifx_GTM_ADCTRIG4OUT0_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for ADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for ADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for ADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for ADC7 GTM connection (rw) */
} Ifx_GTM_ADCTRIG4OUT0_Bits;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef struct _Ifx_GTM_ADCTRIG4OUT1_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_ADCTRIG4OUT1_Bits;

/** \\brief  GTM AEI Timeout exception address register */
typedef struct _Ifx_GTM_AEI_ADDR_XPT_Bits
{
    Ifx_Strict_32Bit TO_ADDR : 20;            /**< \brief [19:0] AEI timeout address. (r) */
    Ifx_Strict_32Bit TO_W1R0 : 1;             /**< \brief [20:20] AEI timeout Read/Write flag. (r) */
    Ifx_Strict_32Bit reserved_21 : 11;        /**< \brief \internal Reserved */
} Ifx_GTM_AEI_ADDR_XPT_Bits;

/** \\brief  GTM AEI Non zero status register */
typedef struct _Ifx_GTM_AEI_STA_XPT_Bits
{
    Ifx_Strict_32Bit ADDR : 20;               /**< \brief [19:0] AEI exception address. (r) */
    Ifx_Strict_32Bit W1R0 : 1;                /**< \brief [20:20] AEI exception Read/Write flag. (r) */
    Ifx_Strict_32Bit reserved_21 : 11;        /**< \brief \internal Reserved */
} Ifx_GTM_AEI_STA_XPT_Bits;

/** \\brief  AFD 0 FIFO 0 buffer access register */
typedef struct _Ifx_GTM_AFD_CH_BUF_ACC_Bits
{
    Ifx_Strict_32Bit DATA : 29;               /**< \brief [28:0] Read/write data from/to FIFO (rw) */
    Ifx_Strict_32Bit Reserved : 3;            /**< \brief [31:29] reserved (r) */
} Ifx_GTM_AFD_CH_BUF_ACC_Bits;

/** \\brief  ARU 0 dynamic routing control register */
typedef struct _Ifx_GTM_ARU_0_DYN_CTRL_Bits
{
    Ifx_Strict_32Bit DYN_ARU_UPDATE_EN : 1;   /**< \brief [0:0] enable reload of DYN_ROUTE register from ARU itself (rw) */
    Ifx_Strict_32Bit DYN_ROUTE_SWAP : 1;      /**< \brief [1:1] enable swapping DYN_ROUTE_SR with DYN_ROUTE register (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_CTRL_Bits;

/** \\brief  ARU 0 read ID for dynamic routing */
typedef struct _Ifx_GTM_ARU_0_DYN_RDADDR_Bits
{
    Ifx_Strict_32Bit DYN_ARU_RDADDR : 9;      /**< \brief [8:0] ARU read address ID to reload the DYN_ROUTE register (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_RDADDR_Bits;

/** \\brief  ARU 0 higher bits of DYN_ROUTE register */
typedef struct _Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits
{
    Ifx_Strict_32Bit DYN_READ_ID3 : 8;        /**< \brief [7:0] ARU read ID 3 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID4 : 8;        /**< \brief [15:8] ARU read ID 4 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID5 : 8;        /**< \brief [23:16] ARU read ID 5 (rw) */
    Ifx_Strict_32Bit DYN_CLK_WAIT : 4;        /**< \brief [27:24] number of clk cycles for dynamic routing (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits;

/** \\brief  ARU 0 lower bits of DYN_ROUTE register */
typedef struct _Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits
{
    Ifx_Strict_32Bit DYN_READ_ID0 : 8;        /**< \brief [7:0] ARU read ID 0 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID1 : 8;        /**< \brief [15:8] ARU read ID 2 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID2 : 8;        /**< \brief [23:16] ARU read ID 2 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits;

/** \\brief  ARU 0 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
typedef struct _Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits
{
    Ifx_Strict_32Bit DYN_READ_ID9 : 8;        /**< \brief [7:0] ARU read ID 9 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID10 : 8;       /**< \brief [15:8] ARU read ID 10 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID11 : 8;       /**< \brief [23:16] ARU read ID 11 (rw) */
    Ifx_Strict_32Bit DYN_CLK_WAIT : 4;        /**< \brief [27:24] number of clk cycles for dynamic routing (rw) */
    Ifx_Strict_32Bit DYN_UPDATE_EN : 1;       /**< \brief [28:28] update enable from shadow register (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits;

/** \\brief  ARU 0 shadow register for ARU_[z]_DYN_ROUTE_LOW */
typedef struct _Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW_Bits
{
    Ifx_Strict_32Bit DYN_READ_ID6 : 8;        /**< \brief [7:0] ARU read ID 6 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID7 : 8;        /**< \brief [15:8] ARU read ID 7 (rw) */
    Ifx_Strict_32Bit DYN_READ_ID8 : 8;        /**< \brief [23:16] ARU read ID 8 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW_Bits;

/** \\brief  ARU 1 dynamic routing control register */
typedef struct _Ifx_GTM_ARU_1_DYN_CTRL_Bits
{
    Ifx_Strict_32Bit DYN_ARU_UPDATE_EN : 1;   /**< \brief [0:0] enable reload of DYN_ROUTE register from ARU itself (rw) */
    Ifx_Strict_32Bit DYN_ROUTE_SWAP : 1;      /**< \brief [1:1] enable swapping DYN_ROUTE_SR with DYN_ROUTE register (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_1_DYN_CTRL_Bits;

/** \\brief  ARU 1 read ID for dynamic routing */
typedef struct _Ifx_GTM_ARU_1_DYN_RDADDR_Bits
{
    Ifx_Strict_32Bit DYN_ARU_RDADDR : 9;      /**< \brief [8:0] ARU read address ID to reload the DYN_ROUTE register (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_ARU_1_DYN_RDADDR_Bits;

