Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ATOM channel 0 ARU read address register */
typedef struct _Ifx_GTM_ATOM_CH_RDADDR_Bits
{
    Ifx_Strict_32Bit RDADDR0 : 9;             /**< \brief [8:0] ARU Read address 0 (rw) */
    Ifx_Strict_32Bit reserved_9 : 7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RDADDR1 : 9;             /**< \brief [24:16] ARU Read address 1 (rw) */
    Ifx_Strict_32Bit reserved_25 : 7;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_RDADDR_Bits;

/** \\brief  ATOM Channel Control Register in SOMI Mode */
typedef struct _Ifx_GTM_ATOM_CH_SOMI_Bits
{
    Ifx_Strict_32Bit MODE : 2;                /**< \brief [1:0] ATOM channel mode select. (rw) */
    Ifx_Strict_32Bit reserved_2 : 1;          /**< \brief [2:2] Not used (rw) */
    Ifx_Strict_32Bit ARU_EN : 1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB0 : 1;                /**< \brief [4:4] ACB bit 0 (rw) */
    Ifx_Strict_32Bit reserved_5 : 6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL : 1;                  /**< \brief [11:11] Initial signal level after channel is enabled (rw) */
    Ifx_Strict_32Bit reserved_12 : 19;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FREEZE : 1;              /**< \brief [31:31] FREEZE (rw) */
} Ifx_GTM_ATOM_CH_SOMI_Bits;

/** \brief  ATOM Channel Control in SOMC mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMC_Bits
{
    Ifx_Strict_32Bit MODE : 2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit TB12_SEL : 1;            /**< \brief [2:2] Select time base value TBU_TS1 or TBU_TS2. (rw) */
    Ifx_Strict_32Bit ARU_EN : 1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB10 : 2;               /**< \brief [5:4] Signal level control bits (rw) */
    Ifx_Strict_32Bit ACB42 : 3;               /**< \brief [8:6] ATOM control bits ACB(4), ACB(3), ACB(2) (rw) */
    Ifx_Strict_32Bit CMP_CTRL : 1;            /**< \brief [9:9] CCUx compare strategy select (rw) */
    Ifx_Strict_32Bit EUPM : 1;                /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL : 1;                  /**< \brief [11:11] Initial signal level after channel enable (rw) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WR_REQ : 1;              /**< \brief [16:16] CPU write request bit (rw) */
    Ifx_Strict_32Bit reserved_17 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EXT_TRIGOUT : 1;         /**< \brief [23:23] External Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx (rw) */
    Ifx_Strict_32Bit TRIGOUT : 1;             /**< \brief [24:24] Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx (rw) */
    Ifx_Strict_32Bit SLA : 1;                 /**< \brief [25:25] Serve last ARU communication strategy (rw) */
    Ifx_Strict_32Bit reserved_26 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ABM : 1;                 /**< \brief [27:27] ARU blocking mode (rw) */
    Ifx_Strict_32Bit reserved_28 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FREEZE : 1;              /**< \brief [31:31] FREEZE (rw) */
} Ifx_GTM_ATOM_CH_SOMC_Bits;

/** \brief  ATOM Channel Control in SOMP mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMP_Bits
{
    Ifx_Strict_32Bit MODE : 2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit reserved_2 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ARU_EN : 1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ADL : 2;                 /**< \brief [5:4] ARU data select for SOMP (r) */
    Ifx_Strict_32Bit BITREV : 1;              /**< \brief [6:6] Bit-reversing of output of counter register CN0 (rw) */
    Ifx_Strict_32Bit SR0_TRIG : 1;            /**< \brief [7:7] SR0 is used to generate a trigger on output ATOM[i]_CH[x]_OUT_T if equal to CN0 (rw) */
    Ifx_Strict_32Bit reserved_8 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL : 1;                  /**< \brief [11:11] Signal level for pulse of PWM (rw) */
    Ifx_Strict_32Bit CLK_SRC_SR : 3;          /**< \brief [14:12] Shadow register for CMU clock source register CLK_SRC (rw) */
    Ifx_Strict_32Bit ECLK_SRC : 1;            /**< \brief [15:15] Extend CLK_SRC (rw) */
    Ifx_Strict_32Bit reserved_16 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TRIG_PULSE : 1;          /**< \brief [17:17] Trigger output pulse length of one SYS_CLK period */
    Ifx_Strict_32Bit UDMODE : 2;              /**< \brief [19:18] Up/down counter mode (rw) */
    Ifx_Strict_32Bit RST_CCU0 : 1;            /**< \brief [20:20] Reset source of CCU0 (rw) */
    Ifx_Strict_32Bit OSM_TRIG : 1;            /**< \brief [21:21] Enable trigger of one-shot pulse by trigger signal OSM_TRIG (rw) */
    Ifx_Strict_32Bit EXT_TRIG : 1;            /**< \brief [22:22] Select TIM_EXT_CAPTURE(x) as trigger signal (rw) */
    Ifx_Strict_32Bit EXT_TRIGOUT : 1;         /**< \brief [23:23] Select TIM_EXT_CAPTURE(x) as potential output signal TRIG_[x] (rw) */
    Ifx_Strict_32Bit TRIGOUT : 1;             /**< \brief [24:24] Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx. (rw) */
    Ifx_Strict_32Bit reserved_25 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSM : 1;                 /**< \brief [26:26] One-shot mode (rw) */
    Ifx_Strict_32Bit reserved_27 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EXT_FUPD : 1;            /**< \brief [29:29] External forced update (rw) */
    Ifx_Strict_32Bit reserved_30 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FREEZE : 1;              /**< \brief [31:31] FREEZE (rw) */
} Ifx_GTM_ATOM_CH_SOMP_Bits;

/** \brief  ATOM Channel Control in SOMS mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMS_Bits
{
    Ifx_Strict_32Bit MODE : 2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit reserved_2 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ARU_EN : 1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB0 : 1;                /**< \brief [4:4] Shift direction for CM1 register (rw) */
    Ifx_Strict_32Bit reserved_5 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCO : 1;                 /**< \brief [7:7] Double Shift Output (rw) */
    Ifx_Strict_32Bit reserved_8 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL : 1;                  /**< \brief [11:11] Defines signal level when channel and output is disable (rw) */
    Ifx_Strict_32Bit CLK_SRC : 3;             /**< \brief [14:12] Shift frequency select for channel (rw) */
    Ifx_Strict_32Bit ECLK_SRC : 1;            /**< \brief [15:15] Extend CLK_SRC (rw) */
    Ifx_Strict_32Bit reserved_16 : 10;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSM : 1;                 /**< \brief [26:26] One-shot mode (rw) */
    Ifx_Strict_32Bit reserved_27 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EXT_FUPD : 1;            /**< \brief [29:29] External forced update (rw) */
    Ifx_Strict_32Bit reserved_30 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FREEZE : 1;              /**< \brief [31:31] FREEZE (rw) */
} Ifx_GTM_ATOM_CH_SOMS_Bits;

/** \brief  ATOM Channel Control in SOMB mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMB_Bits
{
    Ifx_Strict_32Bit MODE : 2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit TB12_SEL : 1;            /**< \brief [2:2] Select time base value TBU_TS1 or TBU_TS2. (rw) */
    Ifx_Strict_32Bit ARU_EN : 1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB10 : 2;               /**< \brief [5:4] Signal level control bits (rw) */
    Ifx_Strict_32Bit ACB42 : 3;               /**< \brief [8:6] ATOM control bits ACB(4), ACB(3), ACB(2) (rw) */
    Ifx_Strict_32Bit CMP_CTRL : 1;            /**< \brief [9:9] CCUx compare strategy select (rw) */
    Ifx_Strict_32Bit EUPM : 1;                /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL : 1;                  /**< \brief [11:11] Initial signal level after channel enable (rw) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WR_REQ : 1;              /**< \brief [16:16] CPU write request bit (rw) */
    Ifx_Strict_32Bit reserved_17 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EXT_TRIGOUT : 1;         /**< \brief [23:23] External Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx (rw) */
    Ifx_Strict_32Bit TRIGOUT : 1;             /**< \brief [24:24] Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx (rw) */
    Ifx_Strict_32Bit reserved_25 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ABM : 1;                 /**< \brief [27:27] ARU blocking mode (rw) */
    Ifx_Strict_32Bit reserved_28 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SOMB : 1;                /**< \brief [30:30] ARU blocking mode (rw) */
    Ifx_Strict_32Bit FREEZE : 1;              /**< \brief [31:31] FREEZE (rw) */
} Ifx_GTM_ATOM_CH_SOMB_Bits;

