Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ATOM channel 0 CCU0 compare shadow register */
typedef struct _Ifx_GTM_ATOM_CH_SR0_Bits
{
    Ifx_Strict_32Bit SR0 : 24;                /**< \brief [23:0] ATOM channel x shadow register SR0 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SR0_Bits;

/** \\brief  ATOM channel 0 CCU1 compare shadow register */
typedef struct _Ifx_GTM_ATOM_CH_SR1_Bits
{
    Ifx_Strict_32Bit SR1 : 24;                /**< \brief [23:0] ATOM channel x shadow register SR0 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SR1_Bits;

/** \\brief  ATOM channel 0 status register */
typedef struct _Ifx_GTM_ATOM_CH_STAT_Bits
{
    Ifx_Strict_32Bit OL : 1;                  /**< \brief [0:0] Actual output signal level of ATOM_CHx_OUT (r) */
    Ifx_Strict_32Bit reserved_1 : 15;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBI : 5;                /**< \brief [20:16] ATOM Mode control bits (r) */
    Ifx_Strict_32Bit DV : 1;                  /**< \brief [21:21] Valid ARU Data stored in compare registers (r) */
    Ifx_Strict_32Bit WRF : 1;                 /**< \brief [22:22] Write request of CPU failed for late update (rw) */
    Ifx_Strict_32Bit DR : 1;                  /**< \brief [23:23] ARU data rejected flag (r) */
    Ifx_Strict_32Bit ACBO : 5;                /**< \brief [28:24] ATOM Internal status bits (r) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_STAT_Bits;

/** \\brief  GTM ATOM   Output Level */
typedef struct _Ifx_GTM_ATOM_OUT_Bits
{
    Ifx_Strict_32Bit ATOM_I_OUT : 8;          /**< \brief [7:0] Output level snapshot of ATOM[i]_OUT all channels (i=0,2,4,6,8,10) (r) */
    Ifx_Strict_32Bit ATOM_I_OUT_N : 8;        /**< \brief [15:8] Output level snapshot of ATOM[i]_OUT_N all channels (i=0,2,4,6,8,10) (r) */
    Ifx_Strict_32Bit ATOM_IP1_OUT : 8;        /**< \brief [23:16] Output level snapshot of ATOM[i+1]_OUT all channels (i=0,2,4,6,8,10) (r) */
    Ifx_Strict_32Bit ATOM_IP1_OUT_N : 8;      /**< \brief [31:24] Output level snapshot of ATOM[i+1]_OUT_N all channels (i=0,2,4,6,8,10) (r) */
} Ifx_GTM_ATOM_OUT_Bits;

/** \\brief  BRC error interrupt enable register */
typedef struct _Ifx_GTM_BRC_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_EIRQ_EN : 1;    /**< \brief [0:0] BRC_DEST_ERR_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN0 : 1;        /**< \brief [1:1] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN1 : 1;        /**< \brief [2:2] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN2 : 1;        /**< \brief [3:3] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN3 : 1;        /**< \brief [4:4] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN4 : 1;        /**< \brief [5:5] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN5 : 1;        /**< \brief [6:6] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN6 : 1;        /**< \brief [7:7] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN7 : 1;        /**< \brief [8:8] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN8 : 1;        /**< \brief [9:9] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN9 : 1;        /**< \brief [10:10] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN10 : 1;       /**< \brief [11:11] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_EIRQ_EN11 : 1;       /**< \brief [12:12] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit Reserved : 19;           /**< \brief [31:13] Reserved: Reserved (r) */
} Ifx_GTM_BRC_EIRQ_EN_Bits;

/** \\brief  BRC interrupt enable register */
typedef struct _Ifx_GTM_BRC_IRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_IRQ_EN : 1;     /**< \brief [0:0] BRC_DEST_ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN0 : 1;         /**< \brief [1:1] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN1 : 1;         /**< \brief [2:2] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN2 : 1;         /**< \brief [3:3] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN3 : 1;         /**< \brief [4:4] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN4 : 1;         /**< \brief [5:5] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN5 : 1;         /**< \brief [6:6] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN6 : 1;         /**< \brief [7:7] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN7 : 1;         /**< \brief [8:8] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN8 : 1;         /**< \brief [9:9] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN9 : 1;         /**< \brief [10:10] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN10 : 1;        /**< \brief [11:11] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit DID_IRQ_EN11 : 1;        /**< \brief [12:12] Enable DID interrupt (rw) */
    Ifx_Strict_32Bit Reserved : 19;           /**< \brief [31:13] Reserved: Reserved (r) */
} Ifx_GTM_BRC_IRQ_EN_Bits;

/** \\brief  BRC force interrupt register */
typedef struct _Ifx_GTM_BRC_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_DEST_ERR : 1;        /**< \brief [0:0] Trigger destination error interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID0 : 1;            /**< \brief [1:1] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID1 : 1;            /**< \brief [2:2] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID2 : 1;            /**< \brief [3:3] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID3 : 1;            /**< \brief [4:4] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID4 : 1;            /**< \brief [5:5] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID5 : 1;            /**< \brief [6:6] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID6 : 1;            /**< \brief [7:7] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID7 : 1;            /**< \brief [8:8] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID8 : 1;            /**< \brief [9:9] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID9 : 1;            /**< \brief [10:10] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID10 : 1;           /**< \brief [11:11] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit TRG_DID11 : 1;           /**< \brief [12:12] Trigger DID interrupt (rw) */
    Ifx_Strict_32Bit Reserved : 19;           /**< \brief [31:13] Reserved: Reserved (r) */
} Ifx_GTM_BRC_IRQ_FORCINT_Bits;

/** \\brief  BRC interrupt mode configuration register */
typedef struct _Ifx_GTM_BRC_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_MODE_Bits;

