Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  BRC interrupt notification register */
typedef struct _Ifx_GTM_BRC_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit DEST_ERR : 1;            /**< \brief [0:0] Configuration error interrupt for BRC sub-module (rw) */
    Ifx_Strict_32Bit DID0 : 1;                /**< \brief [1:1] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID1 : 1;                /**< \brief [2:2] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID2 : 1;                /**< \brief [3:3] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID3 : 1;                /**< \brief [4:4] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID4 : 1;                /**< \brief [5:5] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID5 : 1;                /**< \brief [6:6] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID6 : 1;                /**< \brief [7:7] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID7 : 1;                /**< \brief [8:8] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID8 : 1;                /**< \brief [9:9] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID9 : 1;                /**< \brief [10:10] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID10 : 1;               /**< \brief [11:11] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit DID11 : 1;               /**< \brief [12:12] Data inconsistency occurred in MTM mode (rw) */
    Ifx_Strict_32Bit Reserved : 19;           /**< \brief [31:13] Reserved: Reserved (r) */
} Ifx_GTM_BRC_IRQ_NOTIFY_Bits;

/** \\brief  BRC software reset register */
typedef struct _Ifx_GTM_BRC_RST_Bits
{
    Ifx_Strict_32Bit RST : 1;                 /**< \brief [0:0] Software reset (rw) */
    Ifx_Strict_32Bit reserved_1 : 31;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_RST_Bits;

/** \\brief  BRC read address for input channel 0 */
typedef struct _Ifx_GTM_BRC_SRC_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR : 9;                /**< \brief [8:0] Source ARU address. Define an ARU read address used as data source for input channel z (rw) */
    Ifx_Strict_32Bit reserved_9 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRC_MODE : 1;            /**< \brief [12:12] BRC_MODE: BRC Operation mode select. (rw) */
    Ifx_Strict_32Bit reserved_13 : 19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_SRC_ADDR_Bits;

/** \\brief  BRC destination channels for input channel 0 */
typedef struct _Ifx_GTM_BRC_SRC_DEST_Bits
{
    Ifx_Strict_32Bit EN_DEST0 : 1;            /**< \brief [0:0] Enable BRC destination address 0 (rw) */
    Ifx_Strict_32Bit EN_DEST1 : 1;            /**< \brief [1:1] Enable BRC destination address 1 (rw) */
    Ifx_Strict_32Bit EN_DEST2 : 1;            /**< \brief [2:2] Enable BRC destination address 2 (rw) */
    Ifx_Strict_32Bit EN_DEST3 : 1;            /**< \brief [3:3] Enable BRC destination address 3 (rw) */
    Ifx_Strict_32Bit EN_DEST4 : 1;            /**< \brief [4:4] Enable BRC destination address 4 (rw) */
    Ifx_Strict_32Bit EN_DEST5 : 1;            /**< \brief [5:5] Enable BRC destination address 5 (rw) */
    Ifx_Strict_32Bit EN_DEST6 : 1;            /**< \brief [6:6] Enable BRC destination address 6 (rw) */
    Ifx_Strict_32Bit EN_DEST7 : 1;            /**< \brief [7:7] Enable BRC destination address 7 (rw) */
    Ifx_Strict_32Bit EN_DEST8 : 1;            /**< \brief [8:8] Enable BRC destination address 8 (rw) */
    Ifx_Strict_32Bit EN_DEST9 : 1;            /**< \brief [9:9] Enable BRC destination address 9 (rw) */
    Ifx_Strict_32Bit EN_DEST10 : 1;           /**< \brief [10:10] Enable BRC destination address 10 (rw) */
    Ifx_Strict_32Bit EN_DEST11 : 1;           /**< \brief [11:11] Enable BRC destination address 11 (rw) */
    Ifx_Strict_32Bit EN_DEST12 : 1;           /**< \brief [12:12] Enable BRC destination address 12 (rw) */
    Ifx_Strict_32Bit EN_DEST13 : 1;           /**< \brief [13:13] Enable BRC destination address 13 (rw) */
    Ifx_Strict_32Bit EN_DEST14 : 1;           /**< \brief [14:14] Enable BRC destination address 14 (rw) */
    Ifx_Strict_32Bit EN_DEST15 : 1;           /**< \brief [15:15] Enable BRC destination address 15 (rw) */
    Ifx_Strict_32Bit EN_DEST16 : 1;           /**< \brief [16:16] Enable BRC destination address 16 (rw) */
    Ifx_Strict_32Bit EN_DEST17 : 1;           /**< \brief [17:17] Enable BRC destination address 17 (rw) */
    Ifx_Strict_32Bit EN_DEST18 : 1;           /**< \brief [18:18] Enable BRC destination address 18 (rw) */
    Ifx_Strict_32Bit EN_DEST19 : 1;           /**< \brief [19:19] Enable BRC destination address 19 (rw) */
    Ifx_Strict_32Bit EN_DEST20 : 1;           /**< \brief [20:20] Enable BRC destination address 20 (rw) */
    Ifx_Strict_32Bit EN_DEST21 : 1;           /**< \brief [21:21] Enable BRC destination address 21 (rw) */
    Ifx_Strict_32Bit EN_TRASHBIN : 1;         /**< \brief [22:22] EN_TRASHBIN: Control trash bin functionality. (rw) */
    Ifx_Strict_32Bit Reserved : 9;            /**< \brief [31:23] Reserved: Reserved (r) */
} Ifx_GTM_BRC_SRC_DEST_Bits;

/** \\brief  GTM AEI bridge mode register */
typedef struct _Ifx_GTM_BRIDGE_MODE_Bits
{
    Ifx_Strict_32Bit BRG_MODE : 1;            /**< \brief [0:0] Defines the operation mode for the AEI bridge. (rw) */
    Ifx_Strict_32Bit MSK_WR_RSP : 1;          /**< \brief [1:1] Mask write response. (rw) */
    Ifx_Strict_32Bit BYPASS_SYNC : 1;         /**< \brief [2:2] Bypass synchronizer flip-flops. (rw) */
    Ifx_Strict_32Bit reserved_3 : 5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MODE_UP_PGR : 1;         /**< \brief [8:8] Mode update in progress. (r) */
    Ifx_Strict_32Bit BUFF_OVL : 1;            /**< \brief [9:9] Buffer overflow register. (rw) */
    Ifx_Strict_32Bit reserved_10 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SYNC_INPUT_REG : 1;      /**< \brief [12:12] additional pipelined stage in synchronous bridge mode (r) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRG_RST : 1;             /**< \brief [16:16] Bridge software reset. (rw) */
    Ifx_Strict_32Bit reserved_17 : 7;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUFF_DPT : 8;            /**< \brief [31:24] Buffer depth of AEI bridge. (r) */
} Ifx_GTM_BRIDGE_MODE_Bits;

/** \\brief  GTM AEI bridge pointer 1 register */
typedef struct _Ifx_GTM_BRIDGE_PTR1_Bits
{
    Ifx_Strict_32Bit NEW_TRAN_PTR : 5;        /**< \brief [4:0] New transaction pointer. (r) */
    Ifx_Strict_32Bit FIRST_RSP_PTR : 5;       /**< \brief [9:5] First response pointer. (r) */
    Ifx_Strict_32Bit TRAN_IN_PGR : 5;         /**< \brief [14:10] Transaction in progress pointer (acquire) (r) */
    Ifx_Strict_32Bit ABT_TRAN_PGR : 5;        /**< \brief [19:15] Aborted transaction in progress pointer. (r) */
    Ifx_Strict_32Bit FBC : 6;                 /**< \brief [25:20] Free buffer count. (r) */
    Ifx_Strict_32Bit RSP_TRAN_RDY : 6;        /**< \brief [31:26] Response transactions ready. (r) */
} Ifx_GTM_BRIDGE_PTR1_Bits;

/** \\brief  GTM AEI bridge pointer 2 register */
typedef struct _Ifx_GTM_BRIDGE_PTR2_Bits
{
    Ifx_Strict_32Bit TRAN_IN_PGR2 : 5;        /**< \brief [4:0] Transaction in progress pointer (aquire2) (r) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_BRIDGE_PTR2_Bits;

/** \\brief  CCM10 Configuration Register */
typedef struct _Ifx_GTM_CCM10_CFG_Bits
{
    Ifx_Strict_32Bit EN_TIM : 1;              /**< \brief [0:0] Enable TIM (rw) */
    Ifx_Strict_32Bit EN_TOM_SPE_TDTM : 1;     /**< \brief [1:1] Enable TOM, SPE and TDTM (rw) */
    Ifx_Strict_32Bit EN_ATOM_ADTM : 1;        /**< \brief [2:2] Enable ATOM and ADTM (rw) */
    Ifx_Strict_32Bit EN_MCS : 1;              /**< \brief [3:3] Enable MCS (rw) */
    Ifx_Strict_32Bit EN_DPLL_MAP : 1;         /**< \brief [4:4] Enable DPLL and MAP (rw) */
    Ifx_Strict_32Bit EN_BRC : 1;              /**< \brief [5:5] Enable BRC (rw) */
    Ifx_Strict_32Bit EN_PSM : 1;              /**< \brief [6:6] Enable PSM (rw) */
    Ifx_Strict_32Bit EN_CMP_MON : 1;          /**< \brief [7:7] Enable CMP and MON (rw) */
    Ifx_Strict_32Bit reserved_8 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLS_CLK_DIV : 2;         /**< \brief [17:16] Cluster Clock Divider (r) */
    Ifx_Strict_32Bit reserved_18 : 12;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TBU_DIR1 : 1;            /**< \brief [30:30] DIR1 input signal of module TBU (r) */
    Ifx_Strict_32Bit TBU_DIR2 : 1;            /**< \brief [31:31] DIR2 input signal of module TBU (r) */
} Ifx_GTM_CCM10_CFG_Bits;

/** \\brief  CCM10 CMU Clock Configuration Register */
typedef struct _Ifx_GTM_CCM10_CMU_CLK_CFG_Bits
{
    Ifx_Strict_32Bit CLK0_SRC : 2;            /**< \brief [1:0] Clock 0 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_2 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK1_SRC : 2;            /**< \brief [5:4] Clock 1 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_6 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK2_SRC : 2;            /**< \brief [9:8] Clock 2 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_10 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK3_SRC : 2;            /**< \brief [13:12] Clock 3 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_14 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK4_SRC : 2;            /**< \brief [17:16] Clock 4 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_18 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK5_SRC : 2;            /**< \brief [21:20] Clock 5 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_22 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK6_SRC : 2;            /**< \brief [25:24] Clock 6 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_26 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK7_SRC : 2;            /**< \brief [29:28] Clock 7 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_30 : 2;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM10_CMU_CLK_CFG_Bits;

/** \\brief  CCM10 CMU Fixed Clock Configuration Register */
typedef struct _Ifx_GTM_CCM10_CMU_FXCLK_CFG_Bits
{
    Ifx_Strict_32Bit FXCLK0_SRC : 4;          /**< \brief [3:0] Fixed clock 0 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM10_CMU_FXCLK_CFG_Bits;

/** \\brief  CCM10 Hardware Configuration */
typedef struct _Ifx_GTM_CCM10_HW_CONF_Bits
{
    Ifx_Strict_32Bit GRSTEN : 1;                /**< \brief [0:0] Global Reset Enable (r) */
    Ifx_Strict_32Bit BRIDGE_MODE_RST : 1;       /**< \brief [1:1] Bridge mode after reset (r) */
    Ifx_Strict_32Bit SYNC_INPUT_REG : 1;        /**< \brief [2:2] Additional pipelined stage in synchronous bridge mode (r) */
    Ifx_Strict_32Bit CFG_CLOCK_RATE : 1;        /**< \brief [3:3] Clocks per ARU transfer (r) */
    Ifx_Strict_32Bit ATOM_OUT_RST : 1;          /**< \brief [4:4] ATOM_OUT reset level (r) */
    Ifx_Strict_32Bit ATOM_TRIG_CHAIN : 3;       /**< \brief [7:5] ATOM trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit TOM_OUT_RST : 1;           /**< \brief [8:8] TOM_OUT reset level (r) */
    Ifx_Strict_32Bit TOM_TRIG_CHAIN : 3;        /**< \brief [11:9] TOM trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit RAM_INIT_RST : 1;          /**< \brief [12:12] RAM initialization from reset (r) */
    Ifx_Strict_32Bit ERM : 1;                   /**< \brief [13:13] enable RAM1 MSB for available MCS modules (r) */
    Ifx_Strict_32Bit ARU_CONNECT_CONFIG : 1;    /**< \brief [14:14] Defines number of parallel ARU ports (r) */
    Ifx_Strict_32Bit reserved_15 : 1;           /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IRQ_MODE_LEVEL : 1;        /**< \brief [16:16] IRQ_MODE_LEVEL (r) */
    Ifx_Strict_32Bit IRQ_MODE_PULSE : 1;        /**< \brief [17:17] IRQ_MODE_PULSE (r) */
    Ifx_Strict_32Bit IRQ_MODE_PULSE_NOTIFY : 1; /**< \brief [18:18] IRQ_MODE_PULSE_NOTIFY (r) */
    Ifx_Strict_32Bit IRQ_MODE_SINGLE_PULSE : 1; /**< \brief [19:19] IRQ_MODE_SINGLE_PULSE (r) */
    Ifx_Strict_32Bit ATOM_TRIG_INTCHAIN : 4;    /**< \brief [23:20] ATOM internal trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit TOM_TRIG_INTCHAIN : 5;     /**< \brief [28:24] TOM internal trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit INT_CLK_EN_GEN : 1;        /**< \brief [29:29] Internal clock enable generation (r) */
    Ifx_Strict_32Bit reserved_30 : 2;           /**< \brief \internal Reserved */
} Ifx_GTM_CCM10_HW_CONF_Bits;

/** \\brief  CCM10 Protection Register */
typedef struct _Ifx_GTM_CCM10_PROT_Bits
{
    Ifx_Strict_32Bit CLS_PROT : 1;            /**< \brief [0:0] Cluster Protection (rw) */
    Ifx_Strict_32Bit Reserved : 31;           /**< \brief [31:1] Read as zero, should be written as zero. (r) */
} Ifx_GTM_CCM10_PROT_Bits;

