Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CCM11 Configuration Register */
typedef struct _Ifx_GTM_CCM11_CFG_Bits
{
    Ifx_Strict_32Bit EN_TIM : 1;              /**< \brief [0:0] Enable TIM (rw) */
    Ifx_Strict_32Bit EN_TOM_SPE_TDTM : 1;     /**< \brief [1:1] Enable TOM, SPE and TDTM (rw) */
    Ifx_Strict_32Bit EN_ATOM_ADTM : 1;        /**< \brief [2:2] Enable ATOM and ADTM (rw) */
    Ifx_Strict_32Bit EN_MCS : 1;              /**< \brief [3:3] Enable MCS (rw) */
    Ifx_Strict_32Bit EN_DPLL_MAP : 1;         /**< \brief [4:4] Enable DPLL and MAP (rw) */
    Ifx_Strict_32Bit EN_BRC : 1;              /**< \brief [5:5] Enable BRC (rw) */
    Ifx_Strict_32Bit EN_PSM : 1;              /**< \brief [6:6] Enable PSM (rw) */
    Ifx_Strict_32Bit EN_CMP_MON : 1;          /**< \brief [7:7] Enable CMP and MON (rw) */
    Ifx_Strict_32Bit reserved_8 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLS_CLK_DIV : 2;         /**< \brief [17:16] Cluster Clock Divider (r) */
    Ifx_Strict_32Bit reserved_18 : 12;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TBU_DIR1 : 1;            /**< \brief [30:30] DIR1 input signal of module TBU (r) */
    Ifx_Strict_32Bit TBU_DIR2 : 1;            /**< \brief [31:31] DIR2 input signal of module TBU (r) */
} Ifx_GTM_CCM11_CFG_Bits;

/** \\brief  CCM11 CMU Clock Configuration Register */
typedef struct _Ifx_GTM_CCM11_CMU_CLK_CFG_Bits
{
    Ifx_Strict_32Bit CLK0_SRC : 2;            /**< \brief [1:0] Clock 0 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_2 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK1_SRC : 2;            /**< \brief [5:4] Clock 1 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_6 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK2_SRC : 2;            /**< \brief [9:8] Clock 2 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_10 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK3_SRC : 2;            /**< \brief [13:12] Clock 3 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_14 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK4_SRC : 2;            /**< \brief [17:16] Clock 4 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_18 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK5_SRC : 2;            /**< \brief [21:20] Clock 5 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_22 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK6_SRC : 2;            /**< \brief [25:24] Clock 6 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_26 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK7_SRC : 2;            /**< \brief [29:28] Clock 7 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_30 : 2;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM11_CMU_CLK_CFG_Bits;

/** \\brief  CCM11 CMU Fixed Clock Configuration Register */
typedef struct _Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits
{
    Ifx_Strict_32Bit FXCLK0_SRC : 4;          /**< \brief [3:0] Fixed clock 0 source signal selector (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits;

/** \\brief  CCM11 Hardware Configuration */
typedef struct _Ifx_GTM_CCM11_HW_CONF_Bits
{
    Ifx_Strict_32Bit GRSTEN : 1;                /**< \brief [0:0] Global Reset Enable (r) */
    Ifx_Strict_32Bit BRIDGE_MODE_RST : 1;       /**< \brief [1:1] Bridge mode after reset (r) */
    Ifx_Strict_32Bit SYNC_INPUT_REG : 1;        /**< \brief [2:2] Additional pipelined stage in synchronous bridge mode (r) */
    Ifx_Strict_32Bit CFG_CLOCK_RATE : 1;        /**< \brief [3:3] Clocks per ARU transfer (r) */
    Ifx_Strict_32Bit ATOM_OUT_RST : 1;          /**< \brief [4:4] ATOM_OUT reset level (r) */
    Ifx_Strict_32Bit ATOM_TRIG_CHAIN : 3;       /**< \brief [7:5] ATOM trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit TOM_OUT_RST : 1;           /**< \brief [8:8] TOM_OUT reset level (r) */
    Ifx_Strict_32Bit TOM_TRIG_CHAIN : 3;        /**< \brief [11:9] TOM trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit RAM_INIT_RST : 1;          /**< \brief [12:12] RAM initialization from reset (r) */
    Ifx_Strict_32Bit ERM : 1;                   /**< \brief [13:13] enable RAM1 MSB for available MCS modules (r) */
    Ifx_Strict_32Bit ARU_CONNECT_CONFIG : 1;    /**< \brief [14:14] Defines number of parallel ARU ports (r) */
    Ifx_Strict_32Bit reserved_15 : 1;           /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IRQ_MODE_LEVEL : 1;        /**< \brief [16:16] IRQ_MODE_LEVEL (r) */
    Ifx_Strict_32Bit IRQ_MODE_PULSE : 1;        /**< \brief [17:17] IRQ_MODE_PULSE (r) */
    Ifx_Strict_32Bit IRQ_MODE_PULSE_NOTIFY : 1; /**< \brief [18:18] IRQ_MODE_PULSE_NOTIFY (r) */
    Ifx_Strict_32Bit IRQ_MODE_SINGLE_PULSE : 1; /**< \brief [19:19] IRQ_MODE_SINGLE_PULSE (r) */
    Ifx_Strict_32Bit ATOM_TRIG_INTCHAIN : 4;    /**< \brief [23:20] ATOM internal trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit TOM_TRIG_INTCHAIN : 5;     /**< \brief [28:24] TOM internal trigger chain length without synchronization register (r) */
    Ifx_Strict_32Bit INT_CLK_EN_GEN : 1;        /**< \brief [29:29] Internal clock enable generation (r) */
    Ifx_Strict_32Bit reserved_30 : 2;           /**< \brief \internal Reserved */
} Ifx_GTM_CCM11_HW_CONF_Bits;

/** \\brief  CCM11 Protection Register */
typedef struct _Ifx_GTM_CCM11_PROT_Bits
{
    Ifx_Strict_32Bit CLS_PROT : 1;            /**< \brief [0:0] Cluster Protection (rw) */
    Ifx_Strict_32Bit Reserved : 31;           /**< \brief [31:1] Read as zero, should be written as zero. (r) */
} Ifx_GTM_CCM11_PROT_Bits;

/** \\brief  CCM MCS Bus Master Status Register */
typedef struct _Ifx_GTM_CCM_AEIM_STA_Bits
{
    Ifx_Strict_32Bit AEIM_XPT_ADDR : 16;      /**< \brief [15:0] Exception Address (rw) */
    Ifx_Strict_32Bit reserved_16 : 8;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AEIM_XPT_STA : 2;        /**< \brief [25:24] AEIM Exception status (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_AEIM_STA_Bits;

/** \\brief  CCM Address Range Protector 0 Control Register */
typedef struct _Ifx_GTM_CCM_ARP0_CTRL_Bits
{
    Ifx_Strict_32Bit ADDR : 16;               /**< \brief [15:0] ARP base address (rw) */
    Ifx_Strict_32Bit SIZE : 4;                /**< \brief [19:16] Size of ARP (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DIS_PROT : 1;            /**< \brief [24:24] Disable ARP protection. (rw) */
    Ifx_Strict_32Bit reserved_25 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WPROT_AEI : 1;           /**< \brief [31:31] AEI slave write protection. (rw) */
} Ifx_GTM_CCM_ARP0_CTRL_Bits;

