Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CCM Address Range Protector 0 Protection Register */
typedef struct _Ifx_GTM_CCM_ARP0_PROT_Bits
{
    Ifx_Strict_32Bit WPROT0 : 1;              /**< \brief [0:0] Write Protection MCS channel 0 (rw) */
    Ifx_Strict_32Bit WPROT1 : 1;              /**< \brief [1:1] Write Protection MCS channel 1 (rw) */
    Ifx_Strict_32Bit WPROT2 : 1;              /**< \brief [2:2] Write Protection MCS channel 2 (rw) */
    Ifx_Strict_32Bit WPROT3 : 1;              /**< \brief [3:3] Write Protection MCS channel 3 (rw) */
    Ifx_Strict_32Bit WPROT4 : 1;              /**< \brief [4:4] Write Protection MCS channel 4 (rw) */
    Ifx_Strict_32Bit WPROT5 : 1;              /**< \brief [5:5] Write Protection MCS channel 5 (rw) */
    Ifx_Strict_32Bit WPROT6 : 1;              /**< \brief [6:6] Write Protection MCS channel 6 (rw) */
    Ifx_Strict_32Bit WPROT7 : 1;              /**< \brief [7:7] Write Protection MCS channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_ARP0_PROT_Bits;

/** \\brief  CCM Address Range Protector 1 Control Register */
typedef struct _Ifx_GTM_CCM_ARP1_CTRL_Bits
{
    Ifx_Strict_32Bit ADDR : 16;               /**< \brief [15:0] ARP base address (rw) */
    Ifx_Strict_32Bit SIZE : 4;                /**< \brief [19:16] Size of ARP (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DIS_PROT : 1;            /**< \brief [24:24] Disable ARP protection. (rw) */
    Ifx_Strict_32Bit reserved_25 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WPROT_AEI : 1;           /**< \brief [31:31] AEI slave write protection. (rw) */
} Ifx_GTM_CCM_ARP1_CTRL_Bits;

/** \\brief  CCM Address Range Protector 1 Protection Register */
typedef struct _Ifx_GTM_CCM_ARP1_PROT_Bits
{
    Ifx_Strict_32Bit WPROT0 : 1;              /**< \brief [0:0] Write Protection MCS channel 0 (rw) */
    Ifx_Strict_32Bit WPROT1 : 1;              /**< \brief [1:1] Write Protection MCS channel 1 (rw) */
    Ifx_Strict_32Bit WPROT2 : 1;              /**< \brief [2:2] Write Protection MCS channel 2 (rw) */
    Ifx_Strict_32Bit WPROT3 : 1;              /**< \brief [3:3] Write Protection MCS channel 3 (rw) */
    Ifx_Strict_32Bit WPROT4 : 1;              /**< \brief [4:4] Write Protection MCS channel 4 (rw) */
    Ifx_Strict_32Bit WPROT5 : 1;              /**< \brief [5:5] Write Protection MCS channel 5 (rw) */
    Ifx_Strict_32Bit WPROT6 : 1;              /**< \brief [6:6] Write Protection MCS channel 6 (rw) */
    Ifx_Strict_32Bit WPROT7 : 1;              /**< \brief [7:7] Write Protection MCS channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_ARP1_PROT_Bits;

/** \\brief  CCM Address Range Protector 2 Control Register */
typedef struct _Ifx_GTM_CCM_ARP2_CTRL_Bits
{
    Ifx_Strict_32Bit ADDR : 16;               /**< \brief [15:0] ARP base address (rw) */
    Ifx_Strict_32Bit SIZE : 4;                /**< \brief [19:16] Size of ARP (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DIS_PROT : 1;            /**< \brief [24:24] Disable ARP protection. (rw) */
    Ifx_Strict_32Bit reserved_25 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WPROT_AEI : 1;           /**< \brief [31:31] AEI slave write protection. (rw) */
} Ifx_GTM_CCM_ARP2_CTRL_Bits;

/** \\brief  CCM Address Range Protector 2 Protection Register */
typedef struct _Ifx_GTM_CCM_ARP2_PROT_Bits
{
    Ifx_Strict_32Bit WPROT0 : 1;              /**< \brief [0:0] Write Protection MCS channel 0 (rw) */
    Ifx_Strict_32Bit WPROT1 : 1;              /**< \brief [1:1] Write Protection MCS channel 1 (rw) */
    Ifx_Strict_32Bit WPROT2 : 1;              /**< \brief [2:2] Write Protection MCS channel 2 (rw) */
    Ifx_Strict_32Bit WPROT3 : 1;              /**< \brief [3:3] Write Protection MCS channel 3 (rw) */
    Ifx_Strict_32Bit WPROT4 : 1;              /**< \brief [4:4] Write Protection MCS channel 4 (rw) */
    Ifx_Strict_32Bit WPROT5 : 1;              /**< \brief [5:5] Write Protection MCS channel 5 (rw) */
    Ifx_Strict_32Bit WPROT6 : 1;              /**< \brief [6:6] Write Protection MCS channel 6 (rw) */
    Ifx_Strict_32Bit WPROT7 : 1;              /**< \brief [7:7] Write Protection MCS channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_ARP2_PROT_Bits;

/** \\brief  CCM Address Range Protector 3 Control Register */
typedef struct _Ifx_GTM_CCM_ARP3_CTRL_Bits
{
    Ifx_Strict_32Bit ADDR : 16;               /**< \brief [15:0] ARP base address (rw) */
    Ifx_Strict_32Bit SIZE : 4;                /**< \brief [19:16] Size of ARP (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DIS_PROT : 1;            /**< \brief [24:24] Disable ARP protection. (rw) */
    Ifx_Strict_32Bit reserved_25 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WPROT_AEI : 1;           /**< \brief [31:31] AEI slave write protection. (rw) */
} Ifx_GTM_CCM_ARP3_CTRL_Bits;

/** \\brief  CCM Address Range Protector 3 Protection Register */
typedef struct _Ifx_GTM_CCM_ARP3_PROT_Bits
{
    Ifx_Strict_32Bit WPROT0 : 1;              /**< \brief [0:0] Write Protection MCS channel 0 (rw) */
    Ifx_Strict_32Bit WPROT1 : 1;              /**< \brief [1:1] Write Protection MCS channel 1 (rw) */
    Ifx_Strict_32Bit WPROT2 : 1;              /**< \brief [2:2] Write Protection MCS channel 2 (rw) */
    Ifx_Strict_32Bit WPROT3 : 1;              /**< \brief [3:3] Write Protection MCS channel 3 (rw) */
    Ifx_Strict_32Bit WPROT4 : 1;              /**< \brief [4:4] Write Protection MCS channel 4 (rw) */
    Ifx_Strict_32Bit WPROT5 : 1;              /**< \brief [5:5] Write Protection MCS channel 5 (rw) */
    Ifx_Strict_32Bit WPROT6 : 1;              /**< \brief [6:6] Write Protection MCS channel 6 (rw) */
    Ifx_Strict_32Bit WPROT7 : 1;              /**< \brief [7:7] Write Protection MCS channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_ARP3_PROT_Bits;

/** \\brief  CCM Address Range Protector 4 Control Register */
typedef struct _Ifx_GTM_CCM_ARP4_CTRL_Bits
{
    Ifx_Strict_32Bit ADDR : 16;               /**< \brief [15:0] ARP base address (rw) */
    Ifx_Strict_32Bit SIZE : 4;                /**< \brief [19:16] Size of ARP (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DIS_PROT : 1;            /**< \brief [24:24] Disable ARP protection. (rw) */
    Ifx_Strict_32Bit reserved_25 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WPROT_AEI : 1;           /**< \brief [31:31] AEI slave write protection. (rw) */
} Ifx_GTM_CCM_ARP4_CTRL_Bits;

/** \\brief  CCM Address Range Protector 4 Protection Register */
typedef struct _Ifx_GTM_CCM_ARP4_PROT_Bits
{
    Ifx_Strict_32Bit WPROT0 : 1;              /**< \brief [0:0] Write Protection MCS channel 0 (rw) */
    Ifx_Strict_32Bit WPROT1 : 1;              /**< \brief [1:1] Write Protection MCS channel 1 (rw) */
    Ifx_Strict_32Bit WPROT2 : 1;              /**< \brief [2:2] Write Protection MCS channel 2 (rw) */
    Ifx_Strict_32Bit WPROT3 : 1;              /**< \brief [3:3] Write Protection MCS channel 3 (rw) */
    Ifx_Strict_32Bit WPROT4 : 1;              /**< \brief [4:4] Write Protection MCS channel 4 (rw) */
    Ifx_Strict_32Bit WPROT5 : 1;              /**< \brief [5:5] Write Protection MCS channel 5 (rw) */
    Ifx_Strict_32Bit WPROT6 : 1;              /**< \brief [6:6] Write Protection MCS channel 6 (rw) */
    Ifx_Strict_32Bit WPROT7 : 1;              /**< \brief [7:7] Write Protection MCS channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CCM_ARP4_PROT_Bits;

