Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CDTM5 DTM5 global configuration and control register */
typedef struct _Ifx_GTM_CDTM5_DTM5_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_SEL : 2;             /**< \brief [1:0] Clock source select (rw) */
    Ifx_Strict_32Bit DTM_SEL : 2;             /**< \brief [3:2] Select DTM update and SHUT_OFF reset signal (rw) */
    Ifx_Strict_32Bit UPD_MODE : 3;            /**< \brief [6:4] Update mode (rw) */
    Ifx_Strict_32Bit reserved_7 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SR_UPD_EN : 1;           /**< \brief [8:8] shadow register update enable (rw) */
    Ifx_Strict_32Bit reserved_9 : 7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SHUT_OFF_RST : 1;        /**< \brief [16:16] Shut off reset (rw) */
    Ifx_Strict_32Bit reserved_17 : 15;        /**< \brief \internal Reserved */
} Ifx_GTM_CDTM5_DTM5_CTRL_Bits;

/** \\brief  CDTM5 DTM5 phase shift unit configuration and control register */
typedef struct _Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits
{
    Ifx_Strict_32Bit RELBLK : 10;             /**< \brief [9:0] reload value blanking window (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PSU_IN_SEL : 1;          /**< \brief [16:16] PSU input select (rw) */
    Ifx_Strict_32Bit IN_POL : 1;              /**< \brief [17:17] input polarity (rw) */
    Ifx_Strict_32Bit TIM_SEL : 1;             /**< \brief [18:18] TIM input select (rw) */
    Ifx_Strict_32Bit reserved_19 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SHIFT_SEL : 2;           /**< \brief [21:20] shift select (rw) */
    Ifx_Strict_32Bit reserved_22 : 10;        /**< \brief \internal Reserved */
} Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits;

/** \\brief  CDTM6 DTM4 channel 0 dead time reload values */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits
{
    Ifx_Strict_32Bit RELRISE : 10;            /**< \brief [9:0] Reload value for rising edge dead time (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RELFALL : 10;            /**< \brief [25:16] Reload value for falling edge dead time (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits;

/** \\brief  CDTM6 DTM4 channel 1 dead time reload values */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits
{
    Ifx_Strict_32Bit RELRISE : 10;            /**< \brief [9:0] Reload value for rising edge dead time (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RELFALL : 10;            /**< \brief [25:16] Reload value for falling edge dead time (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits;

/** \\brief  CDTM6 DTM4 channel 2 dead time reload values */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits
{
    Ifx_Strict_32Bit RELRISE : 10;            /**< \brief [9:0] Reload value for rising edge dead time (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RELFALL : 10;            /**< \brief [25:16] Reload value for falling edge dead time (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits;

/** \\brief  CDTM6 DTM4 channel 3 dead time reload values */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH3_DTV_Bits
{
    Ifx_Strict_32Bit RELRISE : 10;            /**< \brief [9:0] Reload value for rising edge dead time (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RELFALL : 10;            /**< \brief [25:16] Reload value for falling edge dead time (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH3_DTV_Bits;

/** \\brief  CDTM6 DTM4 channel control register 2 shadow */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits
{
    Ifx_Strict_32Bit POL0_0_SR : 1;           /**< \brief [0:0] Polarity on output 0 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit OC0_0_SR : 1;            /**< \brief [1:1] Output 0 control channel 0 shadow register (rw) */
    Ifx_Strict_32Bit SL0_0_SR : 1;            /**< \brief [2:2] Signal level on output 0 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit DT0_0_SR : 1;            /**< \brief [3:3] Dead time path enable on output 0 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit POL1_0_SR : 1;           /**< \brief [4:4] Polarity on output 1 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit OC1_0_SR : 1;            /**< \brief [5:5] Output 1 control channel 0 shadow register (rw) */
    Ifx_Strict_32Bit SL1_0_SR : 1;            /**< \brief [6:6] Signal level on output 1 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit DT1_0_SR : 1;            /**< \brief [7:7] Dead time path enable on output 1 channel 0 shadow register (rw) */
    Ifx_Strict_32Bit POL0_1_SR : 1;           /**< \brief [8:8] Polarity on output 0 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit OC0_1_SR : 1;            /**< \brief [9:9] Output 0 control channel 1 shadow register (rw) */
    Ifx_Strict_32Bit SL0_1_SR : 1;            /**< \brief [10:10] Signal level on output 0 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit DT0_1_SR : 1;            /**< \brief [11:11] Dead time path enable on output 0 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit POL1_1_SR : 1;           /**< \brief [12:12] Polarity on output 1 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit OC1_1_SR : 1;            /**< \brief [13:13] Output 1 control channel 1 shadow register (rw) */
    Ifx_Strict_32Bit SL1_1_SR : 1;            /**< \brief [14:14] Signal level on output 1 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit DT1_1_SR : 1;            /**< \brief [15:15] Dead time path enable on output 1 channel 1 shadow register (rw) */
    Ifx_Strict_32Bit POL0_2_SR : 1;           /**< \brief [16:16] Polarity on output 0 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit OC0_2_SR : 1;            /**< \brief [17:17] Output 0 control channel 2 shadow register (rw) */
    Ifx_Strict_32Bit SL0_2_SR : 1;            /**< \brief [18:18] Signal level on output 0 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit DT0_2_SR : 1;            /**< \brief [19:19] Dead time path enable on output 0 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit POL1_2_SR : 1;           /**< \brief [20:20] Polarity on output 1 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit OC1_2_SR : 1;            /**< \brief [21:21] Output 1 control channel 2 shadow register (rw) */
    Ifx_Strict_32Bit SL1_2_SR : 1;            /**< \brief [22:22] Signal level on output 1 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit DT1_2_SR : 1;            /**< \brief [23:23] Dead time path enable on output 1 channel 2 shadow register (rw) */
    Ifx_Strict_32Bit POL0_3_SR : 1;           /**< \brief [24:24] Polarity on output 0 channel 3 shadow register (rw) */
    Ifx_Strict_32Bit OC0_3_SR : 1;            /**< \brief [25:25] Output 0 control channel 3 shadow register (rw) */
    Ifx_Strict_32Bit SL0_3_SR : 1;            /**< \brief [26:26] Signal level on output 0 channel 3 shadow register (rw) */
    Ifx_Strict_32Bit DT0_3_SR : 1;            /**< \brief [27:27] Dead time path enable on output 0 channel 3 shadow register (rw) */
    Ifx_Strict_32Bit POL1_3_SR : 1;           /**< \brief [28:28] Polarity on output 1 channel 3 shadow register (rw) */
    Ifx_Strict_32Bit OC1_3_SR : 1;            /**< \brief [29:29] Output 1 control channel 3 shadow register (rw) */
    Ifx_Strict_32Bit SL1_3_SR : 1;            /**< \brief [30:30] Signal level on output 1 channel 3 shadow register (rw) */
    Ifx_Strict_32Bit DT1_3_SR : 1;            /**< \brief [31:31] Dead time path enable on output 1 channel 3 shadow register (rw) */
} Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits;

/** \\brief  CDTM6 DTM4 channel control register 3 */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits
{
    Ifx_Strict_32Bit CII0 : 1;                /**< \brief [0:0] Combinational input invert channel 0 (rw) */
    Ifx_Strict_32Bit CIS0 : 1;                /**< \brief [1:1] Combinational input select channel 0 (rw) */
    Ifx_Strict_32Bit TSEL0_0 : 1;             /**< \brief [2:2] Input selection for dead time / edge trigger generation (rw) */
    Ifx_Strict_32Bit TSEL1_0 : 1;             /**< \brief [3:3] Input selection combinational logic path (rw) */
    Ifx_Strict_32Bit reserved_4 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CII1 : 1;                /**< \brief [8:8] Combinational input invert channel 1 (rw) */
    Ifx_Strict_32Bit CIS1 : 1;                /**< \brief [9:9] Combinational input select channel 1 (rw) */
    Ifx_Strict_32Bit TSEL0_1 : 1;             /**< \brief [10:10] Input selection for dead time / edge trigger generation (rw) */
    Ifx_Strict_32Bit TSEL1_1 : 1;             /**< \brief [11:11] Input selection combinational logic path (rw) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CII2 : 1;                /**< \brief [16:16] Combinational input invert channel 2 (rw) */
    Ifx_Strict_32Bit CIS2 : 1;                /**< \brief [17:17] Combinational input select channel 2 (rw) */
    Ifx_Strict_32Bit TSEL0_2 : 1;             /**< \brief [18:18] Input selection for dead time / edge trigger generation (rw) */
    Ifx_Strict_32Bit TSEL1_2 : 1;             /**< \brief [19:19] Input selection combinational logic path (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CII3 : 1;                /**< \brief [24:24] Combinational input invert channel 3 (rw) */
    Ifx_Strict_32Bit CIS3 : 1;                /**< \brief [25:25] Combinational input select channel 3 (rw) */
    Ifx_Strict_32Bit TSEL0_3 : 1;             /**< \brief [26:26] Input selection for dead time / edge trigger generation (rw) */
    Ifx_Strict_32Bit TSEL1_3 : 1;             /**< \brief [27:27] Input selection combinational logic path (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits;

/** \\brief  CDTM6 DTM4 channel shadow register */
typedef struct _Ifx_GTM_CDTM6_DTM4_CH_SR_Bits
{
    Ifx_Strict_32Bit SL0_0_SR_SR : 1;         /**< \brief [0:0] Shadow register for bit SL0_0_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL1_0_SR_SR : 1;         /**< \brief [1:1] Shadow register for bit SL1_0_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL0_1_SR_SR : 1;         /**< \brief [2:2] Shadow register for bit SL0_1_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL1_1_SR_SR : 1;         /**< \brief [3:3] Shadow register for bit SL1_1_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL0_2_SR_SR : 1;         /**< \brief [4:4] Shadow register for bit SL0_2_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL1_2_SR_SR : 1;         /**< \brief [5:5] Shadow register for bit SL1_2_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL0_3_SR_SR : 1;         /**< \brief [6:6] Shadow register for bit SL0_3_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit SL1_3_SR_SR : 1;         /**< \brief [7:7] Shadow register for bit SL1_3_SR of register DTM[i]_CH_CTRL2_SR (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CH_SR_Bits;

/** \\brief  CDTM6 DTM4 global configuration and control register */
typedef struct _Ifx_GTM_CDTM6_DTM4_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_SEL : 2;             /**< \brief [1:0] Clock source select (rw) */
    Ifx_Strict_32Bit DTM_SEL : 2;             /**< \brief [3:2] Select DTM update and SHUT_OFF reset signal (rw) */
    Ifx_Strict_32Bit UPD_MODE : 3;            /**< \brief [6:4] Update mode (rw) */
    Ifx_Strict_32Bit reserved_7 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SR_UPD_EN : 1;           /**< \brief [8:8] shadow register update enable (rw) */
    Ifx_Strict_32Bit reserved_9 : 7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SHUT_OFF_RST : 1;        /**< \brief [16:16] Shut off reset (rw) */
    Ifx_Strict_32Bit reserved_17 : 15;        /**< \brief \internal Reserved */
} Ifx_GTM_CDTM6_DTM4_CTRL_Bits;

