Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Control Bits Register 7 for up to 32 Actions */
typedef struct _Ifx_GTM_DPLL_ACB_7_Bits
{
    Ifx_Strict_32Bit ACB_0 : 5;               /**< \brief [4:0] Action Control Bits of ACTION_z (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACB_1 : 5;               /**< \brief [12:8] Action Control Bits of ACTION_(i + 1) (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACB_2 : 5;               /**< \brief [20:16] Action Control Bits of ACTION_(i + 2) (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACB_3 : 5;               /**< \brief [28:24] Action Control Bits of ACTION_(i + 3) (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ACB_7_Bits;

/** \\brief  DPLL ACTION Status Register with connected shadow register */
typedef struct _Ifx_GTM_DPLL_ACT_STA_Bits
{
    Ifx_Strict_32Bit ACT_N : 32;              /**< \brief [31:0] New output data values concerning to action i provided (rw) */
} Ifx_GTM_DPLL_ACT_STA_Bits;

/** \\brief  DPLL Calculated ADD_IN Value for SUB_INC1 Generation */
typedef struct _Ifx_GTM_DPLL_ADD_IN_CAL1_Bits
{
    Ifx_Strict_32Bit ADD_IN_CAL1 : 24;        /**< \brief [23:0] Calculated input value for SUB_INC1 generation, calculated by the DPLL (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_CAL1_Bits;

/** \\brief  DPLL Calculated ADD_IN Value for SUB_INC2 Generation */
typedef struct _Ifx_GTM_DPLL_ADD_IN_CAL2_Bits
{
    Ifx_Strict_32Bit ADD_IN_CAL2 : 24;        /**< \brief [23:0] Input value for SUB_INC2 generation, calculated by the DPLL for SMC=RMO=1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_CAL2_Bits;

/** \\brief  DPLL Direct Load Input Value for SUB_INC1 */
typedef struct _Ifx_GTM_DPLL_ADD_IN_LD1_Bits
{
    Ifx_Strict_32Bit ADD_IN_LD1 : 24;         /**< \brief [23:0] Input value for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_LD1_Bits;

/** \\brief  DPLL Direct Load Input Value for SUB_INC2 */
typedef struct _Ifx_GTM_DPLL_ADD_IN_LD2_Bits
{
    Ifx_Strict_32Bit ADD_IN_LD2 : 24;         /**< \brief [23:0] Input value for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_LD2_Bits;

/** \\brief  DPLL Adapt and Profile Values of the STATE Increments in FULL_SCALE */
typedef struct _Ifx_GTM_DPLL_ADT_S_Bits
{
    Ifx_Strict_32Bit PD_S : 16;               /**< \brief [15:0] Physical deviation of STATE (rw) */
    Ifx_Strict_32Bit NS : 6;                  /**< \brief [21:16] Number of STATEs (rw) */
    Ifx_Strict_32Bit NOT_USED : 2;            /**< \brief [23:22] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADT_S_Bits;

/** \\brief  DPLL Address Offset Register of RAM 2 Regions */
typedef struct _Ifx_GTM_DPLL_AOSV_2_Bits
{
    Ifx_Strict_32Bit AOSV_2A : 8;             /**< \brief [7:0] Address offset value of the RAM 2A region (r) */
    Ifx_Strict_32Bit AOSV_2B : 8;             /**< \brief [15:8] Address offset value of the RAM 2B region (r) */
    Ifx_Strict_32Bit AOSV_2C : 8;             /**< \brief [23:16] Address offset value of the RAM 2C region (r) */
    Ifx_Strict_32Bit AOSV_2D : 8;             /**< \brief [31:24] Address offset value of the RAM 2D region (r) */
} Ifx_GTM_DPLL_AOSV_2_Bits;

/** \\brief  DPLL Actual RAM Pointer for RAM Region 1C3 */
typedef struct _Ifx_GTM_DPLL_APS_1C3_Bits
{
    Ifx_Strict_32Bit reserved_0 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1C3 : 6;             /**< \brief [7:2] Address pointer STATE for RAM region 1c3 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_1C3_Bits;

/** \\brief  DPLL Extension register for DPLL_APS_1C3) */
typedef struct _Ifx_GTM_DPLL_APS_1C3_EXT_Bits
{
    Ifx_Strict_32Bit reserved_0 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1C3 : 7;             /**< \brief [8:2] Actual RAM pointer address value for ADT_S[i] (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_1C3_EXT_Bits;

/** \\brief  DPLL Actual RAM Pointer Address for STATE */
typedef struct _Ifx_GTM_DPLL_APS_Bits
{
    Ifx_Strict_32Bit reserved_0 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS : 1;                /**< \brief [1:1] Write bit for address pointer APS (rw) */
    Ifx_Strict_32Bit APS : 6;                 /**< \brief [7:2] Address pointer STATE (rw) */
    Ifx_Strict_32Bit reserved_8 : 5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS_1C2 : 1;            /**< \brief [13:13] Write bit for address pointer APS_1C2 (rw) */
    Ifx_Strict_32Bit APS_1C2 : 6;             /**< \brief [19:14] Address pointer STATE for RAM region 1c2 (rw) */
    Ifx_Strict_32Bit reserved_20 : 12;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_Bits;

/** \\brief  DPLL Extension register for DPLL_APS 4) */
typedef struct _Ifx_GTM_DPLL_APS_EXT_Bits
{
    Ifx_Strict_32Bit reserved_0 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS : 1;                /**< \brief [1:1] Write bit for address pointer APS (rw) */
    Ifx_Strict_32Bit APS : 7;                 /**< \brief [8:2] Actual RAM pointer address value for DT_S[i] and RDT_S[i] (rw) */
    Ifx_Strict_32Bit reserved_9 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS_1C2 : 1;            /**< \brief [13:13] Write bit for address pointer APS_1C2 (rw) */
    Ifx_Strict_32Bit APS_1C2 : 7;             /**< \brief [20:14] Actual RAM pointer address value for TSF_S[i] (rw) */
    Ifx_Strict_32Bit reserved_21 : 11;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_EXT_Bits;

/** \\brief  DPLL Old RAM Pointer and Offset Value for STATE */
typedef struct _Ifx_GTM_DPLL_APS_SYNC_Bits
{
    Ifx_Strict_32Bit APS_1C2_EXT : 6;         /**< \brief [5:0] Address pointer 1c2 extension (rw) */
    Ifx_Strict_32Bit APS_1C2_STATUS : 1;      /**< \brief [6:6] Address pointer 1c2 status (rw) */
    Ifx_Strict_32Bit reserved_7 : 7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1C2_OLD : 6;         /**< \brief [19:14] Address pointer STATE for RAM region 1c2 at synchronization time (rw) */
    Ifx_Strict_32Bit reserved_20 : 12;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_SYNC_Bits;

/** \\brief  DPLL Extension register for DPLL_APS_SYNC) */
typedef struct _Ifx_GTM_DPLL_APS_SYNC_EXT_Bits
{
    Ifx_Strict_32Bit APS_1C2_EXT : 7;         /**< \brief [6:0] Address pointer 1c2 extension; (rw) */
    Ifx_Strict_32Bit reserved_7 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1C2_STATUS : 1;      /**< \brief [15:15] Address pointer 1c2 status; (rw) */
    Ifx_Strict_32Bit APS_1C2_OLD : 7;         /**< \brief [22:16] Address pointer STATE for RAM region 1c2 at synchronization time; (rw) */
    Ifx_Strict_32Bit reserved_23 : 9;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_SYNC_EXT_Bits;

