Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Control 0 Shadow STATE Register */
typedef struct _Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits
{
    Ifx_Strict_32Bit reserved_0 : 10;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IFP : 1;                 /**< \brief [10:10] Input filter position (r) */
    Ifx_Strict_32Bit reserved_11 : 14;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AMS : 1;                 /**< \brief [25:25] Adapt mode STATE (r) */
    Ifx_Strict_32Bit reserved_26 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IDS : 1;                 /**< \brief [27:27] Input delay STATE (r) */
    Ifx_Strict_32Bit reserved_28 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RMO : 1;                 /**< \brief [31:31] Reference mode (r) */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits;

/** \\brief  DPLL Control 0 Shadow Trigger Register */
typedef struct _Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits
{
    Ifx_Strict_32Bit MLT : 10;                /**< \brief [9:0] Multiplier for TRIGGER (r) */
    Ifx_Strict_32Bit IFP : 1;                 /**< \brief [10:10] Input filter position (r) */
    Ifx_Strict_32Bit reserved_11 : 15;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AMT : 1;                 /**< \brief [26:26] Adapt mode TRIGGER (r) */
    Ifx_Strict_32Bit reserved_27 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IDT : 1;                 /**< \brief [28:28] Input delay TRIGGER (r) */
    Ifx_Strict_32Bit reserved_29 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RMO : 1;                 /**< \brief [31:31] Reference mode (r) */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits;

/** \\brief  DPLL Control Register 11 */
typedef struct _Ifx_GTM_DPLL_CTRL_11_Bits
{
    Ifx_Strict_32Bit SIP1 : 1;                /**< \brief [0:0] Simplified increment prediction in normal mode and for the first engine in the case SMC=1. (rw) */
    Ifx_Strict_32Bit ERZ1 : 1;                /**< \brief [1:1] Error is assumed as zero in normal mode and for the first engine for SMC=1. (rw) */
    Ifx_Strict_32Bit PCMF1 : 1;               /**< \brief [2:2] Pulse correction mode fast for INC_CNT1 (rw) */
    Ifx_Strict_32Bit FSYL1 : 1;               /**< \brief [3:3] Force Synchronization Loss of LOCK1. (rw) */
    Ifx_Strict_32Bit INCF1 : 1;               /**< \brief [4:4] INC_CNT1 fast correction (rw) */
    Ifx_Strict_32Bit PCMF1_INCCNT_B : 1;      /**< \brief [5:5] No increment of INC_CNT1 when PCMF1 active (automatic end mode). (rw) */
    Ifx_Strict_32Bit ADT : 1;                 /**< \brief [6:6] Correction of DT_T_ACTUAL,CDT_TX_nom_corr by PD_T (r) */
    Ifx_Strict_32Bit ADS : 1;                 /**< \brief [7:7] Correction of DT_S_ACTUAL, CDT_SX_nom_corr by PD_S (r) */
    Ifx_Strict_32Bit SIP2 : 1;                /**< \brief [8:8] Simplified increment prediction in emergency mode and for the second engine in the case RMO=1. (rw) */
    Ifx_Strict_32Bit ERZ2 : 1;                /**< \brief [9:9] Error is assumed as zero in emergency mode and for the second engine for SMC=1. (rw) */
    Ifx_Strict_32Bit PCMF2 : 1;               /**< \brief [10:10] Pulse correction mode fast for INC_CNT2 (rw) */
    Ifx_Strict_32Bit FSYL2 : 1;               /**< \brief [11:11] Force Synchronization Loss of LOCK2. (rw) */
    Ifx_Strict_32Bit INCF2 : 1;               /**< \brief [12:12] INC_CNT2 fast (rw) */
    Ifx_Strict_32Bit PCMF2_INCCNT_B : 1;      /**< \brief [13:13] No increment of INC_CNT2 when PCMF2 active (automatic end mode). (rw) */
    Ifx_Strict_32Bit STATE_EXT : 1;           /**< \brief [14:14] Use of STATE engine extension (rw) */
    Ifx_Strict_32Bit ACBU : 1;                /**< \brief [15:15] ACB use; the ACB values of PMTR are used to decide if an action is in the past (rw) */
    Ifx_Strict_32Bit WSIP1 : 1;               /**< \brief [16:16] Write enable for simplified increment prediction 1. (rw) */
    Ifx_Strict_32Bit WERZ1 : 1;               /**< \brief [17:17] Write enable for error zero 1. (rw) */
    Ifx_Strict_32Bit WPCMF1 : 1;              /**< \brief [18:18] Write enable for pulse correction mode fast 1 (rw) */
    Ifx_Strict_32Bit WFSYL1 : 1;              /**< \brief [19:19] Write enable for Force Synchronization Loss 1. (rw) */
    Ifx_Strict_32Bit WINCF1 : 1;              /**< \brief [20:20] Write enable for INC_CNT1 fast (rw) */
    Ifx_Strict_32Bit WPCMF1_INCCNT_B : 1;     /**< \brief [21:21] Write enable of PCMF1_INCCNT_B (rw) */
    Ifx_Strict_32Bit WADT : 1;                /**< \brief [22:22] Write enable of ADT (r) */
    Ifx_Strict_32Bit WADS : 1;                /**< \brief [23:23] Write enable of ADS. (r) */
    Ifx_Strict_32Bit WSIP2 : 1;               /**< \brief [24:24] Write enable for simplified increment prediction 2. (rw) */
    Ifx_Strict_32Bit WERZ2 : 1;               /**< \brief [25:25] Write enable for error zero 2. (rw) */
    Ifx_Strict_32Bit WPCMF2 : 1;              /**< \brief [26:26] Write enable for pulse correction mode fast 2 (rw) */
    Ifx_Strict_32Bit WFSYL2 : 1;              /**< \brief [27:27] Write enable for Force Synchronization Loss 2. (rw) */
    Ifx_Strict_32Bit WINCF2 : 1;              /**< \brief [28:28] Write enable for INC_CNT2 fast (rw) */
    Ifx_Strict_32Bit WPCMF2_INCCNT_B : 1;     /**< \brief [29:29] Write enable of PCMF2_INCCNT_B (rw) */
    Ifx_Strict_32Bit WSTATE_EXT : 1;          /**< \brief [30:30] Write enable of STATE_EXT (rw) */
    Ifx_Strict_32Bit WACBU : 1;               /**< \brief [31:31] Write enable for ACB use (rw) */
} Ifx_GTM_DPLL_CTRL_11_Bits;

/** \\brief  DPLL Control Register 1 */
typedef struct _Ifx_GTM_DPLL_CTRL_1_Bits
{
    Ifx_Strict_32Bit DMO : 1;                 /**< \brief [0:0] DPLL mode select (rw) */
    Ifx_Strict_32Bit DEN : 1;                 /**< \brief [1:1] DPLL enable (rw) */
    Ifx_Strict_32Bit IDDS : 1;                /**< \brief [2:2] Input direction detection strategy in the case of SMC=0 (rw) */
    Ifx_Strict_32Bit COA : 1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0) (rw) */
    Ifx_Strict_32Bit PIT : 1;                 /**< \brief [4:4] Plausibility value PVT to next active TRIGGER is time related (rw) */
    Ifx_Strict_32Bit SGE1 : 1;                /**< \brief [5:5] SUB_INC1 generator enable (rw) */
    Ifx_Strict_32Bit DLM1 : 1;                /**< \brief [6:6] Direct Load Mode for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit PCM1 : 1;                /**< \brief [7:7] Pulse Correction Mode for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit SGE2 : 1;                /**< \brief [8:8] SUB_INC2 generator enable (rw) */
    Ifx_Strict_32Bit DLM2 : 1;                /**< \brief [9:9] Direct Load Mode for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit PCM2 : 1;                /**< \brief [10:10] Pulse Correction Mode for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit SYN_NS : 5;              /**< \brief [15:11] Synchronization number of STATE (rw) */
    Ifx_Strict_32Bit SYN_NT : 6;              /**< \brief [21:16] Synchronization number of TRIGGER (rw) */
    Ifx_Strict_32Bit LCD : 1;                 /**< \brief [22:22] Locking condition definition (rw) */
    Ifx_Strict_32Bit SWR : 1;                 /**< \brief [23:23] Software reset (rw) */
    Ifx_Strict_32Bit SYSF : 1;                /**< \brief [24:24] SYN_NS for FULL_SCALE (rw) */
    Ifx_Strict_32Bit TS0_HRS : 1;             /**< \brief [25:25] Time stamp high resolution STATE (rw) */
    Ifx_Strict_32Bit TS0_HRT : 1;             /**< \brief [26:26] Time stamp high resolution TRIGGER (rw) */
    Ifx_Strict_32Bit SMC : 1;                 /**< \brief [27:27] Synchronous Motor Control (rw) */
    Ifx_Strict_32Bit SSL : 2;                 /**< \brief [29:28] STATE slope select (rw) */
    Ifx_Strict_32Bit TSL : 2;                 /**< \brief [31:30] TRIGGER slope select (rw) */
} Ifx_GTM_DPLL_CTRL_1_Bits;

/** \\brief  DPLL Control 1 Shadow STATE Register */
typedef struct _Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits
{
    Ifx_Strict_32Bit DMO : 1;                 /**< \brief [0:0] DPLL mode select (r) */
    Ifx_Strict_32Bit reserved_1 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COA : 1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0) (r) */
    Ifx_Strict_32Bit reserved_4 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SGE1 : 1;                /**< \brief [5:5] SUB_INC1 generator enable (r) */
    Ifx_Strict_32Bit DLM1 : 1;                /**< \brief [6:6] Direct Load Mode for SUB_INC1 generation (r) */
    Ifx_Strict_32Bit PCM1 : 1;                /**< \brief [7:7] Pulse Correction Mode for SUB_INC1 generation (r) */
    Ifx_Strict_32Bit SGE2 : 1;                /**< \brief [8:8] SUB_INC2 generator enable (r) */
    Ifx_Strict_32Bit DLM2 : 1;                /**< \brief [9:9] Direct Load Mode for SUB_INC2 generation (r) */
    Ifx_Strict_32Bit PCM2 : 1;                /**< \brief [10:10] Pulse Correction Mode for SUB_INC2 generation (r) */
    Ifx_Strict_32Bit reserved_11 : 21;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits;

/** \\brief  DPLL Control 1 Shadow TRIGGER Register */
typedef struct _Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits
{
    Ifx_Strict_32Bit DMO : 1;                 /**< \brief [0:0] DPLL mode select (r) */
    Ifx_Strict_32Bit reserved_1 : 2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COA : 1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0). (r) */
    Ifx_Strict_32Bit PIT : 1;                 /**< \brief [4:4] Plausibility value PVT to next valid TRIGGER is time related (r) */
    Ifx_Strict_32Bit SGE1 : 1;                /**< \brief [5:5] SUB_INC1 generator enable. (r) */
    Ifx_Strict_32Bit DLM1 : 1;                /**< \brief [6:6] Direct Load Mode for SUB_INC1 generation (r) */
    Ifx_Strict_32Bit PCM1 : 1;                /**< \brief [7:7] Pulse Correction Mode for SUB_INC1 generation. (r) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits;

/** \\brief  DPLL Control Register 2 */
typedef struct _Ifx_GTM_DPLL_CTRL_2_Bits
{
    Ifx_Strict_32Bit reserved_0 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AEN0 : 1;                /**< \brief [8:8] ACTION_0 enable (rw) */
    Ifx_Strict_32Bit AEN1 : 1;                /**< \brief [9:9] ACTION_1 enable (rw) */
    Ifx_Strict_32Bit AEN2 : 1;                /**< \brief [10:10] ACTION_2 enable (rw) */
    Ifx_Strict_32Bit AEN3 : 1;                /**< \brief [11:11] ACTION_3 enable (rw) */
    Ifx_Strict_32Bit AEN4 : 1;                /**< \brief [12:12] ACTION_4 enable (rw) */
    Ifx_Strict_32Bit AEN5 : 1;                /**< \brief [13:13] ACTION_5 enable (rw) */
    Ifx_Strict_32Bit AEN6 : 1;                /**< \brief [14:14] ACTION_6 enable (rw) */
    Ifx_Strict_32Bit AEN7 : 1;                /**< \brief [15:15] ACTION_7 enable (rw) */
    Ifx_Strict_32Bit WAD0 : 1;                /**< \brief [16:16] Write control bit of Action_0 (rw) */
    Ifx_Strict_32Bit WAD1 : 1;                /**< \brief [17:17] Write control bit of Action_1 (rw) */
    Ifx_Strict_32Bit WAD2 : 1;                /**< \brief [18:18] Write control bit of Action_2 (rw) */
    Ifx_Strict_32Bit WAD3 : 1;                /**< \brief [19:19] Write control bit of Action_3 (rw) */
    Ifx_Strict_32Bit WAD4 : 1;                /**< \brief [20:20] Write control bit of Action_4 (rw) */
    Ifx_Strict_32Bit WAD5 : 1;                /**< \brief [21:21] Write control bit of Action_5 (rw) */
    Ifx_Strict_32Bit WAD6 : 1;                /**< \brief [22:22] Write control bit of Action_6 (rw) */
    Ifx_Strict_32Bit WAD7 : 1;                /**< \brief [23:23] Write control bit of Action_7 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_2_Bits;

