Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Duration of the Last STATE Increment */
typedef struct _Ifx_GTM_DPLL_DT_S_ACT_Bits
{
    Ifx_Strict_32Bit DT_S_ACT : 24;           /**< \brief [23:0] Calculated duration of the last STATE increment. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DT_S_ACT_Bits;

/** \\brief  DPLL Nominal STATE Increment Duration in FULL_SCALE */
typedef struct _Ifx_GTM_DPLL_DT_S_Bits
{
    Ifx_Strict_32Bit DT_S : 24;               /**< \brief [23:0] Difference time of STATE (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DT_S_Bits;

/** \\brief  DPLL Start Value of DPLL_DT_S_ACT for the first Increment after
 * SIP2 is set to 1 */
typedef struct _Ifx_GTM_DPLL_DT_S_START_Bits
{
    Ifx_Strict_32Bit DPLL_DT_S_START : 24;    /**< \brief [23:0] Start value of DPLL_DT_S_ACT for the first increment after SIP2 is set to 1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DT_S_START_Bits;

/** \\brief  DPLL Duration of the Last TRIGGER Increment */
typedef struct _Ifx_GTM_DPLL_DT_T_ACT_Bits
{
    Ifx_Strict_32Bit DT_T_ACT : 24;           /**< \brief [23:0] Calculated duration of the last TRIGGER increment. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DT_T_ACT_Bits;

/** \\brief  DPLL Start Value of DPLL_DT_T_ACT for the first Increment after
 * SIP1 is set to 1 */
typedef struct _Ifx_GTM_DPLL_DT_T_START_Bits
{
    Ifx_Strict_32Bit DPLL_DT_T_START : 24;    /**< \brief [23:0] Start value of DPLL_DT_T_ACT for the first increment after SIP1 is set to 1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DT_T_START_Bits;

/** \\brief  DPLL Calculated Relative TIME To ACTION */
typedef struct _Ifx_GTM_DPLL_DTA_Bits
{
    Ifx_Strict_32Bit DTA : 24;                /**< \brief [23:0] Calculated relative time to ACTION_z (z=0-31) (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_DTA_Bits;

/** \\brief  DPLL Difference of Prediction to Actual Value of the Last STATE
 * Increment */
typedef struct _Ifx_GTM_DPLL_EDT_S_Bits
{
    Ifx_Strict_32Bit EDT_S : 24;              /**< \brief [23:0] Signed difference between actual value and prediction of the last STATE increment: sint24 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_EDT_S_Bits;

/** \\brief  DPLL Difference of Prediction to Actual Value of the Last TRIGGER
 * Increment */
typedef struct _Ifx_GTM_DPLL_EDT_T_Bits
{
    Ifx_Strict_32Bit EDT_T : 24;              /**< \brief [23:0] Signed difference between actual value and a simple prediction of the last TRIGGER increment: sint24 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_EDT_T_Bits;

/** \\brief  DPLL Error Interrupt Enable Register */
typedef struct _Ifx_GTM_DPLL_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit PDI_EIRQ_EN : 1;         /**< \brief [0:0] DPLL disable interrupt enable, when switch off of the DEN bit. (rw) */
    Ifx_Strict_32Bit PEI_EIRQ_EN : 1;         /**< \brief [1:1] DPLL enable interrupt enable, when switch on of the DEN bit. (rw) */
    Ifx_Strict_32Bit TINI_EIRQ_EN : 1;        /**< \brief [2:2] TRIGGER minimum hold time violation interrupt enable bit. (rw) */
    Ifx_Strict_32Bit TAXI_EIRQ_EN : 1;        /**< \brief [3:3] TRIGGER maximum hold time violation interrupt enable bit. (rw) */
    Ifx_Strict_32Bit SISI_EIRQ_EN : 1;        /**< \brief [4:4] STATE inactive slope interrupt enable bit. (rw) */
    Ifx_Strict_32Bit TISI_EIRQ_EN : 1;        /**< \brief [5:5] TRIGGER inactive slope interrupt enable bit. (rw) */
    Ifx_Strict_32Bit MSI_EIRQ_EN : 1;         /**< \brief [6:6] Missing STATE interrupt enable. (rw) */
    Ifx_Strict_32Bit MTI_EIRQ_EN : 1;         /**< \brief [7:7] Missing TRIGGER interrupt enable. (rw) */
    Ifx_Strict_32Bit SASI_EIRQ_EN : 1;        /**< \brief [8:8] STATE active slope interrupt enable. (rw) */
    Ifx_Strict_32Bit TASI_EIRQ_EN : 1;        /**< \brief [9:9] TRIGGER active slope interrupt enable. (rw) */
    Ifx_Strict_32Bit PWI_EIRQ_EN : 1;         /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER enable. (rw) */
    Ifx_Strict_32Bit W2I_EIRQ_EN : 1;         /**< \brief [11:11] RAM write access to RAM region 2 interrupt enable. (rw) */
    Ifx_Strict_32Bit W1I_EIRQ_EN : 1;         /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt. (rw) */
    Ifx_Strict_32Bit GL1I_EIRQ_EN : 1;        /**< \brief [13:13] Get of lock interrupt enable, when lock arises. (rw) */
    Ifx_Strict_32Bit LL1I_EIRQ_EN : 1;        /**< \brief [14:14] Loss of lock interrupt enable. (rw) */
    Ifx_Strict_32Bit EI_EIRQ_EN : 1;          /**< \brief [15:15] Error interrupt enable (see status register). (rw) */
    Ifx_Strict_32Bit GL2I_EIRQ_EN : 1;        /**< \brief [16:16] Get of lock interrupt enable for SUB_INC2. (rw) */
    Ifx_Strict_32Bit LL2I_EIRQ_EN : 1;        /**< \brief [17:17] Loss of lock interrupt enable for SUB_INC2. (rw) */
    Ifx_Strict_32Bit TE0I_EIRQ_EN : 1;        /**< \brief [18:18] TRIGGER event interrupt 0 enable. (rw) */
    Ifx_Strict_32Bit TE1I_EIRQ_EN : 1;        /**< \brief [19:19] TRIGGER event interrupt 1 enable. (rw) */
    Ifx_Strict_32Bit TE2I_EIRQ_EN : 1;        /**< \brief [20:20] TRIGGER event interrupt 2 enable. (rw) */
    Ifx_Strict_32Bit TE3I_EIRQ_EN : 1;        /**< \brief [21:21] TRIGGER event interrupt 3 enable. (rw) */
    Ifx_Strict_32Bit TE4I_EIRQ_EN : 1;        /**< \brief [22:22] TRIGGER event interrupt 4 enable. (rw) */
    Ifx_Strict_32Bit CDTI_EIRQ_EN : 1;        /**< \brief [23:23] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit CDSI_EIRQ_EN : 1;        /**< \brief [24:24] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit TORI_EIRQ_EN : 1;        /**< \brief [25:25] TRIGGER out of range interrupt (rw) */
    Ifx_Strict_32Bit SORI_EIRQ_EN : 1;        /**< \brief [26:26] STATE out of range (rw) */
    Ifx_Strict_32Bit DCGI_EIRQ_EN : 1;        /**< \brief [27:27] Direction change interrupt (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_EIRQ_EN_Bits;

/** \\brief  DPLL Actual STATE Filter Value */
typedef struct _Ifx_GTM_DPLL_FTV_S_Bits
{
    Ifx_Strict_32Bit STATE_FT : 24;           /**< \brief [23:0] Filter value of the last active STATE input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_FTV_S_Bits;

