Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Actual TRIGGER Filter Value */
typedef struct _Ifx_GTM_DPLL_FTV_T_Bits
{
    Ifx_Strict_32Bit TRIGGER_FT : 24;         /**< \brief [23:0] Filter value of the last active TRIGGER input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_FTV_T_Bits;

/** \\brief  DPLL ID Information For Input Signal PMT 0 Register */
typedef struct _Ifx_GTM_DPLL_ID_PMTR_Bits
{
    Ifx_Strict_32Bit ID_PMTR_X : 9;           /**< \brief [8:0] ID information to the input signal PMTR[i] from the ARU (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ID_PMTR_Bits;

/** \\brief  DPLL Counter for Pulses for TBU_CH1_BASE to be sent in Automatic
 * End Mode */
typedef struct _Ifx_GTM_DPLL_INC_CNT1_Bits
{
    Ifx_Strict_32Bit INC_CNT1 : 24;           /**< \brief [23:0] Actual number of pulses to be still sent out at the current increment until the next active input signal in automatic end mode; (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT1_Bits;

/** \\brief  DPLL INC_CNT1 Trigger Mask */
typedef struct _Ifx_GTM_DPLL_INC_CNT1_MASK_Bits
{
    Ifx_Strict_32Bit INC_CNT1_NOTIFY : 24;    /**< \brief [23:0] Notify value for INC_CNT1 of register DPLL_INC_CNT1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT1_MASK_Bits;

/** \\brief  DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End
 * Mode */
typedef struct _Ifx_GTM_DPLL_INC_CNT2_Bits
{
    Ifx_Strict_32Bit INC_CNT2 : 24;           /**< \brief [23:0] Actual number of pulses to be still sent out at the current increment until the next active input signal in automatic end mode; (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT2_Bits;

/** \\brief  DPLL INC_CNT2 Trigger Mask */
typedef struct _Ifx_GTM_DPLL_INC_CNT2_MASK_Bits
{
    Ifx_Strict_32Bit INC_CNT2_NOTIFY : 24;    /**< \brief [23:0] Notify value for INC_CNT2 of register DPLL_INC_CNT2 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT2_MASK_Bits;

/** \\brief  DPLL Start Value of the ADD_IN_ADDER1 Register */
typedef struct _Ifx_GTM_DPLL_INCF1_OFFSET_Bits
{
    Ifx_Strict_32Bit DPLL_INCF1_OFFSET : 24;  /**< \brief [23:0] Start value of the ADD_IN_ADDER1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INCF1_OFFSET_Bits;

/** \\brief  DPLL Start Value of the ADD_IN_ADDER2 Register */
typedef struct _Ifx_GTM_DPLL_INCF2_OFFSET_Bits
{
    Ifx_Strict_32Bit DPLL_INCF2_OFFSET : 24;  /**< \brief [23:0] Start value of the ADD_IN_ADDER2 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INCF2_OFFSET_Bits;

/** \\brief  DPLL Interrupt Enable Register */
typedef struct _Ifx_GTM_DPLL_IRQ_EN_Bits
{
    Ifx_Strict_32Bit PDI_IRQ_EN : 1;          /**< \brief [0:0] DPLL disable interrupt enable, when switch off of the DEN bit. (rw) */
    Ifx_Strict_32Bit PEI_IRQ_EN : 1;          /**< \brief [1:1] DPLL enable interrupt enable, when switch on of the DEN bit. (rw) */
    Ifx_Strict_32Bit TINI_IRQ_EN : 1;         /**< \brief [2:2] TRIGGER minimum hold time violation interrupt enable bit. (rw) */
    Ifx_Strict_32Bit TAXI_IRQ_EN : 1;         /**< \brief [3:3] TRIGGER maximum hold time violation interrupt enable bit. (rw) */
    Ifx_Strict_32Bit SISI_IRQ_EN : 1;         /**< \brief [4:4] STATE inactive slope interrupt enable bit. (rw) */
    Ifx_Strict_32Bit TISI_IRQ_EN : 1;         /**< \brief [5:5] TRIGGER inactive slope interrupt enable bit. (rw) */
    Ifx_Strict_32Bit MSI_IRQ_EN : 1;          /**< \brief [6:6] Missing STATE interrupt enable. (rw) */
    Ifx_Strict_32Bit MTI_IRQ_EN : 1;          /**< \brief [7:7] Missing TRIGGER interrupt enable. (rw) */
    Ifx_Strict_32Bit SASI_IRQ_EN : 1;         /**< \brief [8:8] STATE active slope interrupt enable. (rw) */
    Ifx_Strict_32Bit TASI_IRQ_EN : 1;         /**< \brief [9:9] TRIGGER active slope interrupt enable. (rw) */
    Ifx_Strict_32Bit PWI_IRQ_EN : 1;          /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER enable. (rw) */
    Ifx_Strict_32Bit W2I_IRQ_EN : 1;          /**< \brief [11:11] RAM write access to RAM region 2 interrupt enable. (rw) */
    Ifx_Strict_32Bit W1I_IRQ_EN : 1;          /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt. (rw) */
    Ifx_Strict_32Bit GL1I_IRQ_EN : 1;         /**< \brief [13:13] Get of lock interrupt enable, when lock arises. (rw) */
    Ifx_Strict_32Bit LL1I_IRQ_EN : 1;         /**< \brief [14:14] Loss of lock interrupt enable. (rw) */
    Ifx_Strict_32Bit EI_IRQ_EN : 1;           /**< \brief [15:15] Error interrupt enable (see status register). (rw) */
    Ifx_Strict_32Bit GL2I_IRQ_EN : 1;         /**< \brief [16:16] Get of lock interrupt enable for SUB_INC2. (rw) */
    Ifx_Strict_32Bit LL2I_IRQ_EN : 1;         /**< \brief [17:17] Loss of lock interrupt enable for SUB_INC2. (rw) */
    Ifx_Strict_32Bit TE0I_IRQ_EN : 1;         /**< \brief [18:18] TRIGGER event interrupt 0 enable. (rw) */
    Ifx_Strict_32Bit TE1I_IRQ_EN : 1;         /**< \brief [19:19] TRIGGER event interrupt 1 enable. (rw) */
    Ifx_Strict_32Bit TE2I_IRQ_EN : 1;         /**< \brief [20:20] TRIGGER event interrupt 2 enable. (rw) */
    Ifx_Strict_32Bit TE3I_IRQ_EN : 1;         /**< \brief [21:21] TRIGGER event interrupt 3 enable. (rw) */
    Ifx_Strict_32Bit TE4I_IRQ_EN : 1;         /**< \brief [22:22] TRIGGER event interrupt 4 enable. (rw) */
    Ifx_Strict_32Bit CDTI_IRQ_EN : 1;         /**< \brief [23:23] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit CDSI_IRQ_EN : 1;         /**< \brief [24:24] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit TORI_IRQ_EN : 1;         /**< \brief [25:25] TRIGGER out of range interrupt (rw) */
    Ifx_Strict_32Bit SORI_IRQ_EN : 1;         /**< \brief [26:26] STATE out of range (rw) */
    Ifx_Strict_32Bit DCGI_IRQ_EN : 1;         /**< \brief [27:27] Direction change interrupt (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_EN_Bits;

/** \\brief  DPLL Interrupt Force Register */
typedef struct _Ifx_GTM_DPLL_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_PDI : 1;             /**< \brief [0:0] Force Interrupt PDI (rw) */
    Ifx_Strict_32Bit TRG_PEI : 1;             /**< \brief [1:1] Force Interrupt PEI (rw) */
    Ifx_Strict_32Bit TRG_TINI : 1;            /**< \brief [2:2] Force Interrupt TINI (rw) */
    Ifx_Strict_32Bit TRG_TAXI : 1;            /**< \brief [3:3] Force Interrupt TAXI (rw) */
    Ifx_Strict_32Bit TRG_SISI : 1;            /**< \brief [4:4] Force Interrupt SISI (rw) */
    Ifx_Strict_32Bit TRG_TISI : 1;            /**< \brief [5:5] Force Interrupt TISI (rw) */
    Ifx_Strict_32Bit TRG_MSI : 1;             /**< \brief [6:6] Force Interrupt MSI (rw) */
    Ifx_Strict_32Bit TRG_MTI : 1;             /**< \brief [7:7] Force Interrupt MTI (rw) */
    Ifx_Strict_32Bit TRG_SASI : 1;            /**< \brief [8:8] Force Interrupt SASI (rw) */
    Ifx_Strict_32Bit TRG_TASI : 1;            /**< \brief [9:9] Force Interrupt TASI (rw) */
    Ifx_Strict_32Bit TRG_PWI : 1;             /**< \brief [10:10] Force Interrupt PWI (rw) */
    Ifx_Strict_32Bit TRG_W2I : 1;             /**< \brief [11:11] Force Interrupt W2IF (rw) */
    Ifx_Strict_32Bit TRG_W1I : 1;             /**< \brief [12:12] Force Interrupt W1I (rw) */
    Ifx_Strict_32Bit TRG_GL1I : 1;            /**< \brief [13:13] Force Interrupt GL1I (rw) */
    Ifx_Strict_32Bit TRG_LL1I : 1;            /**< \brief [14:14] Force Interrupt LL1I (rw) */
    Ifx_Strict_32Bit TRG_EI : 1;              /**< \brief [15:15] Force Interrupt EI (rw) */
    Ifx_Strict_32Bit TRG_GL2I : 1;            /**< \brief [16:16] Force Interrupt GL2I (rw) */
    Ifx_Strict_32Bit TRG_LL2I : 1;            /**< \brief [17:17] Force Interrupt LL2I (rw) */
    Ifx_Strict_32Bit TRG_TE0I : 1;            /**< \brief [18:18] Force Interrupt TE0I (rw) */
    Ifx_Strict_32Bit TRG_TE1I : 1;            /**< \brief [19:19] Force Interrupt TE1I (rw) */
    Ifx_Strict_32Bit TRG_TE2I : 1;            /**< \brief [20:20] Force Interrupt TE2I (rw) */
    Ifx_Strict_32Bit TRG_TE3I : 1;            /**< \brief [21:21] Force Interrupt TE3I (rw) */
    Ifx_Strict_32Bit TRG_TE4I : 1;            /**< \brief [22:22] Force Interrupt TE4I (rw) */
    Ifx_Strict_32Bit TRG_CDTI : 1;            /**< \brief [23:23] Force Interrupt CDTI (rw) */
    Ifx_Strict_32Bit TRG_CDSI : 1;            /**< \brief [24:24] Force Interrupt CDSI (rw) */
    Ifx_Strict_32Bit TRG_TORI : 1;            /**< \brief [25:25] Force Interrupt TORI (rw) */
    Ifx_Strict_32Bit TRG_SORI : 1;            /**< \brief [26:26] Force Interrupt SORI (rw) */
    Ifx_Strict_32Bit TRG_DCGI : 1;            /**< \brief [27:27] Force interrupt DCGI (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_FORCINT_Bits;

/** \\brief  DPLL Interrupt Mode Register */
typedef struct _Ifx_GTM_DPLL_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_MODE_Bits;

/** \\brief  DPLL Interrupt Notification Register */
typedef struct _Ifx_GTM_DPLL_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit PDI : 1;                 /**< \brief [0:0] DPLL disable interrupt; announces the switch off of the DEN bit. (rw) */
    Ifx_Strict_32Bit PEI : 1;                 /**< \brief [1:1] DPLL enable interrupt (rw) */
    Ifx_Strict_32Bit TINI : 1;                /**< \brief [2:2] TRIGGER minimum hold time violation interrupt (dt <= THMI > 0). (rw) */
    Ifx_Strict_32Bit TAXI : 1;                /**< \brief [3:3] TRIGGER maximum hold time violation interrupt (dt > THMA > 0). (rw) */
    Ifx_Strict_32Bit SISI : 1;                /**< \brief [4:4] STATE inactive slope interrupt. (rw) */
    Ifx_Strict_32Bit TISI : 1;                /**< \brief [5:5] TRIGGER inactive slope interrupt. (rw) */
    Ifx_Strict_32Bit MSI : 1;                 /**< \brief [6:6] Missing STATE interrupt. (rw) */
    Ifx_Strict_32Bit MTI : 1;                 /**< \brief [7:7] Missing TRIGGER interrupt. (rw) */
    Ifx_Strict_32Bit SASI : 1;                /**< \brief [8:8] STATE active slope interrupt. (rw) */
    Ifx_Strict_32Bit TASI : 1;                /**< \brief [9:9] TRIGGER active slope interrupt. (rw) */
    Ifx_Strict_32Bit PWI : 1;                 /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER. (rw) */
    Ifx_Strict_32Bit W2I : 1;                 /**< \brief [11:11] RAM write access to RAM region 2 interrupt. (rw) */
    Ifx_Strict_32Bit W1I : 1;                 /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt. (rw) */
    Ifx_Strict_32Bit GL1I : 1;                /**< \brief [13:13] Get of lock interrupt, for SUB_INC1. (rw) */
    Ifx_Strict_32Bit LL1I : 1;                /**< \brief [14:14] Loss of lock interrupt for SUB_INC1. (rw) */
    Ifx_Strict_32Bit EI : 1;                  /**< \brief [15:15] Error interrupt (see status register bit 31). (rw) */
    Ifx_Strict_32Bit GL2I : 1;                /**< \brief [16:16] Get of lock interrupt, for SUB_INC2. (rw) */
    Ifx_Strict_32Bit LL2I : 1;                /**< \brief [17:17] Loss of lock interrupt for SUB_INC2. (rw) */
    Ifx_Strict_32Bit TE0I : 1;                /**< \brief [18:18] TRIGGER event interrupt 0. (rw) */
    Ifx_Strict_32Bit TE1I : 1;                /**< \brief [19:19] TRIGGER event interrupt 1. (rw) */
    Ifx_Strict_32Bit TE2I : 1;                /**< \brief [20:20] TRIGGER event interrupt 2. (rw) */
    Ifx_Strict_32Bit TE3I : 1;                /**< \brief [21:21] TRIGGER event interrupt 3. (rw) */
    Ifx_Strict_32Bit TE4I : 1;                /**< \brief [22:22] TRIGGER event interrupt 4. (rw) */
    Ifx_Strict_32Bit CDTI : 1;                /**< \brief [23:23] Calculation of TRIGGER duration done, only while NTI_CNT is zero. (rw) */
    Ifx_Strict_32Bit CDSI : 1;                /**< \brief [24:24] Calculation of STATE duration done (rw) */
    Ifx_Strict_32Bit TORI : 1;                /**< \brief [25:25] TRIGGER out of range interrupt (rw) */
    Ifx_Strict_32Bit SORI : 1;                /**< \brief [26:26] STATE out of range (rw) */
    Ifx_Strict_32Bit DCGI : 1;                /**< \brief [27:27] Direction change interrupt (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_NOTIFY_Bits;

/** \\brief  DPLL Weighted Difference of Prediction Errors of STATE */
typedef struct _Ifx_GTM_DPLL_MEDT_S_Bits
{
    Ifx_Strict_32Bit MEDT_S : 24;             /**< \brief [23:0] Signed middle weighted difference between actual value and prediction of the last STATE increments: sint24; only calculated for SYS=1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MEDT_S_Bits;

/** \\brief  DPLL Weighted Difference of Prediction Errors of TRIGGER */
typedef struct _Ifx_GTM_DPLL_MEDT_T_Bits
{
    Ifx_Strict_32Bit MEDT_T : 24;             /**< \brief [23:0] Signed middle weighted difference between actual value and prediction of the last TRIGGER increments: sint24 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MEDT_T_Bits;

/** \\brief  DPLL Calculated Number of Sub-Pulses between two nominal STATE
 * Events for SMC=0 */
typedef struct _Ifx_GTM_DPLL_MLS1_Bits
{
    Ifx_Strict_32Bit MLS1 : 18;               /**< \brief [17:0] Number of pulses between two STATE events (rw) */
    Ifx_Strict_32Bit NOT_USED : 6;            /**< \brief [23:18] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MLS1_Bits;

/** \\brief  DPLL Calculated Number of Sub-Pulses between two nominal STATE
 * Events for SMC=1 and RMO=1 */
typedef struct _Ifx_GTM_DPLL_MLS2_Bits
{
    Ifx_Strict_32Bit MLS2 : 18;               /**< \brief [17:0] number of pulses between two STATE events (to be set and updated by the CPU). (rw) */
    Ifx_Strict_32Bit NOT_USED : 6;            /**< \brief [23:18] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MLS2_Bits;

/** \\brief  DPLL Missing Pulses to be Added or Subtracted Directly 1 */
typedef struct _Ifx_GTM_DPLL_MPVAL1_Bits
{
    Ifx_Strict_32Bit MPVAL1 : 16;             /**< \brief [15:0] Missing pulses for direct correction of SUB_INC1 pulses by the CPU (sint16) (rw) */
    Ifx_Strict_32Bit SIX1 : 8;                /**< \brief [23:16] Sign extension for MPVAL1 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MPVAL1_Bits;

