Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Missing Pulses to be Added or Subtracted Directly 2 */
typedef struct _Ifx_GTM_DPLL_MPVAL2_Bits
{
    Ifx_Strict_32Bit MPVAL2 : 16;             /**< \brief [15:0] Missing pulses for direct correction of SUB_INC2 pulses by the CPU (sint16) (rw) */
    Ifx_Strict_32Bit SIX2 : 8;                /**< \brief [23:16] Sign extension for MPVAL2 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_MPVAL2_Bits;

/** \\brief  DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
typedef struct _Ifx_GTM_DPLL_NA_Bits
{
    Ifx_Strict_32Bit DB : 10;                 /**< \brief [9:0] Number of events to Action_z (fractional part, z=0-31) (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [19:10] Number of events to Action_z (integer part, z=0-31) (rw) */
    Ifx_Strict_32Bit NOT_USED : 4;            /**< \brief [23:20] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NA_Bits;

/** \\brief  DPLL Number of Pulses to be Sent in Emergency Mode */
typedef struct _Ifx_GTM_DPLL_NMB_S_Bits
{
    Ifx_Strict_32Bit NMB_S : 20;              /**< \brief [19:0] Number of pulses for STATE (rw) */
    Ifx_Strict_32Bit NOT_USED : 4;            /**< \brief [23:20] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_S_Bits;

/** \\brief  DPLL Target Number of Pulses to be Sent in Emergency Mode */
typedef struct _Ifx_GTM_DPLL_NMB_S_TAR_Bits
{
    Ifx_Strict_32Bit NMB_S_TAR : 20;          /**< \brief [19:0] Target Number of pulses for STATE (rw) */
    Ifx_Strict_32Bit NOT_USED : 4;            /**< \brief [23:20] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_S_TAR_Bits;

/** \\brief  DPLL Last but one Target Number of Pulses to be Sent in Emergency
 * Mode */
typedef struct _Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits
{
    Ifx_Strict_32Bit NMB_S_TAR_OLD : 20;      /**< \brief [19:0] Target Number of pulses for STATE (rw) */
    Ifx_Strict_32Bit NOT_USED : 4;            /**< \brief [23:20] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits;

/** \\brief  DPLL Number of Pulses to be Sent in Normal Mode */
typedef struct _Ifx_GTM_DPLL_NMB_T_Bits
{
    Ifx_Strict_32Bit NMB_T : 16;              /**< \brief [15:0] Number of pulses for TRIGGER (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_T_Bits;

/** \\brief  DPLL Target Number of Pulses to be Sent in Normal Mode */
typedef struct _Ifx_GTM_DPLL_NMB_T_TAR_Bits
{
    Ifx_Strict_32Bit NMB_T_TAR : 16;          /**< \brief [15:0] Target Number of pulses for TRIGGER (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_T_TAR_Bits;

/** \\brief  DPLL Last but one Target Number of Pulses to be Sent in Normal Mode */
typedef struct _Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits
{
    Ifx_Strict_32Bit NMB_T_TAR_OLD : 16;      /**< \brief [15:0] Target Number of pulses for TRIGGER (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits;

/** \\brief  DPLL Number of Active TRIGGER Events to Interrupt */
typedef struct _Ifx_GTM_DPLL_NTI_CNT_Bits
{
    Ifx_Strict_32Bit NTI_CNT : 10;            /**< \brief [9:0] Number of TRIGGERs to interrupt (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NTI_CNT_Bits;

/** \\brief  DPLL Number of Recent STATE Events Used for Calculations */
typedef struct _Ifx_GTM_DPLL_NUSC_Bits
{
    Ifx_Strict_32Bit NUSE : 6;                /**< \brief [5:0] Number of recent STATE events used for SUB_INCx calculations modulo 2*(SNUmax+1). (rw) */
    Ifx_Strict_32Bit FSS : 1;                 /**< \brief [6:6] FULL_SCALE of STATE (rw) */
    Ifx_Strict_32Bit SYN_S : 6;               /**< \brief [12:7] Number of real and virtual events to be considered for the current increment. (rw) */
    Ifx_Strict_32Bit SYN_S_OLD : 6;           /**< \brief [18:13] Number of real and virtual events to be considered for the last increment. (rw) */
    Ifx_Strict_32Bit VSN : 6;                 /**< \brief [24:19] Virtual STATE number (rw) */
    Ifx_Strict_32Bit reserved_25 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WNUS : 1;                /**< \brief [29:29] Write control bit for NUSE (rw) */
    Ifx_Strict_32Bit WSYN : 1;                /**< \brief [30:30] Write control bit for SYN_S and SYN_S_OLD (rw) */
    Ifx_Strict_32Bit WVSN : 1;                /**< \brief [31:31] Write control bit for VS (rw) */
} Ifx_GTM_DPLL_NUSC_Bits;

/** \\brief  DPLL Extension register number 1 for DPLL_NUSC 4 */
typedef struct _Ifx_GTM_DPLL_NUSC_EXT1_Bits
{
    Ifx_Strict_32Bit SYN_S : 7;               /**< \brief [6:0] Number of real and virtual events to be considered for the current increment. (rw) */
    Ifx_Strict_32Bit reserved_7 : 9;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SYN_S_OLD : 7;           /**< \brief [22:16] Number of real and virtual events to be considered for the last increment. (rw) */
    Ifx_Strict_32Bit reserved_23 : 7;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WSYN : 1;                /**< \brief [30:30] Write control bit for SYN_S and SYN_S_OLD (rw) */
    Ifx_Strict_32Bit reserved_31 : 1;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NUSC_EXT1_Bits;

/** \\brief  DPLL Extension register number 2 for DPLL_NUSC 4 */
typedef struct _Ifx_GTM_DPLL_NUSC_EXT2_Bits
{
    Ifx_Strict_32Bit NUSE : 7;                /**< \brief [6:0] Number of recent STATE events used for SUB_INCx calculations modulo 2*(SNUmax+1). (rw) */
    Ifx_Strict_32Bit reserved_7 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FSS : 1;                 /**< \brief [15:15] this value is to be set, when NUSE is set to FULL_SCALE (rw) */
    Ifx_Strict_32Bit VSN : 7;                 /**< \brief [22:16] Number of virtual state increments in the current NUSE region. (rw) */
    Ifx_Strict_32Bit reserved_23 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WNUS : 1;                /**< \brief [29:29] Write control bit for NUSE (rw) */
    Ifx_Strict_32Bit reserved_30 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WVSN : 1;                /**< \brief [31:31] write control bit for VSN (rw) */
} Ifx_GTM_DPLL_NUSC_EXT2_Bits;

/** \\brief  DPLL Number of Recent TRIGGER Events Used for Calculations */
typedef struct _Ifx_GTM_DPLL_NUTC_Bits
{
    Ifx_Strict_32Bit NUTE : 10;               /**< \brief [9:0] Number of recent TRIGGER events used for SUB_INC1 and action calculations modulo 2*(TNUmax+1) (rw) */
    Ifx_Strict_32Bit FST : 1;                 /**< \brief [10:10] FULL_SCALE of TRIGGER (rw) */
    Ifx_Strict_32Bit reserved_11 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SYN_T : 3;               /**< \brief [15:13] Number of real and virtual events to be considered for the current increment. (rw) */
    Ifx_Strict_32Bit SYN_T_OLD : 3;           /**< \brief [18:16] Number of real and virtual events to be considered for the last increment (rw) */
    Ifx_Strict_32Bit VTN : 6;                 /**< \brief [24:19] Virtual TRIGGER number (rw) */
    Ifx_Strict_32Bit reserved_25 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WNUT : 1;                /**< \brief [29:29] Write control bit for NUTE and FST (rw) */
    Ifx_Strict_32Bit WSYN : 1;                /**< \brief [30:30] Write control bit for SYN_T and SYN_T_OLD (rw) */
    Ifx_Strict_32Bit WVTN : 1;                /**< \brief [31:31] Write control bit for VTN (rw) */
} Ifx_GTM_DPLL_NUTC_Bits;

/** \\brief  DPLL Offset And Switch Old/New Address Register */
typedef struct _Ifx_GTM_DPLL_OSW_Bits
{
    Ifx_Strict_32Bit SWON_S : 1;              /**< \brief [0:0] Switch of new STATE (r) */
    Ifx_Strict_32Bit SWON_T : 1;              /**< \brief [1:1] Switch of new TRIGGER (r) */
    Ifx_Strict_32Bit reserved_2 : 6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSS : 2;                 /**< \brief [9:8] Offset size of RAM region 2 (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_OSW_Bits;

