Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Projected Increment Sum Relations for Action 0 */
typedef struct _Ifx_GTM_DPLL_PDT_0_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_0_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 10 */
typedef struct _Ifx_GTM_DPLL_PDT_10_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_10_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 11 */
typedef struct _Ifx_GTM_DPLL_PDT_11_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_11_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 12 */
typedef struct _Ifx_GTM_DPLL_PDT_12_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_12_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 13 */
typedef struct _Ifx_GTM_DPLL_PDT_13_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_13_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 14 */
typedef struct _Ifx_GTM_DPLL_PDT_14_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_14_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 15 */
typedef struct _Ifx_GTM_DPLL_PDT_15_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_15_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 16 */
typedef struct _Ifx_GTM_DPLL_PDT_16_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_16_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 17 */
typedef struct _Ifx_GTM_DPLL_PDT_17_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_17_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 18 */
typedef struct _Ifx_GTM_DPLL_PDT_18_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_18_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 19 */
typedef struct _Ifx_GTM_DPLL_PDT_19_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_19_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 1 */
typedef struct _Ifx_GTM_DPLL_PDT_1_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_1_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 20 */
typedef struct _Ifx_GTM_DPLL_PDT_20_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_20_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 21 */
typedef struct _Ifx_GTM_DPLL_PDT_21_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_21_Bits;

