Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Projected Increment Sum Relations for Action 22 */
typedef struct _Ifx_GTM_DPLL_PDT_22_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_22_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 23 */
typedef struct _Ifx_GTM_DPLL_PDT_23_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_23_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 24 */
typedef struct _Ifx_GTM_DPLL_PDT_24_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_24_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 25 */
typedef struct _Ifx_GTM_DPLL_PDT_25_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_25_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 26 */
typedef struct _Ifx_GTM_DPLL_PDT_26_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_26_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 27 */
typedef struct _Ifx_GTM_DPLL_PDT_27_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_27_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 28 */
typedef struct _Ifx_GTM_DPLL_PDT_28_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_28_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 29 */
typedef struct _Ifx_GTM_DPLL_PDT_29_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_29_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 2 */
typedef struct _Ifx_GTM_DPLL_PDT_2_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_2_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 30 */
typedef struct _Ifx_GTM_DPLL_PDT_30_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_30_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 31 */
typedef struct _Ifx_GTM_DPLL_PDT_31_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_31_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 3 */
typedef struct _Ifx_GTM_DPLL_PDT_3_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_3_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 4 */
typedef struct _Ifx_GTM_DPLL_PDT_4_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_4_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 5 */
typedef struct _Ifx_GTM_DPLL_PDT_5_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_5_Bits;

