Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Projected Increment Sum Relations for Action 6 */
typedef struct _Ifx_GTM_DPLL_PDT_6_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_6_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 7 */
typedef struct _Ifx_GTM_DPLL_PDT_7_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_7_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 8 */
typedef struct _Ifx_GTM_DPLL_PDT_8_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_8_Bits;

/** \\brief  DPLL Projected Increment Sum Relations for Action 9 */
typedef struct _Ifx_GTM_DPLL_PDT_9_Bits
{
    Ifx_Strict_32Bit DB : 14;                 /**< \brief [13:0] Fractional part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit DW : 10;                 /**< \brief [23:14] Integer part of relation between TRIGGER or STATE increments. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PDT_9_Bits;

/** \\brief  DPLL ACTION Position/Value Request */
typedef struct _Ifx_GTM_DPLL_PSA_Bits
{
    Ifx_Strict_32Bit PSA : 24;                /**< \brief [23:0] Position information of a desired action (z=0-31) (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSA_Bits;

/** \\brief  DPLL ACTION Position/Value Action 0 Request Register */
typedef struct _Ifx_GTM_DPLL_PSAC_Bits
{
    Ifx_Strict_32Bit PSAC : 24;               /**< \brief [23:0] Calculated position value for the start of ACTION_z in normal or emergency mode according to equations DPLL-17 or DPLL-20 respectively (z=0-31). (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSAC_Bits;

/** \\brief  DPLL Actual Calculated Position Stamp of STATE */
typedef struct _Ifx_GTM_DPLL_PSSC_Bits
{
    Ifx_Strict_32Bit PSSC : 24;               /**< \brief [23:0] Calculated position stamp for the last STATE input; (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSSC_Bits;

/** \\brief  DPLL Measured Position Stamp at Last STATE Input */
typedef struct _Ifx_GTM_DPLL_PSSM_Bits
{
    Ifx_Strict_32Bit PSSM : 24;               /**< \brief [23:0] Position stamp of STATE, measured (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSSM_Bits;

/** \\brief  DPLL Measured Position Stamp at Last but one STATE Input */
typedef struct _Ifx_GTM_DPLL_PSSM_OLD_Bits
{
    Ifx_Strict_32Bit PSSM_OLD : 24;           /**< \brief [23:0] Last but one position stamp of STATE, measured (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSSM_OLD_Bits;

/** \\brief  DPLL Actual Calculated Position Stamp of TRIGGER */
typedef struct _Ifx_GTM_DPLL_PSTC_Bits
{
    Ifx_Strict_32Bit PSTC : 24;               /**< \brief [23:0] Calculated position stamp of last TRIGGER input (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSTC_Bits;

/** \\brief  DPLL Measured Position Stamp at Last TRIGGER Input */
typedef struct _Ifx_GTM_DPLL_PSTM_Bits
{
    Ifx_Strict_32Bit PSTM : 24;               /**< \brief [23:0] Position stamp of TRIGGER, measured (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSTM_Bits;

/** \\brief  DPLL Measured Position Stamp at Last but one TRIGGER Input */
typedef struct _Ifx_GTM_DPLL_PSTM_OLD_Bits
{
    Ifx_Strict_32Bit PSTM_OLD : 24;           /**< \brief [23:0] Last but one position stamp of TRIGGER, measured (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSTM_OLD_Bits;

/** \\brief  DPLL Plausibility Value of Next TRIGGER Slope */
typedef struct _Ifx_GTM_DPLL_PVT_Bits
{
    Ifx_Strict_32Bit PVT : 24;                /**< \brief [23:0] Plausibility value of next active TRIGGER slope (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PVT_Bits;

/** \\brief  DPLL RAM Initialization Register */
typedef struct _Ifx_GTM_DPLL_RAM_INI_Bits
{
    Ifx_Strict_32Bit INIT_1A : 1;             /**< \brief [0:0] RAM region 1a initialization in progress (r) */
    Ifx_Strict_32Bit INIT_1BC : 1;            /**< \brief [1:1] RAM region 1b and 1c initialization in progress (r) */
    Ifx_Strict_32Bit INIT_2 : 1;              /**< \brief [2:2] RAM region 2 initialization in progress (r) */
    Ifx_Strict_32Bit reserved_3 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit INIT_RAM : 1;            /**< \brief [4:4] RAM regions 1a, 1b and 2 are to be initialized. (rw) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RAM_INI_Bits;

/** \\brief  DPLL Reciprocal Value of the Expected Increment Duration of STATE */
typedef struct _Ifx_GTM_DPLL_RCDT_SX_Bits
{
    Ifx_Strict_32Bit RCDT_SX : 24;            /**< \brief [23:0] Reciprocal value of expected increment duration *2while only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RCDT_SX_Bits;

