Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Reciprocal Value of the Expected Nominal Increment Duration of
 * STATE */
typedef struct _Ifx_GTM_DPLL_RCDT_SX_NOM_Bits
{
    Ifx_Strict_32Bit RCDT_SX_NOM : 24;        /**< \brief [23:0] Reciprocal value of nominal increment duration *2while only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RCDT_SX_NOM_Bits;

/** \\brief  DPLL Reciprocal Value of the Expected Increment Duration of TRIGGER */
typedef struct _Ifx_GTM_DPLL_RCDT_TX_Bits
{
    Ifx_Strict_32Bit RCDT_TX : 24;            /**< \brief [23:0] Reciprocal value of expected increment duration *2while only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RCDT_TX_Bits;

/** \\brief  DPLL Reciprocal Value of the Expected Nominal Increment Duration of
 * TRIGGER */
typedef struct _Ifx_GTM_DPLL_RCDT_TX_NOM_Bits
{
    Ifx_Strict_32Bit RCDT_TX_NOM : 24;        /**< \brief [23:0] Reciprocal value of nominal increment duration *2while only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RCDT_TX_NOM_Bits;

/** \\brief  DPLL Reciprocal Value of the Last Increment of STATE */
typedef struct _Ifx_GTM_DPLL_RDT_S_ACT_Bits
{
    Ifx_Strict_32Bit RDT_S_ACT : 24;          /**< \brief [23:0] Reciprocal value of last STATE increment *2, only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RDT_S_ACT_Bits;

/** \\brief  DPLL Reciprocal Values of the Nominal STATE Increment Duration in
 * FULL_SCALE */
typedef struct _Ifx_GTM_DPLL_RDT_S_Bits
{
    Ifx_Strict_32Bit RDT_S : 24;              /**< \brief [23:0] Reciprocal difference time of STATE (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RDT_S_Bits;

/** \\brief  DPLL Reciprocal Value of the Last Increment of TRIGGER */
typedef struct _Ifx_GTM_DPLL_RDT_T_ACT_Bits
{
    Ifx_Strict_32Bit RDT_T_ACT : 24;          /**< \brief [23:0] Reciprocal value of last TRIGGER increment *2, only the lower 24 bits are used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RDT_T_ACT_Bits;

/** \\brief  DPLL Additional STATE Input Delay Register */
typedef struct _Ifx_GTM_DPLL_SIDEL_Bits
{
    Ifx_Strict_32Bit SIDEL : 24;              /**< \brief [23:0] STATE input delay (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_SIDEL_Bits;

/** \\brief  DPLL STATE Locking Range */
typedef struct _Ifx_GTM_DPLL_SLR_Bits
{
    Ifx_Strict_32Bit SLR : 8;                 /**< \brief [7:0] Value is to be multiplied with the last nominal STATE duration in order to get the range for the next STATE event without setting SOR in the DPLL_STATUS register (rw) */
    Ifx_Strict_32Bit NOT_USED : 16;           /**< \brief [23:8] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_SLR_Bits;

/** \\brief  DPLL Status of the State Machine States Register */
typedef struct _Ifx_GTM_DPLL_STA_Bits
{
    Ifx_Strict_32Bit STA_T : 8;               /**< \brief [7:0] Status of TRIGGER state machine; state binary coded (r) */
    Ifx_Strict_32Bit reserved_8 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CNT_T : 3;               /**< \brief [11:9] Count TRIGGER (r) */
    Ifx_Strict_32Bit STA_S : 8;               /**< \brief [19:12] Status of STATE state machine (r) */
    Ifx_Strict_32Bit reserved_20 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CNT_S : 3;               /**< \brief [23:21] Count STATE (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_STA_Bits;

/** \\brief  DPLL STA Flag Register */
typedef struct _Ifx_GTM_DPLL_STA_FLAG_Bits
{
    Ifx_Strict_32Bit STA_FLAG_T : 1;          /**< \brief [0:0] Flag according to DPLL_MASK.STA_NOTIFY_T (rw) */
    Ifx_Strict_32Bit reserved_1 : 7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit STA_FLAG_S : 1;          /**< \brief [8:8] Flag according to DPLL_STA_MASK.STA_NOTIFY_S (rw) */
    Ifx_Strict_32Bit INC_CNT1_FLAG : 1;       /**< \brief [9:9] Flag according to DPLL_INC_CNT1_MASK.INC_CNT1_NOTIFY (rw) */
    Ifx_Strict_32Bit INC_CNT2_FLAG : 1;       /**< \brief [10:10] Flag according to DPLL_INC_CNT2_MASK.INC_CNT2_NOTIFY (rw) */
    Ifx_Strict_32Bit reserved_11 : 21;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_STA_FLAG_Bits;

/** \\brief  DPLL Trigger Masks for Signals DPLL_STA_T and DPLL_STA_S */
typedef struct _Ifx_GTM_DPLL_STA_MASK_Bits
{
    Ifx_Strict_32Bit STA_NOTIFY_T : 8;        /**< \brief [7:0] Notify value for STA_T of register DPLL_STA. (rw) */
    Ifx_Strict_32Bit STA_NOTIFY_S : 8;        /**< \brief [15:8] Notify value for STA_S of register DPLL_STA. (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_STA_MASK_Bits;

/** \\brief  DPLL Status Register */
typedef struct _Ifx_GTM_DPLL_STATUS_Bits
{
    Ifx_Strict_32Bit FPCE : 1;                /**< \brief [0:0] Fast pulse correction error (rw) */
    Ifx_Strict_32Bit CSO : 1;                 /**< \brief [1:1] Calculated STATE duration overflow (rw) */
    Ifx_Strict_32Bit reserved_2 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CTO : 1;                 /**< \brief [3:3] Calculated TRIGGER duration overflow (rw) */
    Ifx_Strict_32Bit CRO : 1;                 /**< \brief [4:4] Calculated Reciprocal value overflow (rw) */
    Ifx_Strict_32Bit RCS : 1;                 /**< \brief [5:5] Resolution conflict STATE. (r) */
    Ifx_Strict_32Bit RCT : 1;                 /**< \brief [6:6] Resolution conflict TRIGGER. (r) */
    Ifx_Strict_32Bit PSE : 1;                 /**< \brief [7:7] Prediction space configuration error (r) */
    Ifx_Strict_32Bit SOR : 1;                 /**< \brief [8:8] STATE out of range (rw) */
    Ifx_Strict_32Bit MS : 1;                  /**< \brief [9:9] Missing STATE detected according to SOV. (rw) */
    Ifx_Strict_32Bit TOR : 1;                 /**< \brief [10:10] TRIGGER out of range (rw) */
    Ifx_Strict_32Bit MT : 1;                  /**< \brief [11:11] Missing TRIGGER detected according to TOV (rw) */
    Ifx_Strict_32Bit RAM2_ERR : 1;            /**< \brief [12:12] DPLL internal access to not configured RAM2 memory space (rw) */
    Ifx_Strict_32Bit reserved_13 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LOW_RES : 1;             /**< \brief [15:15] Low resolution of TBU_TS0 is used for DPLL input (r) */
    Ifx_Strict_32Bit CSVS : 1;                /**< \brief [16:16] Current signal value STATE (r) */
    Ifx_Strict_32Bit CSVT : 1;                /**< \brief [17:17] Current signal value TRIGGER (r) */
    Ifx_Strict_32Bit CAIP2 : 1;               /**< \brief [18:18] Calculation of upper half actions in progress (r) */
    Ifx_Strict_32Bit CAIP1 : 1;               /**< \brief [19:19] Calculation of lower half actions in progress (r) */
    Ifx_Strict_32Bit ISN : 1;                 /**< \brief [20:20] Increment number of STATE is not plausible (r) */
    Ifx_Strict_32Bit ITN : 1;                 /**< \brief [21:21] Increment number of TRIGGER is not plausible (r) */
    Ifx_Strict_32Bit BWD2 : 1;                /**< \brief [22:22] Backwards drive of SUB_INC2 (r) */
    Ifx_Strict_32Bit BWD1 : 1;                /**< \brief [23:23] Backwards drive of SUB_INC1 (r) */
    Ifx_Strict_32Bit reserved_24 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LOCK2 : 1;               /**< \brief [25:25] DPLL Lock status concerning SUB_INC2 (r) */
    Ifx_Strict_32Bit SYS : 1;                 /**< \brief [26:26] Synchronization condition of STATE fixed. (r) */
    Ifx_Strict_32Bit SYT : 1;                 /**< \brief [27:27] Synchronization condition of TRIGGER fixed. (r) */
    Ifx_Strict_32Bit FSD : 1;                 /**< \brief [28:28] First STATE detected. (r) */
    Ifx_Strict_32Bit FTD : 1;                 /**< \brief [29:29] First TRIGGER detected. (r) */
    Ifx_Strict_32Bit LOCK1 : 1;               /**< \brief [30:30] DPLL Lock status concerning SUB_INC1 (r) */
    Ifx_Strict_32Bit ERR : 1;                 /**< \brief [31:31] Error during configuration or operation resulting in unexpected values. (r) */
} Ifx_GTM_DPLL_STATUS_Bits;

/** \\brief  DPLL TBU_TS0 Value at last STATE Event */
typedef struct _Ifx_GTM_DPLL_TBU_TS0_S_Bits
{
    Ifx_Strict_32Bit TBU_TS0_S : 24;          /**< \brief [23:0] Value of TBU_TS0 at the last STATE event; (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TBU_TS0_S_Bits;

