Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL TBU_TS0 Value at last TRIGGER Event */
typedef struct _Ifx_GTM_DPLL_TBU_TS0_T_Bits
{
    Ifx_Strict_32Bit TBU_TS0_T : 24;          /**< \brief [23:0] Value of TBU_TS0 at the last TRIGGER event; (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TBU_TS0_T_Bits;

/** \\brief  DPLL TRIGGER Hold Time Maximum Value */
typedef struct _Ifx_GTM_DPLL_THMA_Bits
{
    Ifx_Strict_32Bit THMA : 16;               /**< \brief [15:0] Maximal time between active and inactive TRIGGER slope (uint16) (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_THMA_Bits;

/** \\brief  DPLL TRIGGER Hold Time Minimum Value */
typedef struct _Ifx_GTM_DPLL_THMI_Bits
{
    Ifx_Strict_32Bit THMI : 16;               /**< \brief [15:0] Minimal time between active and inactive TRIGGER slope (uint16) (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_THMI_Bits;

/** \\brief  DPLL Immediate THVAL Value Register */
typedef struct _Ifx_GTM_DPLL_THVAL2_Bits
{
    Ifx_Strict_32Bit THVAL : 24;              /**< \brief [23:0] Measured last pulse time from active to inactive slope of TRIGGER after correction of input slope filter delays (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_THVAL2_Bits;

/** \\brief  DPLL Measured TRIGGER Hold Time Value */
typedef struct _Ifx_GTM_DPLL_THVAL_Bits
{
    Ifx_Strict_32Bit THVAL : 24;              /**< \brief [23:0] Measured time from the last active slope to the next inactive TRIGGER slope in time stamp clock counts: this does mean the clock selected for the TBU_CH0_BASE (uint16) (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_THVAL_Bits;

/** \\brief  DPLL Additional TRIGGER Input Register */
typedef struct _Ifx_GTM_DPLL_TIDEL_Bits
{
    Ifx_Strict_32Bit TIDEL : 24;              /**< \brief [23:0] TRIGGER input delay (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TIDEL_Bits;

/** \\brief  DPLL TRIGGER Locking Range */
typedef struct _Ifx_GTM_DPLL_TLR_Bits
{
    Ifx_Strict_32Bit TLR : 8;                 /**< \brief [7:0] Value is to be multiplied with the last nominal TRIGGER duration in order to get the range for the next TRIGGER event without setting TOR in the DPLL_STATUS register (rw) */
    Ifx_Strict_32Bit NOT_USED : 16;           /**< \brief [23:8] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TLR_Bits;

/** \\brief  DPLL Time Out Value of Active TRIGGER Slope */
typedef struct _Ifx_GTM_DPLL_TOV_Bits
{
    Ifx_Strict_32Bit TOV_DB : 10;             /**< \brief [9:0] Decision value (fractional part) for missing TRIGGER interrupt (rw) */
    Ifx_Strict_32Bit TOV_DW : 6;              /**< \brief [15:10] Decision value (integer part) for missing TRIGGER interrupt (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TOV_Bits;

/** \\brief  DPLL Time Out Value of active STATE Slope */
typedef struct _Ifx_GTM_DPLL_TOV_S_Bits
{
    Ifx_Strict_32Bit DB : 10;                 /**< \brief [9:0] Decision value (fractional part) for missing STATE interrupt. (rw) */
    Ifx_Strict_32Bit DW : 6;                  /**< \brief [15:10] Decision value (integer part) for missing STATE interrupt. (rw) */
    Ifx_Strict_32Bit NOT_USED : 8;            /**< \brief [23:16] Not used (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TOV_S_Bits;

/** \\brief  DPLL Actual STATE Time Stamp */
typedef struct _Ifx_GTM_DPLL_TS_S_Bits
{
    Ifx_Strict_32Bit STATE_TS : 24;           /**< \brief [23:0] Time stamp value of the last active STATE input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_S_Bits;

/** \\brief  DPLL Previous STATE Time Stamp */
typedef struct _Ifx_GTM_DPLL_TS_S_OLD_Bits
{
    Ifx_Strict_32Bit STATE_TS_OLD : 24;       /**< \brief [23:0] Time stamp value of the last active STATE input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_S_OLD_Bits;

/** \\brief  DPLL Actual TRIGGER Time Stamp Value */
typedef struct _Ifx_GTM_DPLL_TS_T_Bits
{
    Ifx_Strict_32Bit TRIGGER_TS : 24;         /**< \brief [23:0] Time stamp value of the last active TRIGGER input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_T_Bits;

/** \\brief  DPLL Previous TRIGGER Time Stamp Value */
typedef struct _Ifx_GTM_DPLL_TS_T_OLD_Bits
{
    Ifx_Strict_32Bit TRIGGER_TS_OLD : 24;     /**< \brief [23:0] Time stamp value of the last but one active TRIGGER input. (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_T_OLD_Bits;

/** \\brief  DPLL Calculated Time Value to start Action 0 Register */
typedef struct _Ifx_GTM_DPLL_TSAC_Bits
{
    Ifx_Strict_32Bit TSAC : 24;               /**< \brief [23:0] Calculated time stamp for ACTION_z (z=0-31) (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TSAC_Bits;

/** \\brief  DPLL Time Stamp Values of the Nominal STATE Events in FULL_SCALE */
typedef struct _Ifx_GTM_DPLL_TSF_S_Bits
{
    Ifx_Strict_32Bit TSF_S : 24;              /**< \brief [23:0] Time stamp field of STATE (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TSF_S_Bits;

/** \\brief  DTM_AUX Input Selection Register */
typedef struct _Ifx_GTM_DTMAUXINSEL_Bits
{
    Ifx_Strict_32Bit ASEL0 : 2;               /**< \brief [1:0] CDTM0_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL1 : 2;               /**< \brief [3:2] CDTM1_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL2 : 2;               /**< \brief [5:4] CDTM2_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL3 : 2;               /**< \brief [7:6] CDTM3_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL4 : 2;               /**< \brief [9:8] CDTM4_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL5 : 2;               /**< \brief [11:10] CDTM5_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit ASEL6 : 2;               /**< \brief [13:12] CDTM6_DTM4_AUX Input Selection (ATOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit reserved_14 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TSEL0 : 2;               /**< \brief [17:16] CDTM0_DTM0_AUX Input Selection (TOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit TSEL1 : 2;               /**< \brief [19:18] CDTM1_DTM0_AUX Input Selection (TOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit TSEL2 : 2;               /**< \brief [21:20] CDTM2_DTM0_AUX Input Selection (TOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit TSEL3 : 2;               /**< \brief [23:22] CDTM3_DTM0_AUX Input Selection (TOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit TSEL4 : 2;               /**< \brief [25:24] CDTM4_DTM0_AUX Input Selection (TOMx_CH0...3) (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_DTMAUXINSEL_Bits;

/** \\brief  GTM Error interrupt enable register */
typedef struct _Ifx_GTM_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit AEI_TO_XPT_EIRQ_EN : 1;    /**< \brief [0:0] AEI_TO_XPT_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEI_USP_ADDR_EIRQ_EN : 1;  /**< \brief [1:1] AEI_USP_ADDR_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEI_IM_ADDR_EIRQ_EN : 1;   /**< \brief [2:2] AEI_IM_ADDR_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEI_USP_BE_EIRQ_EN : 1;    /**< \brief [3:3] AEI_USP_BE_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEIM_USP_ADDR_EIRQ_EN : 1; /**< \brief [4:4] AEIM_USP_ADDR_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEIM_IM_ADDR_EIRQ_EN : 1;  /**< \brief [5:5] AEIM_IM_ADDR_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit AEIM_USP_BE_EIRQ_EN : 1;   /**< \brief [6:6] AEIM_USP_BE_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit CLK_EN_ERR_EIRQ_EN : 1;    /**< \brief [7:7] CLK_EN_ERR_EIRQ interrupt enable. (rw) */
    Ifx_Strict_32Bit CLK_PER_ERR_EIRQ_EN : 1;   /**< \brief [8:8] CLK_PER_ERR_EIRQ interrupt enable. (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;           /**< \brief \internal Reserved */
} Ifx_GTM_EIRQ_EN_Bits;

/** \\brief  GTM external capture trigger enable 0 */
typedef struct _Ifx_GTM_EXT_CAP_EN_Bits
{
    Ifx_Strict_32Bit TIM_I_EXT_CAP_EN : 8;    /**< \brief [7:0] TIM[i]_EXT_CAPTURE signal forwarding enable (rw) */
    Ifx_Strict_32Bit TIM_IP1_EXT_CAP_EN : 8;  /**< \brief [15:8] TIM[i+1]_EXT_CAPTURE signal forwarding enable (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_EXT_CAP_EN_Bits;

/** \\brief  F2A0 stream control register */
typedef struct _Ifx_GTM_F2A_CTRL_Bits
{
    Ifx_Strict_32Bit STR4_CONF : 2;           /**< \brief [1:0] Reconfiguration of stream 4 to FIFO channel 0 (rw) */
    Ifx_Strict_32Bit STR5_CONF : 2;           /**< \brief [3:2] Reconfiguration of stream 5 to FIFO channel 1 (rw) */
    Ifx_Strict_32Bit STR6_CONF : 2;           /**< \brief [5:4] Reconfiguration of stream 6 to FIFO channel 2 (rw) */
    Ifx_Strict_32Bit STR7_CONF : 2;           /**< \brief [7:6] Reconfiguration of stream 7 to FIFO channel 3 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_F2A_CTRL_Bits;

/** \\brief  F2A0 stream activation register */
typedef struct _Ifx_GTM_F2A_ENABLE_Bits
{
    Ifx_Strict_32Bit STR0_EN : 2;             /**< \brief [1:0] Enable/disable stream 0 (rw) */
    Ifx_Strict_32Bit STR1_EN : 2;             /**< \brief [3:2] Enable/disable stream 1 (rw) */
    Ifx_Strict_32Bit STR2_EN : 2;             /**< \brief [5:4] Enable/disable stream 2 (rw) */
    Ifx_Strict_32Bit STR3_EN : 2;             /**< \brief [7:6] Enable/disable stream 3 (rw) */
    Ifx_Strict_32Bit STR4_EN : 2;             /**< \brief [9:8] Enable/disable stream 4 (rw) */
    Ifx_Strict_32Bit STR5_EN : 2;             /**< \brief [11:10] Enable/disable stream 5 (rw) */
    Ifx_Strict_32Bit STR6_EN : 2;             /**< \brief [13:12] Enable/disable stream 6 (rw) */
    Ifx_Strict_32Bit STR7_EN : 2;             /**< \brief [15:14] Enable/disable stream 7 (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_F2A_ENABLE_Bits;

