Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  F2A0 stream 0 read address register */
typedef struct _Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits
{
    Ifx_Strict_32Bit ADDR : 9;                /**< \brief [8:0] ARU Read address (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits;

/** \\brief  F2A0 stream 0 configuration register */
typedef struct _Ifx_GTM_F2A_STR_CH_STR_CFG_Bits
{
    Ifx_Strict_32Bit reserved_0 : 16;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TMODE : 2;               /**< \brief [17:16] Transfer mode for 53 bit ARU data from/to FIFO (rw) */
    Ifx_Strict_32Bit DIR : 1;                 /**< \brief [18:18] Data transfer direction (rw) */
    Ifx_Strict_32Bit reserved_19 : 13;        /**< \brief \internal Reserved */
} Ifx_GTM_F2A_STR_CH_STR_CFG_Bits;

/** \\brief  FIFO0 channel 0 control register */
typedef struct _Ifx_GTM_FIFO_CH_CTRL_Bits
{
    Ifx_Strict_32Bit RBM : 1;                 /**< \brief [0:0] Ring buffer mode enable (rw) */
    Ifx_Strict_32Bit RAP : 1;                 /**< \brief [1:1] RAM access priority (rw) */
    Ifx_Strict_32Bit FLUSH : 1;               /**< \brief [2:2] FIFO Flush control (rw) */
    Ifx_Strict_32Bit WULOCK : 1;              /**< \brief [3:3] RAM write unlock. (rw) */
    Ifx_Strict_32Bit Reserved : 28;           /**< \brief [31:4] reserved (r) */
} Ifx_GTM_FIFO_CH_CTRL_Bits;

/** \\brief  FIFO0 channel 0 error interrupt enable register */
typedef struct _Ifx_GTM_FIFO_CH_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit FIFO_EMPTY_EIRQ_EN : 1;  /**< \brief [0:0] FIFO empty error interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_FULL_EIRQ_EN : 1;   /**< \brief [1:1] FIFO full error interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_LWM_EIRQ_EN : 1;    /**< \brief [2:2] FIFO low watermark error interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_UWM_EIRQ_EN : 1;    /**< \brief [3:3] FIFO upper watermark error interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_EIRQ_EN_Bits;

/** \\brief  FIFO0 channel 0 end address register */
typedef struct _Ifx_GTM_FIFO_CH_END_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR : 10;               /**< \brief [9:0] End address for FIFO channel z (rw) */
    Ifx_Strict_32Bit Reserved : 22;           /**< \brief [31:10] Reserved: reserved (r) */
} Ifx_GTM_FIFO_CH_END_ADDR_Bits;

/** \\brief  FIFO0 channel 0 fill level register */
typedef struct _Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits
{
    Ifx_Strict_32Bit LEVEL : 11;              /**< \brief [10:0] Fill level of the current FIFO (r) */
    Ifx_Strict_32Bit reserved_11 : 21;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits;

/** \\brief  FIFO0 channel 0 interrupt enable register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_EN_Bits
{
    Ifx_Strict_32Bit FIFO_EMPTY_IRQ_EN : 1;   /**< \brief [0:0] interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_FULL_IRQ_EN : 1;    /**< \brief [1:1] Interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_LWM_IRQ_EN : 1;     /**< \brief [2:2] Interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_UWM_IRQ_EN : 1;     /**< \brief [3:3] Interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_EN_Bits;

/** \\brief  FIFO0 channel 0 force interrupt register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_FIFO_EMPTY : 1;      /**< \brief [0:0] Force interrupt of FIFO empty status (rw) */
    Ifx_Strict_32Bit TRG_FIFO_FULL : 1;       /**< \brief [1:1] Force interrupt of FIFO full status (rw) */
    Ifx_Strict_32Bit TRG_FIFO_LWM : 1;        /**< \brief [2:2] Force interrupt of lower watermark (rw) */
    Ifx_Strict_32Bit TRG_FIFO_UWM : 1;        /**< \brief [3:3] Force interrupt of upper watermark (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits;

/** \\brief  FIFO0 channel 0 interrupt mode control register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit DMA_HYSTERESIS : 1;      /**< \brief [2:2] Enable DMA hysteresis mode. (rw) */
    Ifx_Strict_32Bit DMA_HYST_DIR : 1;        /**< \brief [3:3] DMA direction in hysteresis mode (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_MODE_Bits;

/** \\brief  FIFO0 channel 0 interrupt notification register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit FIFO_EMPTY : 1;          /**< \brief [0:0] FIFO is empty (rw) */
    Ifx_Strict_32Bit FIFO_FULL : 1;           /**< \brief [1:1] FIFO is full (rw) */
    Ifx_Strict_32Bit FIFO_LWM : 1;            /**< \brief [2:2] FIFO Lower watermark was under-run (rw) */
    Ifx_Strict_32Bit FIFO_UWM : 1;            /**< \brief [3:3] FIFO Upper watermark was over-run (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits;

/** \\brief  FIFO0 channel 0 lower watermark register */
typedef struct _Ifx_GTM_FIFO_CH_LOWER_WM_Bits
{
    Ifx_Strict_32Bit ADDR : 10;               /**< \brief [9:0] Lower watermark address (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_LOWER_WM_Bits;

/** \\brief  FIFO0 channel 0 read pointer register */
typedef struct _Ifx_GTM_FIFO_CH_RD_PTR_Bits
{
    Ifx_Strict_32Bit ADDR : 10;               /**< \brief [9:0] Position of the read pointer (r) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_RD_PTR_Bits;

/** \\brief  FIFO0 channel 0 start address register */
typedef struct _Ifx_GTM_FIFO_CH_START_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR : 10;               /**< \brief [9:0] Start address for FIFO channel z, (z:0...7) (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_START_ADDR_Bits;

/** \\brief  FIFO0 channel 0 status register */
typedef struct _Ifx_GTM_FIFO_CH_STATUS_Bits
{
    Ifx_Strict_32Bit EMPTY : 1;               /**< \brief [0:0] FIFO is empty (r) */
    Ifx_Strict_32Bit FULL : 1;                /**< \brief [1:1] FIFO is full (r) */
    Ifx_Strict_32Bit LOW_WM : 1;              /**< \brief [2:2] Lower watermark reached (r) */
    Ifx_Strict_32Bit UP_WM : 1;               /**< \brief [3:3] Upper watermark reached (r) */
    Ifx_Strict_32Bit Reserved : 28;           /**< \brief [31:4] Reserved: reserved (r) */
} Ifx_GTM_FIFO_CH_STATUS_Bits;

