Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group ATOM 1 for Channel Interrupt information of
 * ATOMm */
typedef struct _Ifx_GTM_ICM_IRQG_ATOM_1_CI_Bits
{
    Ifx_Strict_32Bit ATOM_M0_CH0_IRQ : 1;     /**< \brief [0:0] ATOM0 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH1_IRQ : 1;     /**< \brief [1:1] ATOM0 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH2_IRQ : 1;     /**< \brief [2:2] ATOM0 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH3_IRQ : 1;     /**< \brief [3:3] ATOM0 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH4_IRQ : 1;     /**< \brief [4:4] ATOM0 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH5_IRQ : 1;     /**< \brief [5:5] ATOM0 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH6_IRQ : 1;     /**< \brief [6:6] ATOM0 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH7_IRQ : 1;     /**< \brief [7:7] ATOM0 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH0_IRQ : 1;     /**< \brief [8:8] ATOM1 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH1_IRQ : 1;     /**< \brief [9:9] ATOM1 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH2_IRQ : 1;     /**< \brief [10:10] ATOM1 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH3_IRQ : 1;     /**< \brief [11:11] ATOM1 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH4_IRQ : 1;     /**< \brief [12:12] ATOM1 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH5_IRQ : 1;     /**< \brief [13:13] ATOM1 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH6_IRQ : 1;     /**< \brief [14:14] ATOM1 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH7_IRQ : 1;     /**< \brief [15:15] ATOM1 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH0_IRQ : 1;     /**< \brief [16:16] ATOM2 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH1_IRQ : 1;     /**< \brief [17:17] ATOM2 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH2_IRQ : 1;     /**< \brief [18:18] ATOM2 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH3_IRQ : 1;     /**< \brief [19:19] ATOM2 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH4_IRQ : 1;     /**< \brief [20:20] ATOM2 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH5_IRQ : 1;     /**< \brief [21:21] ATOM2 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH6_IRQ : 1;     /**< \brief [22:22] ATOM2 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH7_IRQ : 1;     /**< \brief [23:23] ATOM2 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH0_IRQ : 1;     /**< \brief [24:24] ATOM3 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH1_IRQ : 1;     /**< \brief [25:25] ATOM3 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH2_IRQ : 1;     /**< \brief [26:26] ATOM3 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH3_IRQ : 1;     /**< \brief [27:27] ATOM3 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH4_IRQ : 1;     /**< \brief [28:28] ATOM3 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH5_IRQ : 1;     /**< \brief [29:29] ATOM3 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH6_IRQ : 1;     /**< \brief [30:30] ATOM3 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH7_IRQ : 1;     /**< \brief [31:31] ATOM3 channel 7 interrupt (m=4*k+0) (r) */
} Ifx_GTM_ICM_IRQG_ATOM_1_CI_Bits;

/** \\brief  ICM Interrupt group ATOM 2 for Channel Interrupt information of
 * ATOMm */
typedef struct _Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits
{
    Ifx_Strict_32Bit ATOM_M0_CH0_IRQ : 1;     /**< \brief [0:0] ATOM0 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH1_IRQ : 1;     /**< \brief [1:1] ATOM0 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH2_IRQ : 1;     /**< \brief [2:2] ATOM0 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH3_IRQ : 1;     /**< \brief [3:3] ATOM0 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH4_IRQ : 1;     /**< \brief [4:4] ATOM0 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH5_IRQ : 1;     /**< \brief [5:5] ATOM0 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH6_IRQ : 1;     /**< \brief [6:6] ATOM0 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M0_CH7_IRQ : 1;     /**< \brief [7:7] ATOM0 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH0_IRQ : 1;     /**< \brief [8:8] ATOM1 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH1_IRQ : 1;     /**< \brief [9:9] ATOM1 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH2_IRQ : 1;     /**< \brief [10:10] ATOM1 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH3_IRQ : 1;     /**< \brief [11:11] ATOM1 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH4_IRQ : 1;     /**< \brief [12:12] ATOM1 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH5_IRQ : 1;     /**< \brief [13:13] ATOM1 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH6_IRQ : 1;     /**< \brief [14:14] ATOM1 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M1_CH7_IRQ : 1;     /**< \brief [15:15] ATOM1 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH0_IRQ : 1;     /**< \brief [16:16] ATOM2 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH1_IRQ : 1;     /**< \brief [17:17] ATOM2 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH2_IRQ : 1;     /**< \brief [18:18] ATOM2 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH3_IRQ : 1;     /**< \brief [19:19] ATOM2 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH4_IRQ : 1;     /**< \brief [20:20] ATOM2 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH5_IRQ : 1;     /**< \brief [21:21] ATOM2 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH6_IRQ : 1;     /**< \brief [22:22] ATOM2 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M2_CH7_IRQ : 1;     /**< \brief [23:23] ATOM2 channel 7 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH0_IRQ : 1;     /**< \brief [24:24] ATOM3 channel 0 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH1_IRQ : 1;     /**< \brief [25:25] ATOM3 channel 1 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH2_IRQ : 1;     /**< \brief [26:26] ATOM3 channel 2 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH3_IRQ : 1;     /**< \brief [27:27] ATOM3 channel 3 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH4_IRQ : 1;     /**< \brief [28:28] ATOM3 channel 4 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH5_IRQ : 1;     /**< \brief [29:29] ATOM3 channel 5 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH6_IRQ : 1;     /**< \brief [30:30] ATOM3 channel 6 interrupt (m=4*k+0) (r) */
    Ifx_Strict_32Bit ATOM_M3_CH7_IRQ : 1;     /**< \brief [31:31] ATOM3 channel 7 interrupt (m=4*k+0) (r) */
} Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits;

/** \\brief  ICM Interrupt group register 0 for channel error interrupt
 * information */
typedef struct _Ifx_GTM_ICM_IRQG_CEI0_Bits
{
    Ifx_Strict_32Bit FIFO0_CH0_EIRQ : 1;      /**< \brief [0:0] FIFO0 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH1_EIRQ : 1;      /**< \brief [1:1] FIFO0 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH2_EIRQ : 1;      /**< \brief [2:2] FIFO0 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH3_EIRQ : 1;      /**< \brief [3:3] FIFO0 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH4_EIRQ : 1;      /**< \brief [4:4] FIFO0 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH5_EIRQ : 1;      /**< \brief [5:5] FIFO0 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH6_EIRQ : 1;      /**< \brief [6:6] FIFO0 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_CH7_EIRQ : 1;      /**< \brief [7:7] FIFO0 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH0_EIRQ : 1;      /**< \brief [8:8] FIFO1 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH1_EIRQ : 1;      /**< \brief [9:9] FIFO1 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH2_EIRQ : 1;      /**< \brief [10:10] FIFO1 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH3_EIRQ : 1;      /**< \brief [11:11] FIFO1 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH4_EIRQ : 1;      /**< \brief [12:12] FIFO1 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH5_EIRQ : 1;      /**< \brief [13:13] FIFO1 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH6_EIRQ : 1;      /**< \brief [14:14] FIFO1 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_CH7_EIRQ : 1;      /**< \brief [15:15] FIFO1 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH0_EIRQ : 1;      /**< \brief [16:16] FIFO2 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH1_EIRQ : 1;      /**< \brief [17:17] FIFO2 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH2_EIRQ : 1;      /**< \brief [18:18] FIFO2 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH3_EIRQ : 1;      /**< \brief [19:19] FIFO2 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH4_EIRQ : 1;      /**< \brief [20:20] FIFO2 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH5_EIRQ : 1;      /**< \brief [21:21] FIFO2 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH6_EIRQ : 1;      /**< \brief [22:22] FIFO2 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit FIFO2_CH7_EIRQ : 1;      /**< \brief [23:23] FIFO2 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CEI0_Bits;

/** \\brief  ICM Interrupt group register 1 for channel error interrupt
 * information */
typedef struct _Ifx_GTM_ICM_IRQG_CEI1_Bits
{
    Ifx_Strict_32Bit TIM0_CH0_EIRQ : 1;       /**< \brief [0:0] TIM0 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH1_EIRQ : 1;       /**< \brief [1:1] TIM0 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH2_EIRQ : 1;       /**< \brief [2:2] TIM0 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH3_EIRQ : 1;       /**< \brief [3:3] TIM0 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH4_EIRQ : 1;       /**< \brief [4:4] TIM0 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH5_EIRQ : 1;       /**< \brief [5:5] TIM0 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH6_EIRQ : 1;       /**< \brief [6:6] TIM0 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_CH7_EIRQ : 1;       /**< \brief [7:7] TIM0 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH0_EIRQ : 1;       /**< \brief [8:8] TIM1 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH1_EIRQ : 1;       /**< \brief [9:9] TIM1 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH2_EIRQ : 1;       /**< \brief [10:10] TIM1 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH3_EIRQ : 1;       /**< \brief [11:11] TIM1 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH4_EIRQ : 1;       /**< \brief [12:12] TIM1 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH5_EIRQ : 1;       /**< \brief [13:13] TIM1 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH6_EIRQ : 1;       /**< \brief [14:14] TIM1 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_CH7_EIRQ : 1;       /**< \brief [15:15] TIM1 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH0_EIRQ : 1;       /**< \brief [16:16] TIM2 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH1_EIRQ : 1;       /**< \brief [17:17] TIM2 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH2_EIRQ : 1;       /**< \brief [18:18] TIM2 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH3_EIRQ : 1;       /**< \brief [19:19] TIM2 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH4_EIRQ : 1;       /**< \brief [20:20] TIM2 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH5_EIRQ : 1;       /**< \brief [21:21] TIM2 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH6_EIRQ : 1;       /**< \brief [22:22] TIM2 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_CH7_EIRQ : 1;       /**< \brief [23:23] TIM2 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH0_EIRQ : 1;       /**< \brief [24:24] TIM3 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH1_EIRQ : 1;       /**< \brief [25:25] TIM3 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH2_EIRQ : 1;       /**< \brief [26:26] TIM3 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH3_EIRQ : 1;       /**< \brief [27:27] TIM3 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH4_EIRQ : 1;       /**< \brief [28:28] TIM3 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH5_EIRQ : 1;       /**< \brief [29:29] TIM3 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH6_EIRQ : 1;       /**< \brief [30:30] TIM3 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_CH7_EIRQ : 1;       /**< \brief [31:31] TIM3 channel 7 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_CEI1_Bits;

/** \\brief  ICM Interrupt group register 2 for channel error interrupt
 * information */
typedef struct _Ifx_GTM_ICM_IRQG_CEI2_Bits
{
    Ifx_Strict_32Bit TIM4_CH0_EIRQ : 1;       /**< \brief [0:0] TIM4 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH1_EIRQ : 1;       /**< \brief [1:1] TIM4 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH2_EIRQ : 1;       /**< \brief [2:2] TIM4 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH3_EIRQ : 1;       /**< \brief [3:3] TIM4 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH4_EIRQ : 1;       /**< \brief [4:4] TIM4 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH5_EIRQ : 1;       /**< \brief [5:5] TIM4 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH6_EIRQ : 1;       /**< \brief [6:6] TIM4 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_CH7_EIRQ : 1;       /**< \brief [7:7] TIM4 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH0_EIRQ : 1;       /**< \brief [8:8] TIM5 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH1_EIRQ : 1;       /**< \brief [9:9] TIM5 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH2_EIRQ : 1;       /**< \brief [10:10] TIM5 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH3_EIRQ : 1;       /**< \brief [11:11] TIM5 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH4_EIRQ : 1;       /**< \brief [12:12] TIM5 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH5_EIRQ : 1;       /**< \brief [13:13] TIM5 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH6_EIRQ : 1;       /**< \brief [14:14] TIM5 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_CH7_EIRQ : 1;       /**< \brief [15:15] TIM5 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH0_EIRQ : 1;       /**< \brief [16:16] TIM6 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH1_EIRQ : 1;       /**< \brief [17:17] TIM6 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH2_EIRQ : 1;       /**< \brief [18:18] TIM6 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH3_EIRQ : 1;       /**< \brief [19:19] TIM6 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH4_EIRQ : 1;       /**< \brief [20:20] TIM6 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH5_EIRQ : 1;       /**< \brief [21:21] TIM6 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH6_EIRQ : 1;       /**< \brief [22:22] TIM6 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_CH7_EIRQ : 1;       /**< \brief [23:23] TIM6 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH0_EIRQ : 1;       /**< \brief [24:24] TIM7 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH1_EIRQ : 1;       /**< \brief [25:25] TIM7 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH2_EIRQ : 1;       /**< \brief [26:26] TIM7 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH3_EIRQ : 1;       /**< \brief [27:27] TIM7 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH4_EIRQ : 1;       /**< \brief [28:28] TIM7 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH5_EIRQ : 1;       /**< \brief [29:29] TIM7 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH6_EIRQ : 1;       /**< \brief [30:30] TIM7 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_CH7_EIRQ : 1;       /**< \brief [31:31] TIM7 channel 7 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_CEI2_Bits;

/** \\brief  ICM Interrupt group register 3 for channel error interrupt
 * information */
typedef struct _Ifx_GTM_ICM_IRQG_CEI3_Bits
{
    Ifx_Strict_32Bit MCS0_CH0_EIRQ : 1;       /**< \brief [0:0] MCS0 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH1_EIRQ : 1;       /**< \brief [1:1] MCS0 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH2_EIRQ : 1;       /**< \brief [2:2] MCS0 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH3_EIRQ : 1;       /**< \brief [3:3] MCS0 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH4_EIRQ : 1;       /**< \brief [4:4] MCS0 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH5_EIRQ : 1;       /**< \brief [5:5] MCS0 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH6_EIRQ : 1;       /**< \brief [6:6] MCS0 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_CH7_EIRQ : 1;       /**< \brief [7:7] MCS0 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH0_EIRQ : 1;       /**< \brief [8:8] MCS1 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH1_EIRQ : 1;       /**< \brief [9:9] MCS1 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH2_EIRQ : 1;       /**< \brief [10:10] MCS1 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH3_EIRQ : 1;       /**< \brief [11:11] MCS1 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH4_EIRQ : 1;       /**< \brief [12:12] MCS1 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH5_EIRQ : 1;       /**< \brief [13:13] MCS1 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH6_EIRQ : 1;       /**< \brief [14:14] MCS1 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_CH7_EIRQ : 1;       /**< \brief [15:15] MCS1 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH0_EIRQ : 1;       /**< \brief [16:16] MCS2 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH1_EIRQ : 1;       /**< \brief [17:17] MCS2 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH2_EIRQ : 1;       /**< \brief [18:18] MCS2 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH3_EIRQ : 1;       /**< \brief [19:19] MCS2 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH4_EIRQ : 1;       /**< \brief [20:20] MCS2 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH5_EIRQ : 1;       /**< \brief [21:21] MCS2 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH6_EIRQ : 1;       /**< \brief [22:22] MCS2 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_CH7_EIRQ : 1;       /**< \brief [23:23] MCS2 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH0_EIRQ : 1;       /**< \brief [24:24] MCS3 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH1_EIRQ : 1;       /**< \brief [25:25] MCS3 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH2_EIRQ : 1;       /**< \brief [26:26] MCS3 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH3_EIRQ : 1;       /**< \brief [27:27] MCS3 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH4_EIRQ : 1;       /**< \brief [28:28] MCS3 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH5_EIRQ : 1;       /**< \brief [29:29] MCS3 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH6_EIRQ : 1;       /**< \brief [30:30] MCS3 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_CH7_EIRQ : 1;       /**< \brief [31:31] MCS3 channel 7 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_CEI3_Bits;

