Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group register 4 for channel error interrupt
 * information */
typedef struct _Ifx_GTM_ICM_IRQG_CEI4_Bits
{
    Ifx_Strict_32Bit MCS4_CH0_EIRQ : 1;       /**< \brief [0:0] MCS4 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH1_EIRQ : 1;       /**< \brief [1:1] MCS4 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH2_EIRQ : 1;       /**< \brief [2:2] MCS4 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH3_EIRQ : 1;       /**< \brief [3:3] MCS4 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH4_EIRQ : 1;       /**< \brief [4:4] MCS4 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH5_EIRQ : 1;       /**< \brief [5:5] MCS4 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH6_EIRQ : 1;       /**< \brief [6:6] MCS4 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_CH7_EIRQ : 1;       /**< \brief [7:7] MCS4 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH0_EIRQ : 1;       /**< \brief [8:8] MCS5 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH1_EIRQ : 1;       /**< \brief [9:9] MCS5 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH2_EIRQ : 1;       /**< \brief [10:10] MCS5 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH3_EIRQ : 1;       /**< \brief [11:11] MCS5 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH4_EIRQ : 1;       /**< \brief [12:12] MCS5 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH5_EIRQ : 1;       /**< \brief [13:13] MCS5 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH6_EIRQ : 1;       /**< \brief [14:14] MCS5 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_CH7_EIRQ : 1;       /**< \brief [15:15] MCS5 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH0_EIRQ : 1;       /**< \brief [16:16] MCS6 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH1_EIRQ : 1;       /**< \brief [17:17] MCS6 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH2_EIRQ : 1;       /**< \brief [18:18] MCS6 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH3_EIRQ : 1;       /**< \brief [19:19] MCS6 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH4_EIRQ : 1;       /**< \brief [20:20] MCS6 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH5_EIRQ : 1;       /**< \brief [21:21] MCS6 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH6_EIRQ : 1;       /**< \brief [22:22] MCS6 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_CH7_EIRQ : 1;       /**< \brief [23:23] MCS6 channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH0_EIRQ : 1;       /**< \brief [24:24] MCS7 channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH1_EIRQ : 1;       /**< \brief [25:25] MCS7 channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH2_EIRQ : 1;       /**< \brief [26:26] MCS7 channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH3_EIRQ : 1;       /**< \brief [27:27] MCS7 channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH4_EIRQ : 1;       /**< \brief [28:28] MCS7 channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH5_EIRQ : 1;       /**< \brief [29:29] MCS7 channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH6_EIRQ : 1;       /**< \brief [30:30] MCS7 channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_CH7_EIRQ : 1;       /**< \brief [31:31] MCS7 channel 7 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_CEI4_Bits;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef struct _Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits
{
    Ifx_Strict_32Bit TIM_M0_EIRQ : 1;         /**< \brief [0:0] Error interrupt TIMm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit MCS_M0_EIRQ : 1;         /**< \brief [1:1] Error interrupt MCSm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit SPE_M0_EIRQ : 1;         /**< \brief [2:2] Error interrupt SPEm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit FIFO_M0_EIRQ : 1;        /**< \brief [3:3] Error interrupt FIFOm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit reserved_4 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M1_EIRQ : 1;         /**< \brief [8:8] Error interrupt TIMm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit MCS_M1_EIRQ : 1;         /**< \brief [9:9] Error interrupt MCSm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit SPE_M1_EIRQ : 1;         /**< \brief [10:10] Error interrupt SPEm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit FIFO_M1_EIRQ : 1;        /**< \brief [11:11] Error interrupt FIFOm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M2_EIRQ : 1;         /**< \brief [16:16] Error interrupt TIMm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit MCS_M2_EIRQ : 1;         /**< \brief [17:17] Error interrupt MCSm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit SPE_M2_EIRQ : 1;         /**< \brief [18:18] Error interrupt SPEm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit FIFO_M2_EIRQ : 1;        /**< \brief [19:19] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M3_EIRQ : 1;         /**< \brief [24:24] Error interrupt TIMm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit MCS_M3_EIRQ : 1;         /**< \brief [25:25] Error interrupt MCSm_EIRQ (m=4*k+3 (r) */
    Ifx_Strict_32Bit SPE_M3_EIRQ : 1;         /**< \brief [26:26] Error interrupt SPEm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit FIFO_M3_EIRQ : 1;        /**< \brief [27:27] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef struct _Ifx_GTM_ICM_IRQG_CLS_1_MEI_Bits
{
    Ifx_Strict_32Bit TIM_M0_EIRQ : 1;         /**< \brief [0:0] Error interrupt TIMm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit MCS_M0_EIRQ : 1;         /**< \brief [1:1] Error interrupt MCSm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit SPE_M0_EIRQ : 1;         /**< \brief [2:2] Error interrupt SPEm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit FIFO_M0_EIRQ : 1;        /**< \brief [3:3] Error interrupt FIFOm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit reserved_4 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M1_EIRQ : 1;         /**< \brief [8:8] Error interrupt TIMm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit MCS_M1_EIRQ : 1;         /**< \brief [9:9] Error interrupt MCSm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit SPE_M1_EIRQ : 1;         /**< \brief [10:10] Error interrupt SPEm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit FIFO_M1_EIRQ : 1;        /**< \brief [11:11] Error interrupt FIFOm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M2_EIRQ : 1;         /**< \brief [16:16] Error interrupt TIMm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit MCS_M2_EIRQ : 1;         /**< \brief [17:17] Error interrupt MCSm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit SPE_M2_EIRQ : 1;         /**< \brief [18:18] Error interrupt SPEm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit FIFO_M2_EIRQ : 1;        /**< \brief [19:19] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M3_EIRQ : 1;         /**< \brief [24:24] Error interrupt TIMm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit MCS_M3_EIRQ : 1;         /**< \brief [25:25] Error interrupt MCSm_EIRQ (m=4*k+3 (r) */
    Ifx_Strict_32Bit SPE_M3_EIRQ : 1;         /**< \brief [26:26] Error interrupt SPEm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit FIFO_M3_EIRQ : 1;        /**< \brief [27:27] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CLS_1_MEI_Bits;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef struct _Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits
{
    Ifx_Strict_32Bit TIM_M0_EIRQ : 1;         /**< \brief [0:0] Error interrupt TIMm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit MCS_M0_EIRQ : 1;         /**< \brief [1:1] Error interrupt MCSm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit SPE_M0_EIRQ : 1;         /**< \brief [2:2] Error interrupt SPEm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit FIFO_M0_EIRQ : 1;        /**< \brief [3:3] Error interrupt FIFOm_EIRQ (m=4*k+0) (r) */
    Ifx_Strict_32Bit reserved_4 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M1_EIRQ : 1;         /**< \brief [8:8] Error interrupt TIMm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit MCS_M1_EIRQ : 1;         /**< \brief [9:9] Error interrupt MCSm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit SPE_M1_EIRQ : 1;         /**< \brief [10:10] Error interrupt SPEm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit FIFO_M1_EIRQ : 1;        /**< \brief [11:11] Error interrupt FIFOm_EIRQ (m=4*k+1) (r) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M2_EIRQ : 1;         /**< \brief [16:16] Error interrupt TIMm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit MCS_M2_EIRQ : 1;         /**< \brief [17:17] Error interrupt MCSm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit SPE_M2_EIRQ : 1;         /**< \brief [18:18] Error interrupt SPEm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit FIFO_M2_EIRQ : 1;        /**< \brief [19:19] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TIM_M3_EIRQ : 1;         /**< \brief [24:24] Error interrupt TIMm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit MCS_M3_EIRQ : 1;         /**< \brief [25:25] Error interrupt MCSm_EIRQ (m=4*k+3 (r) */
    Ifx_Strict_32Bit SPE_M3_EIRQ : 1;         /**< \brief [26:26] Error interrupt SPEm_EIRQ (m=4*k+3) (r) */
    Ifx_Strict_32Bit FIFO_M3_EIRQ : 1;        /**< \brief [27:27] Error interrupt FIFOm_EIRQ (m=4*k+2) (r) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits;

/** \\brief  ICM Interrupt group MCS 0 for Channel Error Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_EIRQ : 1;        /**< \brief [0:0] MCS channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH1_EIRQ : 1;        /**< \brief [1:1] MCS channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH2_EIRQ : 1;        /**< \brief [2:2] MCS channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH3_EIRQ : 1;        /**< \brief [3:3] MCS channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH4_EIRQ : 1;        /**< \brief [4:4] MCS channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH5_EIRQ : 1;        /**< \brief [5:5] MCS channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH6_EIRQ : 1;        /**< \brief [6:6] MCS channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH7_EIRQ : 1;        /**< \brief [7:7] MCS channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH8_EIRQ : 1;        /**< \brief [8:8] MCS channel 8 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH9_EIRQ : 1;        /**< \brief [9:9] MCS channel 9 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH10_EIRQ : 1;       /**< \brief [10:10] MCS channel 10 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH11_EIRQ : 1;       /**< \brief [11:11] MCS channel 11 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH12_EIRQ : 1;       /**< \brief [12:12] MCS channel 12 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH13_EIRQ : 1;       /**< \brief [13:13] MCS channel 13 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH14_EIRQ : 1;       /**< \brief [14:14] MCS channel 14 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH15_EIRQ : 1;       /**< \brief [15:15] MCS channel 15 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH16_EIRQ : 1;       /**< \brief [16:16] MCS channel 16 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH17_EIRQ : 1;       /**< \brief [17:17] MCS channel 17 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH18_EIRQ : 1;       /**< \brief [18:18] MCS channel 18 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH19_EIRQ : 1;       /**< \brief [19:19] MCS channel 19 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH20_EIRQ : 1;       /**< \brief [20:20] MCS channel 20 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH21_EIRQ : 1;       /**< \brief [21:21] MCS channel 21 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH22_EIRQ : 1;       /**< \brief [22:22] MCS channel 22 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH23_EIRQ : 1;       /**< \brief [23:23] MCS channel 23 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH24_EIRQ : 1;       /**< \brief [24:24] MCS channel 24 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH25_EIRQ : 1;       /**< \brief [25:25] MCS channel 25 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH26_EIRQ : 1;       /**< \brief [26:26] MCS channel 26 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH27_EIRQ : 1;       /**< \brief [27:27] MCS channel 27 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH28_EIRQ : 1;       /**< \brief [28:28] MCS channel 28 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH29_EIRQ : 1;       /**< \brief [29:29] MCS channel 29 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH30_EIRQ : 1;       /**< \brief [30:30] MCS channel 30 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH31_EIRQ : 1;       /**< \brief [31:31] MCS channel 31 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits;

