Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group MCS 5 for Channel Error Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS5_CEI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_EIRQ : 1;        /**< \brief [0:0] MCS channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH1_EIRQ : 1;        /**< \brief [1:1] MCS channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH2_EIRQ : 1;        /**< \brief [2:2] MCS channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH3_EIRQ : 1;        /**< \brief [3:3] MCS channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH4_EIRQ : 1;        /**< \brief [4:4] MCS channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH5_EIRQ : 1;        /**< \brief [5:5] MCS channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH6_EIRQ : 1;        /**< \brief [6:6] MCS channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH7_EIRQ : 1;        /**< \brief [7:7] MCS channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH8_EIRQ : 1;        /**< \brief [8:8] MCS channel 8 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH9_EIRQ : 1;        /**< \brief [9:9] MCS channel 9 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH10_EIRQ : 1;       /**< \brief [10:10] MCS channel 10 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH11_EIRQ : 1;       /**< \brief [11:11] MCS channel 11 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH12_EIRQ : 1;       /**< \brief [12:12] MCS channel 12 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH13_EIRQ : 1;       /**< \brief [13:13] MCS channel 13 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH14_EIRQ : 1;       /**< \brief [14:14] MCS channel 14 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH15_EIRQ : 1;       /**< \brief [15:15] MCS channel 15 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH16_EIRQ : 1;       /**< \brief [16:16] MCS channel 16 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH17_EIRQ : 1;       /**< \brief [17:17] MCS channel 17 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH18_EIRQ : 1;       /**< \brief [18:18] MCS channel 18 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH19_EIRQ : 1;       /**< \brief [19:19] MCS channel 19 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH20_EIRQ : 1;       /**< \brief [20:20] MCS channel 20 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH21_EIRQ : 1;       /**< \brief [21:21] MCS channel 21 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH22_EIRQ : 1;       /**< \brief [22:22] MCS channel 22 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH23_EIRQ : 1;       /**< \brief [23:23] MCS channel 23 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH24_EIRQ : 1;       /**< \brief [24:24] MCS channel 24 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH25_EIRQ : 1;       /**< \brief [25:25] MCS channel 25 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH26_EIRQ : 1;       /**< \brief [26:26] MCS channel 26 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH27_EIRQ : 1;       /**< \brief [27:27] MCS channel 27 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH28_EIRQ : 1;       /**< \brief [28:28] MCS channel 28 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH29_EIRQ : 1;       /**< \brief [29:29] MCS channel 29 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH30_EIRQ : 1;       /**< \brief [30:30] MCS channel 30 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH31_EIRQ : 1;       /**< \brief [31:31] MCS channel 31 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_MCS5_CEI_Bits;

/** \\brief  ICM Interrupt group MCS 5 for Channel Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS5_CI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_IRQ : 1;         /**< \brief [0:0] MCS channel 0 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH1_IRQ : 1;         /**< \brief [1:1] MCS channel 1 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH2_IRQ : 1;         /**< \brief [2:2] MCS channel 2 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH3_IRQ : 1;         /**< \brief [3:3] MCS channel 3 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH4_IRQ : 1;         /**< \brief [4:4] MCS channel 4 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH5_IRQ : 1;         /**< \brief [5:5] MCS channel 5 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH6_IRQ : 1;         /**< \brief [6:6] MCS channel 6 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH7_IRQ : 1;         /**< \brief [7:7] MCS channel 7 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH8_IRQ : 1;         /**< \brief [8:8] MCS channel 8 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH9_IRQ : 1;         /**< \brief [9:9] MCS channel 9 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH10_IRQ : 1;        /**< \brief [10:10] MCS channel 10 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH11_IRQ : 1;        /**< \brief [11:11] MCS channel 11 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH12_IRQ : 1;        /**< \brief [12:12] MCS channel 12 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH13_IRQ : 1;        /**< \brief [13:13] MCS channel 13 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH14_IRQ : 1;        /**< \brief [14:14] MCS channel 14 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH15_IRQ : 1;        /**< \brief [15:15] MCS channel 15 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH16_IRQ : 1;        /**< \brief [16:16] MCS channel 16 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH17_IRQ : 1;        /**< \brief [17:17] MCS channel 17 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH18_IRQ : 1;        /**< \brief [18:18] MCS channel 18 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH19_IRQ : 1;        /**< \brief [19:19] MCS channel 19 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH20_IRQ : 1;        /**< \brief [20:20] MCS channel 20 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH21_IRQ : 1;        /**< \brief [21:21] MCS channel 21 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH22_IRQ : 1;        /**< \brief [22:22] MCS channel 22 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH23_IRQ : 1;        /**< \brief [23:23] MCS channel 23 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH24_IRQ : 1;        /**< \brief [24:24] MCS channel 24 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH25_IRQ : 1;        /**< \brief [25:25] MCS channel 25 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH26_IRQ : 1;        /**< \brief [26:26] MCS channel 26 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH27_IRQ : 1;        /**< \brief [27:27] MCS channel 27 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH28_IRQ : 1;        /**< \brief [28:28] MCS channel 28 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH29_IRQ : 1;        /**< \brief [29:29] MCS channel 29 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH30_IRQ : 1;        /**< \brief [30:30] MCS channel 30 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH31_IRQ : 1;        /**< \brief [31:31] MCS channel 31 interrupt. (r) */
} Ifx_GTM_ICM_IRQG_MCS5_CI_Bits;

/** \\brief  ICM Interrupt group MCS 6 for Channel Error Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS6_CEI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_EIRQ : 1;        /**< \brief [0:0] MCS channel 0 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH1_EIRQ : 1;        /**< \brief [1:1] MCS channel 1 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH2_EIRQ : 1;        /**< \brief [2:2] MCS channel 2 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH3_EIRQ : 1;        /**< \brief [3:3] MCS channel 3 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH4_EIRQ : 1;        /**< \brief [4:4] MCS channel 4 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH5_EIRQ : 1;        /**< \brief [5:5] MCS channel 5 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH6_EIRQ : 1;        /**< \brief [6:6] MCS channel 6 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH7_EIRQ : 1;        /**< \brief [7:7] MCS channel 7 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH8_EIRQ : 1;        /**< \brief [8:8] MCS channel 8 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH9_EIRQ : 1;        /**< \brief [9:9] MCS channel 9 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH10_EIRQ : 1;       /**< \brief [10:10] MCS channel 10 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH11_EIRQ : 1;       /**< \brief [11:11] MCS channel 11 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH12_EIRQ : 1;       /**< \brief [12:12] MCS channel 12 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH13_EIRQ : 1;       /**< \brief [13:13] MCS channel 13 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH14_EIRQ : 1;       /**< \brief [14:14] MCS channel 14 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH15_EIRQ : 1;       /**< \brief [15:15] MCS channel 15 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH16_EIRQ : 1;       /**< \brief [16:16] MCS channel 16 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH17_EIRQ : 1;       /**< \brief [17:17] MCS channel 17 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH18_EIRQ : 1;       /**< \brief [18:18] MCS channel 18 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH19_EIRQ : 1;       /**< \brief [19:19] MCS channel 19 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH20_EIRQ : 1;       /**< \brief [20:20] MCS channel 20 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH21_EIRQ : 1;       /**< \brief [21:21] MCS channel 21 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH22_EIRQ : 1;       /**< \brief [22:22] MCS channel 22 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH23_EIRQ : 1;       /**< \brief [23:23] MCS channel 23 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH24_EIRQ : 1;       /**< \brief [24:24] MCS channel 24 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH25_EIRQ : 1;       /**< \brief [25:25] MCS channel 25 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH26_EIRQ : 1;       /**< \brief [26:26] MCS channel 26 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH27_EIRQ : 1;       /**< \brief [27:27] MCS channel 27 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH28_EIRQ : 1;       /**< \brief [28:28] MCS channel 28 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH29_EIRQ : 1;       /**< \brief [29:29] MCS channel 29 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH30_EIRQ : 1;       /**< \brief [30:30] MCS channel 30 error interrupt (r) */
    Ifx_Strict_32Bit MCS_CH31_EIRQ : 1;       /**< \brief [31:31] MCS channel 31 error interrupt (r) */
} Ifx_GTM_ICM_IRQG_MCS6_CEI_Bits;

/** \\brief  ICM Interrupt group MCS 6 for Channel Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS6_CI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_IRQ : 1;         /**< \brief [0:0] MCS channel 0 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH1_IRQ : 1;         /**< \brief [1:1] MCS channel 1 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH2_IRQ : 1;         /**< \brief [2:2] MCS channel 2 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH3_IRQ : 1;         /**< \brief [3:3] MCS channel 3 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH4_IRQ : 1;         /**< \brief [4:4] MCS channel 4 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH5_IRQ : 1;         /**< \brief [5:5] MCS channel 5 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH6_IRQ : 1;         /**< \brief [6:6] MCS channel 6 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH7_IRQ : 1;         /**< \brief [7:7] MCS channel 7 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH8_IRQ : 1;         /**< \brief [8:8] MCS channel 8 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH9_IRQ : 1;         /**< \brief [9:9] MCS channel 9 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH10_IRQ : 1;        /**< \brief [10:10] MCS channel 10 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH11_IRQ : 1;        /**< \brief [11:11] MCS channel 11 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH12_IRQ : 1;        /**< \brief [12:12] MCS channel 12 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH13_IRQ : 1;        /**< \brief [13:13] MCS channel 13 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH14_IRQ : 1;        /**< \brief [14:14] MCS channel 14 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH15_IRQ : 1;        /**< \brief [15:15] MCS channel 15 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH16_IRQ : 1;        /**< \brief [16:16] MCS channel 16 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH17_IRQ : 1;        /**< \brief [17:17] MCS channel 17 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH18_IRQ : 1;        /**< \brief [18:18] MCS channel 18 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH19_IRQ : 1;        /**< \brief [19:19] MCS channel 19 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH20_IRQ : 1;        /**< \brief [20:20] MCS channel 20 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH21_IRQ : 1;        /**< \brief [21:21] MCS channel 21 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH22_IRQ : 1;        /**< \brief [22:22] MCS channel 22 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH23_IRQ : 1;        /**< \brief [23:23] MCS channel 23 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH24_IRQ : 1;        /**< \brief [24:24] MCS channel 24 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH25_IRQ : 1;        /**< \brief [25:25] MCS channel 25 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH26_IRQ : 1;        /**< \brief [26:26] MCS channel 26 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH27_IRQ : 1;        /**< \brief [27:27] MCS channel 27 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH28_IRQ : 1;        /**< \brief [28:28] MCS channel 28 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH29_IRQ : 1;        /**< \brief [29:29] MCS channel 29 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH30_IRQ : 1;        /**< \brief [30:30] MCS channel 30 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH31_IRQ : 1;        /**< \brief [31:31] MCS channel 31 interrupt. (r) */
} Ifx_GTM_ICM_IRQG_MCS6_CI_Bits;

