Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group MCS 9 for Channel Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MCS9_CI_Bits
{
    Ifx_Strict_32Bit MCS_CH0_IRQ : 1;         /**< \brief [0:0] MCS channel 0 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH1_IRQ : 1;         /**< \brief [1:1] MCS channel 1 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH2_IRQ : 1;         /**< \brief [2:2] MCS channel 2 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH3_IRQ : 1;         /**< \brief [3:3] MCS channel 3 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH4_IRQ : 1;         /**< \brief [4:4] MCS channel 4 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH5_IRQ : 1;         /**< \brief [5:5] MCS channel 5 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH6_IRQ : 1;         /**< \brief [6:6] MCS channel 6 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH7_IRQ : 1;         /**< \brief [7:7] MCS channel 7 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH8_IRQ : 1;         /**< \brief [8:8] MCS channel 8 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH9_IRQ : 1;         /**< \brief [9:9] MCS channel 9 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH10_IRQ : 1;        /**< \brief [10:10] MCS channel 10 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH11_IRQ : 1;        /**< \brief [11:11] MCS channel 11 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH12_IRQ : 1;        /**< \brief [12:12] MCS channel 12 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH13_IRQ : 1;        /**< \brief [13:13] MCS channel 13 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH14_IRQ : 1;        /**< \brief [14:14] MCS channel 14 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH15_IRQ : 1;        /**< \brief [15:15] MCS channel 15 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH16_IRQ : 1;        /**< \brief [16:16] MCS channel 16 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH17_IRQ : 1;        /**< \brief [17:17] MCS channel 17 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH18_IRQ : 1;        /**< \brief [18:18] MCS channel 18 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH19_IRQ : 1;        /**< \brief [19:19] MCS channel 19 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH20_IRQ : 1;        /**< \brief [20:20] MCS channel 20 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH21_IRQ : 1;        /**< \brief [21:21] MCS channel 21 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH22_IRQ : 1;        /**< \brief [22:22] MCS channel 22 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH23_IRQ : 1;        /**< \brief [23:23] MCS channel 23 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH24_IRQ : 1;        /**< \brief [24:24] MCS channel 24 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH25_IRQ : 1;        /**< \brief [25:25] MCS channel 25 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH26_IRQ : 1;        /**< \brief [26:26] MCS channel 26 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH27_IRQ : 1;        /**< \brief [27:27] MCS channel 27 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH28_IRQ : 1;        /**< \brief [28:28] MCS channel 28 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH29_IRQ : 1;        /**< \brief [29:29] MCS channel 29 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH30_IRQ : 1;        /**< \brief [30:30] MCS channel 30 interrupt. (r) */
    Ifx_Strict_32Bit MCS_CH31_IRQ : 1;        /**< \brief [31:31] MCS channel 31 interrupt. (r) */
} Ifx_GTM_ICM_IRQG_MCS9_CI_Bits;

/** \\brief  ICM Interrupt group register for module error interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_MEI_Bits
{
    Ifx_Strict_32Bit GTM_EIRQ : 1;            /**< \brief [0:0] AEI Error interrupt request (r) */
    Ifx_Strict_32Bit BRC_EIRQ : 1;            /**< \brief [1:1] BRC error interrupt (r) */
    Ifx_Strict_32Bit FIFO0_EIRQ : 1;          /**< \brief [2:2] FIFO0 error interrupt (r) */
    Ifx_Strict_32Bit FIFO1_EIRQ : 1;          /**< \brief [3:3] FIFO1 error interrupt (r) */
    Ifx_Strict_32Bit TIM0_EIRQ : 1;           /**< \brief [4:4] TIM0 error interrupt (r) */
    Ifx_Strict_32Bit TIM1_EIRQ : 1;           /**< \brief [5:5] TIM1 error interrupt (r) */
    Ifx_Strict_32Bit TIM2_EIRQ : 1;           /**< \brief [6:6] TIM2 error interrupt (r) */
    Ifx_Strict_32Bit TIM3_EIRQ : 1;           /**< \brief [7:7] TIM3 error interrupt (r) */
    Ifx_Strict_32Bit TIM4_EIRQ : 1;           /**< \brief [8:8] TIM4 error interrupt (r) */
    Ifx_Strict_32Bit TIM5_EIRQ : 1;           /**< \brief [9:9] TIM5 error interrupt (r) */
    Ifx_Strict_32Bit TIM6_EIRQ : 1;           /**< \brief [10:10] TIM6 error interrupt (r) */
    Ifx_Strict_32Bit TIM7_EIRQ : 1;           /**< \brief [11:11] TIM7 error interrupt (r) */
    Ifx_Strict_32Bit MCS0_EIRQ : 1;           /**< \brief [12:12] MCS0 error interrupt (r) */
    Ifx_Strict_32Bit MCS1_EIRQ : 1;           /**< \brief [13:13] MCS1 error interrupt (r) */
    Ifx_Strict_32Bit MCS2_EIRQ : 1;           /**< \brief [14:14] MCS2 error interrupt (r) */
    Ifx_Strict_32Bit MCS3_EIRQ : 1;           /**< \brief [15:15] MCS3 error interrupt (r) */
    Ifx_Strict_32Bit MCS4_EIRQ : 1;           /**< \brief [16:16] MCS4 error interrupt (r) */
    Ifx_Strict_32Bit MCS5_EIRQ : 1;           /**< \brief [17:17] MCS5 error interrupt (r) */
    Ifx_Strict_32Bit MCS6_EIRQ : 1;           /**< \brief [18:18] MCS6 error interrupt (r) */
    Ifx_Strict_32Bit MCS7_EIRQ : 1;           /**< \brief [19:19] MCS7 error interrupt (r) */
    Ifx_Strict_32Bit SPE0_EIRQ : 1;           /**< \brief [20:20] SPE0 error interrupt (r) */
    Ifx_Strict_32Bit SPE1_EIRQ : 1;           /**< \brief [21:21] SPE1 error interrupt (r) */
    Ifx_Strict_32Bit SPE2_EIRQ : 1;           /**< \brief [22:22] SPE2 error interrupt (r) */
    Ifx_Strict_32Bit SPE3_EIRQ : 1;           /**< \brief [23:23] SPE3 error interrupt (r) */
    Ifx_Strict_32Bit CMP_EIRQ : 1;            /**< \brief [24:24] CMP error interrupt (r) */
    Ifx_Strict_32Bit DPLL_EIRQ : 1;           /**< \brief [25:25] DPLL error interrupt (r) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_MEI_Bits;

/** \\brief  ICM Interrupt group PSM 0 for Channel Error Interrupt information
 * of FIFO0, FIFO1, FIFO2 */
typedef struct _Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits
{
    Ifx_Strict_32Bit PSM_M0_CH0_EIRQ : 1;     /**< \brief [0:0] PSM0 channel 0 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH1_EIRQ : 1;     /**< \brief [1:1] PSM0 channel 1 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH2_EIRQ : 1;     /**< \brief [2:2] PSM0 channel 2 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH3_EIRQ : 1;     /**< \brief [3:3] PSM0 channel 3 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH4_EIRQ : 1;     /**< \brief [4:4] PSM0 channel 4 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH5_EIRQ : 1;     /**< \brief [5:5] PSM0 channel 5 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH6_EIRQ : 1;     /**< \brief [6:6] PSM0 channel 6 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M0_CH7_EIRQ : 1;     /**< \brief [7:7] PSM0 channel 7 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH0_EIRQ : 1;     /**< \brief [8:8] PSM1 channel 0 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH1_EIRQ : 1;     /**< \brief [9:9] PSM1 channel 1 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH2_EIRQ : 1;     /**< \brief [10:10] PSM1 channel 2 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH3_EIRQ : 1;     /**< \brief [11:11] PSM1 channel 3 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH4_EIRQ : 1;     /**< \brief [12:12] PSM1 channel 4 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH5_EIRQ : 1;     /**< \brief [13:13] PSM1 channel 5 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH6_EIRQ : 1;     /**< \brief [14:14] PSM1 channel 6 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M1_CH7_EIRQ : 1;     /**< \brief [15:15] PSM1 channel 7 error interrupt (m=4*0+0). (r) */
    Ifx_Strict_32Bit PSM_M3_CH0_EIRQ : 1;     /**< \brief [16:16] PSM2 channel 0 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH1_EIRQ : 1;     /**< \brief [17:17] PSM2 channel 1 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH2_EIRQ : 1;     /**< \brief [18:18] PSM2 channel 2 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH3_EIRQ : 1;     /**< \brief [19:19] PSM2 channel 3 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH4_EIRQ : 1;     /**< \brief [20:20] PSM2 channel 4 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH5_EIRQ : 1;     /**< \brief [21:21] PSM2 channel 5 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH6_EIRQ : 1;     /**< \brief [22:22] PSM2 channel 6 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M3_CH7_EIRQ : 1;     /**< \brief [23:23] PSM2 channel 7 error interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits;

/** \\brief  ICM Interrupt group PSM 0 for Channel Interrupt information of
 * FIFO0, FIFO1, FIFO2 */
typedef struct _Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits
{
    Ifx_Strict_32Bit PSM_M0_CH0_IRQ : 1;      /**< \brief [0:0] PSM0 channel 0 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH1_IRQ : 1;      /**< \brief [1:1] PSM0 channel 1 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH2_IRQ : 1;      /**< \brief [2:2] PSM0 channel 2 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH3_IRQ : 1;      /**< \brief [3:3] PSM0 channel 3 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH4_IRQ : 1;      /**< \brief [4:4] PSM0 channel 4 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH5_IRQ : 1;      /**< \brief [5:5] PSM0 channel 5 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH6_IRQ : 1;      /**< \brief [6:6] PSM0 channel 6 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M0_CH7_IRQ : 1;      /**< \brief [7:7] PSM0 channel 7 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH0_IRQ : 1;      /**< \brief [8:8] PSM1 channel 0 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH1_IRQ : 1;      /**< \brief [9:9] PSM1 channel 1 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH2_IRQ : 1;      /**< \brief [10:10] PSM1 channel 2 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH3_IRQ : 1;      /**< \brief [11:11] PSM1 channel 3 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH4_IRQ : 1;      /**< \brief [12:12] PSM1 channel 4 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH5_IRQ : 1;      /**< \brief [13:13] PSM1 channel 5 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH6_IRQ : 1;      /**< \brief [14:14] PSM1 channel 6 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M1_CH7_IRQ : 1;      /**< \brief [15:15] PSM1 channel 7 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH0_IRQ : 1;      /**< \brief [16:16] PSM2 channel 0 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH1_IRQ : 1;      /**< \brief [17:17] PSM2 channel 1 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH2_IRQ : 1;      /**< \brief [18:18] PSM2 channel 2 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH3_IRQ : 1;      /**< \brief [19:19] PSM2 channel 3 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH4_IRQ : 1;      /**< \brief [20:20] PSM2 channel 4 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH5_IRQ : 1;      /**< \brief [21:21] PSM2 channel 5 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH6_IRQ : 1;      /**< \brief [22:22] PSM2 channel 6 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit PSM_M2_CH7_IRQ : 1;      /**< \brief [23:23] PSM2 channel 7 shared interrupt (m=4*0+0) (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits;

/** \\brief  ICM Interrupt group SPE for module Error Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_SPE_CEI_Bits
{
    Ifx_Strict_32Bit SPE0_EIRQ : 1;           /**< \brief [0:0] SPE channel 0 error interrupt (r) */
    Ifx_Strict_32Bit SPE1_EIRQ : 1;           /**< \brief [1:1] SPE channel 1 error interrupt (r) */
    Ifx_Strict_32Bit SPE2_EIRQ : 1;           /**< \brief [2:2] SPE channel 2 error interrupt (r) */
    Ifx_Strict_32Bit SPE3_EIRQ : 1;           /**< \brief [3:3] SPE channel 3 error interrupt (r) */
    Ifx_Strict_32Bit SPE4_EIRQ : 1;           /**< \brief [4:4] SPE channel 4 error interrupt (r) */
    Ifx_Strict_32Bit SPE5_EIRQ : 1;           /**< \brief [5:5] SPE channel 5 error interrupt (r) */
    Ifx_Strict_32Bit reserved_6 : 26;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_SPE_CEI_Bits;

/** \\brief  ICM Interrupt group SPE for module Interrupt information */
typedef struct _Ifx_GTM_ICM_IRQG_SPE_CI_Bits
{
    Ifx_Strict_32Bit SPE0_IRQ : 1;            /**< \brief [0:0] SPE channel 0 interrupt (r) */
    Ifx_Strict_32Bit SPE1_IRQ : 1;            /**< \brief [1:1] SPE channel 1 interrupt (r) */
    Ifx_Strict_32Bit SPE2_IRQ : 1;            /**< \brief [2:2] SPE channel 2 interrupt (r) */
    Ifx_Strict_32Bit SPE3_IRQ : 1;            /**< \brief [3:3] SPE channel 3 interrupt (r) */
    Ifx_Strict_32Bit SPE4_IRQ : 1;            /**< \brief [4:4] SPE channel 4 interrupt (r) */
    Ifx_Strict_32Bit SPE5_IRQ : 1;            /**< \brief [5:5] SPE channel 5 interrupt (r) */
    Ifx_Strict_32Bit reserved_6 : 26;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_SPE_CI_Bits;

