Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group TOM 0 for Channel Interrupt information of TOMm */
typedef struct _Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits
{
    Ifx_Strict_32Bit TOM_M0_CH0_IRQ : 1;      /**< \brief [0:0] TOM0 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH1_IRQ : 1;      /**< \brief [1:1] TOM0 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH2_IRQ : 1;      /**< \brief [2:2] TOM0 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH3_IRQ : 1;      /**< \brief [3:3] TOM0 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH4_IRQ : 1;      /**< \brief [4:4] TOM0 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH5_IRQ : 1;      /**< \brief [5:5] TOM0 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH6_IRQ : 1;      /**< \brief [6:6] TOM0 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH7_IRQ : 1;      /**< \brief [7:7] TOM0 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH8_IRQ : 1;      /**< \brief [8:8] TOM0 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH9_IRQ : 1;      /**< \brief [9:9] TOM0 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH10_IRQ : 1;     /**< \brief [10:10] TOM0 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH11_IRQ : 1;     /**< \brief [11:11] TOM0 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH12_IRQ : 1;     /**< \brief [12:12] TOM0 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH13_IRQ : 1;     /**< \brief [13:13] TOM0 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH14_IRQ : 1;     /**< \brief [14:14] TOM0 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH15_IRQ : 1;     /**< \brief [15:15] TOM0 channel 15 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH0_IRQ : 1;      /**< \brief [16:16] TOM1 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH1_IRQ : 1;      /**< \brief [17:17] TOM1 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH2_IRQ : 1;      /**< \brief [18:18] TOM1 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH3_IRQ : 1;      /**< \brief [19:19] TOM1 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH4_IRQ : 1;      /**< \brief [20:20] TOM1 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH5_IRQ : 1;      /**< \brief [21:21] TOM1 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH6_IRQ : 1;      /**< \brief [22:22] TOM1 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH7_IRQ : 1;      /**< \brief [23:23] TOM1 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH8_IRQ : 1;      /**< \brief [24:24] TOM1 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH9_IRQ : 1;      /**< \brief [25:25] TOM1 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH10_IRQ : 1;     /**< \brief [26:26] TOM1 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH11_IRQ : 1;     /**< \brief [27:27] TOM1 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH12_IRQ : 1;     /**< \brief [28:28] TOM1 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH13_IRQ : 1;     /**< \brief [29:29] TOM1 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH14_IRQ : 1;     /**< \brief [30:30] TOM1 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH15_IRQ : 1;     /**< \brief [31:31] TOM1 channel 15 interrupt (m=2*k+0). (r) */
} Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits;

/** \\brief  ICM Interrupt group TOM 1 for Channel Interrupt information of TOMm */
typedef struct _Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits
{
    Ifx_Strict_32Bit TOM_M0_CH0_IRQ : 1;      /**< \brief [0:0] TOM0 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH1_IRQ : 1;      /**< \brief [1:1] TOM0 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH2_IRQ : 1;      /**< \brief [2:2] TOM0 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH3_IRQ : 1;      /**< \brief [3:3] TOM0 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH4_IRQ : 1;      /**< \brief [4:4] TOM0 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH5_IRQ : 1;      /**< \brief [5:5] TOM0 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH6_IRQ : 1;      /**< \brief [6:6] TOM0 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH7_IRQ : 1;      /**< \brief [7:7] TOM0 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH8_IRQ : 1;      /**< \brief [8:8] TOM0 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH9_IRQ : 1;      /**< \brief [9:9] TOM0 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH10_IRQ : 1;     /**< \brief [10:10] TOM0 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH11_IRQ : 1;     /**< \brief [11:11] TOM0 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH12_IRQ : 1;     /**< \brief [12:12] TOM0 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH13_IRQ : 1;     /**< \brief [13:13] TOM0 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH14_IRQ : 1;     /**< \brief [14:14] TOM0 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH15_IRQ : 1;     /**< \brief [15:15] TOM0 channel 15 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH0_IRQ : 1;      /**< \brief [16:16] TOM1 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH1_IRQ : 1;      /**< \brief [17:17] TOM1 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH2_IRQ : 1;      /**< \brief [18:18] TOM1 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH3_IRQ : 1;      /**< \brief [19:19] TOM1 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH4_IRQ : 1;      /**< \brief [20:20] TOM1 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH5_IRQ : 1;      /**< \brief [21:21] TOM1 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH6_IRQ : 1;      /**< \brief [22:22] TOM1 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH7_IRQ : 1;      /**< \brief [23:23] TOM1 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH8_IRQ : 1;      /**< \brief [24:24] TOM1 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH9_IRQ : 1;      /**< \brief [25:25] TOM1 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH10_IRQ : 1;     /**< \brief [26:26] TOM1 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH11_IRQ : 1;     /**< \brief [27:27] TOM1 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH12_IRQ : 1;     /**< \brief [28:28] TOM1 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH13_IRQ : 1;     /**< \brief [29:29] TOM1 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH14_IRQ : 1;     /**< \brief [30:30] TOM1 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH15_IRQ : 1;     /**< \brief [31:31] TOM1 channel 15 interrupt (m=2*k+0). (r) */
} Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits;

/** \\brief  ICM Interrupt group TOM 2 for Channel Interrupt information of TOMm */
typedef struct _Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits
{
    Ifx_Strict_32Bit TOM_M0_CH0_IRQ : 1;      /**< \brief [0:0] TOM0 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH1_IRQ : 1;      /**< \brief [1:1] TOM0 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH2_IRQ : 1;      /**< \brief [2:2] TOM0 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH3_IRQ : 1;      /**< \brief [3:3] TOM0 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH4_IRQ : 1;      /**< \brief [4:4] TOM0 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH5_IRQ : 1;      /**< \brief [5:5] TOM0 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH6_IRQ : 1;      /**< \brief [6:6] TOM0 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH7_IRQ : 1;      /**< \brief [7:7] TOM0 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH8_IRQ : 1;      /**< \brief [8:8] TOM0 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH9_IRQ : 1;      /**< \brief [9:9] TOM0 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH10_IRQ : 1;     /**< \brief [10:10] TOM0 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH11_IRQ : 1;     /**< \brief [11:11] TOM0 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH12_IRQ : 1;     /**< \brief [12:12] TOM0 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH13_IRQ : 1;     /**< \brief [13:13] TOM0 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH14_IRQ : 1;     /**< \brief [14:14] TOM0 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M0_CH15_IRQ : 1;     /**< \brief [15:15] TOM0 channel 15 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH0_IRQ : 1;      /**< \brief [16:16] TOM1 channel 0 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH1_IRQ : 1;      /**< \brief [17:17] TOM1 channel 1 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH2_IRQ : 1;      /**< \brief [18:18] TOM1 channel 2 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH3_IRQ : 1;      /**< \brief [19:19] TOM1 channel 3 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH4_IRQ : 1;      /**< \brief [20:20] TOM1 channel 4 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH5_IRQ : 1;      /**< \brief [21:21] TOM1 channel 5 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH6_IRQ : 1;      /**< \brief [22:22] TOM1 channel 6 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH7_IRQ : 1;      /**< \brief [23:23] TOM1 channel 7 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH8_IRQ : 1;      /**< \brief [24:24] TOM1 channel 8 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH9_IRQ : 1;      /**< \brief [25:25] TOM1 channel 9 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH10_IRQ : 1;     /**< \brief [26:26] TOM1 channel 10 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH11_IRQ : 1;     /**< \brief [27:27] TOM1 channel 11 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH12_IRQ : 1;     /**< \brief [28:28] TOM1 channel 12 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH13_IRQ : 1;     /**< \brief [29:29] TOM1 channel 13 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH14_IRQ : 1;     /**< \brief [30:30] TOM1 channel 14 interrupt (m=2*k+0). (r) */
    Ifx_Strict_32Bit TOM_M1_CH15_IRQ : 1;     /**< \brief [31:31] TOM1 channel 15 interrupt (m=2*k+0). (r) */
} Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits;

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_GTM_INOUTSEL_ACCEN0_Bits
{
    Ifx_Strict_32Bit EN0 : 1;                 /**< \brief [0:0] Access E0able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN1 : 1;                 /**< \brief [1:1] Access E1able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN2 : 1;                 /**< \brief [2:2] Access E2able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN3 : 1;                 /**< \brief [3:3] Access E3able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN4 : 1;                 /**< \brief [4:4] Access E4able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN5 : 1;                 /**< \brief [5:5] Access E5able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN6 : 1;                 /**< \brief [6:6] Access E6able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN7 : 1;                 /**< \brief [7:7] Access E7able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN8 : 1;                 /**< \brief [8:8] Access E8able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN9 : 1;                 /**< \brief [9:9] Access E9able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN10 : 1;                /**< \brief [10:10] Access E10able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN11 : 1;                /**< \brief [11:11] Access E11able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN12 : 1;                /**< \brief [12:12] Access E12able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN13 : 1;                /**< \brief [13:13] Access E13able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN14 : 1;                /**< \brief [14:14] Access E14able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN15 : 1;                /**< \brief [15:15] Access E15able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN16 : 1;                /**< \brief [16:16] Access E16able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN17 : 1;                /**< \brief [17:17] Access E17able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN18 : 1;                /**< \brief [18:18] Access E18able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN19 : 1;                /**< \brief [19:19] Access E19able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN20 : 1;                /**< \brief [20:20] Access E20able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN21 : 1;                /**< \brief [21:21] Access E21able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN22 : 1;                /**< \brief [22:22] Access E22able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN23 : 1;                /**< \brief [23:23] Access E23able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN24 : 1;                /**< \brief [24:24] Access E24able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN25 : 1;                /**< \brief [25:25] Access E25able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN26 : 1;                /**< \brief [26:26] Access E26able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN27 : 1;                /**< \brief [27:27] Access E27able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN28 : 1;                /**< \brief [28:28] Access E28able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN29 : 1;                /**< \brief [29:29] Access E29able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN30 : 1;                /**< \brief [30:30] Access E30able for Master TAG ID n (rw) */
    Ifx_Strict_32Bit EN31 : 1;                /**< \brief [31:31] Access E31able for Master TAG ID n (rw) */
} Ifx_GTM_INOUTSEL_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_GTM_INOUTSEL_ACCEN1_Bits
{
    Ifx_Strict_32Bit reserved_0 : 32;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ACCEN1_Bits;

/** \\brief  ADC Trigger 0 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for ADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for ADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for ADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for ADC7 GTM connection (rw) */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits;

/** \\brief  ADC Trigger 0 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for ADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for ADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for ADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for ADC7 GTM connection (rw) */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits;

/** \\brief  ADC Trigger 2 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for ADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for ADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for ADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for ADC7 GTM connection (rw) */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits;

/** \\brief  ADC Trigger 3Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for ADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for ADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for ADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for ADC7 GTM connection (rw) */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for ADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for ADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for ADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for ADC3 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits;

/** \\brief  CAN Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for (TT)CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for (TT)CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for CAN GTM connection (rw) */
} Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN0_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN0_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN1_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN1_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN2_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN2_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN3_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN3_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN4_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN4_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN5_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN5_Bits;

