Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN6_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN6_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN7_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN7_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN8_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN8_Bits;

/** \\brief  Data Input n Register */
typedef struct _Ifx_GTM_INOUTSEL_DATA_IN9_Bits
{
    Ifx_Strict_32Bit DATA : 32;               /**< \brief [31:0] Data (rw) */
} Ifx_GTM_INOUTSEL_DATA_IN9_Bits;

/** \\brief  DSADC Input Select Register */
typedef struct _Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits
{
    Ifx_Strict_32Bit INSEL0 : 4;              /**< \brief [3:0] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL1 : 4;              /**< \brief [7:4] In Selection for EDSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL2 : 4;              /**< \brief [11:8] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL3 : 4;              /**< \brief [15:12] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL4 : 4;              /**< \brief [19:16] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL5 : 4;              /**< \brief [23:20] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL6 : 4;              /**< \brief [27:24] In Selection for DSADCn GTM connection (rw) */
    Ifx_Strict_32Bit INSEL7 : 4;              /**< \brief [31:28] In Selection for DSADCn GTM connection (rw) */
} Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits;

/** \\brief  DSADC Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for DSADC0 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for DSADC1 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for DSADC2 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for DSADC3 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for DSADC4 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for DSADC5 GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for DSADC6 GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for DSADC7 GTM connection (rw) */
} Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits;

/** \\brief  DSADC Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits
{
    Ifx_Strict_32Bit SEL8 : 4;                /**< \brief [3:0] Output Selection for DSADC8 GTM connection (rw) */
    Ifx_Strict_32Bit SEL9 : 4;                /**< \brief [7:4] Output Selection for DSADC9 GTM connection (rw) */
    Ifx_Strict_32Bit SEL10 : 4;               /**< \brief [11:8] Output Selection for DSADC10 GTM connection (rw) */
    Ifx_Strict_32Bit SEL11 : 4;               /**< \brief [15:12] Output Selection for DSADC11 GTM connection (rw) */
    Ifx_Strict_32Bit SEL12 : 4;               /**< \brief [19:16] Output Selection for DSADC12 GTM connection (rw) */
    Ifx_Strict_32Bit SEL13 : 4;               /**< \brief [23:20] Output Selection for DSADC13 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits;

/** \\brief  Data Exchange Input Control Register */
typedef struct _Ifx_GTM_INOUTSEL_DXINCON_Bits
{
    Ifx_Strict_32Bit IN0 : 1;                 /**< \brief [0:0] Input 00 Control (rw) */
    Ifx_Strict_32Bit IN1 : 1;                 /**< \brief [1:1] Input 01 Control (rw) */
    Ifx_Strict_32Bit IN2 : 1;                 /**< \brief [2:2] Input 02 Control (rw) */
    Ifx_Strict_32Bit IN3 : 1;                 /**< \brief [3:3] Input 03 Control (rw) */
    Ifx_Strict_32Bit IN4 : 1;                 /**< \brief [4:4] Input 04 Control (rw) */
    Ifx_Strict_32Bit IN5 : 1;                 /**< \brief [5:5] Input 05 Control (rw) */
    Ifx_Strict_32Bit IN6 : 1;                 /**< \brief [6:6] Input 06 Control (rw) */
    Ifx_Strict_32Bit IN7 : 1;                 /**< \brief [7:7] Input 07 Control (rw) */
    Ifx_Strict_32Bit IN8 : 1;                 /**< \brief [8:8] Input 08 Control (rw) */
    Ifx_Strict_32Bit IN9 : 1;                 /**< \brief [9:9] Input 09 Control (rw) */
    Ifx_Strict_32Bit reserved_10 : 6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DSS0 : 1;                /**< \brief [16:16] Data Source Select 00 Control (rw) */
    Ifx_Strict_32Bit DSS1 : 1;                /**< \brief [17:17] Data Source Select 01 Control (rw) */
    Ifx_Strict_32Bit DSS2 : 1;                /**< \brief [18:18] Data Source Select 02 Control (rw) */
    Ifx_Strict_32Bit DSS3 : 1;                /**< \brief [19:19] Data Source Select 03 Control (rw) */
    Ifx_Strict_32Bit DSS4 : 1;                /**< \brief [20:20] Data Source Select 04 Control (rw) */
    Ifx_Strict_32Bit DSS5 : 1;                /**< \brief [21:21] Data Source Select 05 Control (rw) */
    Ifx_Strict_32Bit DSS6 : 1;                /**< \brief [22:22] Data Source Select 06 Control (rw) */
    Ifx_Strict_32Bit DSS7 : 1;                /**< \brief [23:23] Data Source Select 07 Control (rw) */
    Ifx_Strict_32Bit DSS8 : 1;                /**< \brief [24:24] Data Source Select 08 Control (rw) */
    Ifx_Strict_32Bit DSS9 : 1;                /**< \brief [25:25] Data Source Select 09 Control (rw) */
    Ifx_Strict_32Bit reserved_26 : 6;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_DXINCON_Bits;

/** \\brief  Data Exchange Output Control Register */
typedef struct _Ifx_GTM_INOUTSEL_DXOUTCON_Bits
{
    Ifx_Strict_32Bit OUT0 : 1;                /**< \brief [0:0] Output 00 Control (rw) */
    Ifx_Strict_32Bit OUT1 : 1;                /**< \brief [1:1] Output 01 Control (rw) */
    Ifx_Strict_32Bit OUT2 : 1;                /**< \brief [2:2] Output 02 Control (rw) */
    Ifx_Strict_32Bit OUT3 : 1;                /**< \brief [3:3] Output 03 Control (rw) */
    Ifx_Strict_32Bit OUT4 : 1;                /**< \brief [4:4] Output 04 Control (rw) */
    Ifx_Strict_32Bit OUT5 : 1;                /**< \brief [5:5] Output 05 Control (rw) */
    Ifx_Strict_32Bit OUT6 : 1;                /**< \brief [6:6] Output 06 Control (rw) */
    Ifx_Strict_32Bit OUT7 : 1;                /**< \brief [7:7] Output 07 Control (rw) */
    Ifx_Strict_32Bit OUT8 : 1;                /**< \brief [8:8] Output 08 Control (rw) */
    Ifx_Strict_32Bit OUT9 : 1;                /**< \brief [9:9] Output 09 Control (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_DXOUTCON_Bits;

/** \\brief  I0terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT0_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT0_Bits;

/** \\brief  I1terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT1_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT1_Bits;

/** \\brief  I2terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT2_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT2_Bits;

/** \\brief  I3terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT3_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT3_Bits;

/** \\brief  I4terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT4_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT4_Bits;

/** \\brief  I5terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT5_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT5_Bits;

/** \\brief  I6terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT6_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT6_Bits;

/** \\brief  I7terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT7_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT7_Bits;

/** \\brief  I8terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT8_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT8_Bits;

/** \\brief  I9terrupt Output Register n */
typedef struct _Ifx_GTM_INOUTSEL_INT_OUT9_Bits
{
    Ifx_Strict_32Bit INT0 : 2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_INT_OUT9_Bits;

/** \\brief  MCS Interrupt Clear Register */
typedef struct _Ifx_GTM_INOUTSEL_MCSINTCLR_Bits
{
    Ifx_Strict_32Bit MCS0 : 1;                /**< \brief [0:0] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS1 : 1;                /**< \brief [1:1] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS2 : 1;                /**< \brief [2:2] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS3 : 1;                /**< \brief [3:3] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS4 : 1;                /**< \brief [4:4] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS5 : 1;                /**< \brief [5:5] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS6 : 1;                /**< \brief [6:6] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS7 : 1;                /**< \brief [7:7] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS8 : 1;                /**< \brief [8:8] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS9 : 1;                /**< \brief [9:9] MCSn RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MCSINTCLR_Bits;

/** \\brief  MCS Interrupt Status Register */
typedef struct _Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits
{
    Ifx_Strict_32Bit MCS00 : 1;               /**< \brief [0:0] MCS0 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS10 : 1;               /**< \brief [1:1] MCS1 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS20 : 1;               /**< \brief [2:2] MCS2 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS30 : 1;               /**< \brief [3:3] MCS3 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS40 : 1;               /**< \brief [4:4] MCS4 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS50 : 1;               /**< \brief [5:5] MCS5 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS60 : 1;               /**< \brief [6:6] MCS6 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS70 : 1;               /**< \brief [7:7] MCS7 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS80 : 1;               /**< \brief [8:8] MCS8 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS90 : 1;               /**< \brief [9:9] MCS9 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits;

/** \\brief  Trigger Output Sel Register */
typedef struct _Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Select which MCS triggers go to G12BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Select which MCS triggers go to G13BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Select which MCS triggers go to G14BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Select which MCS triggers go to G15BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Select which MCS triggers go to G16BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Select which MCS triggers go to G17BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Select which MCS triggers go to G18BFDAT /SEL (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Select which MCS triggers go to G19BFDAT /SEL (rw) */
} Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits;

/** \\brief  MSC0 Input High Control Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits
{
    Ifx_Strict_32Bit SEL0 : 2;                /**< \brief [1:0]  (rw) */
    Ifx_Strict_32Bit SEL1 : 2;                /**< \brief [3:2]  (rw) */
    Ifx_Strict_32Bit SEL2 : 2;                /**< \brief [5:4]  (rw) */
    Ifx_Strict_32Bit SEL3 : 2;                /**< \brief [7:6]  (rw) */
    Ifx_Strict_32Bit SEL4 : 2;                /**< \brief [9:8]  (rw) */
    Ifx_Strict_32Bit SEL5 : 2;                /**< \brief [11:10]  (rw) */
    Ifx_Strict_32Bit SEL6 : 2;                /**< \brief [13:12]  (rw) */
    Ifx_Strict_32Bit SEL7 : 2;                /**< \brief [15:14]  (rw) */
    Ifx_Strict_32Bit SEL8 : 2;                /**< \brief [17:16]  (rw) */
    Ifx_Strict_32Bit SEL9 : 2;                /**< \brief [19:18]  (rw) */
    Ifx_Strict_32Bit SEL10 : 2;               /**< \brief [21:20]  (rw) */
    Ifx_Strict_32Bit SEL11 : 2;               /**< \brief [23:22]  (rw) */
    Ifx_Strict_32Bit SEL12 : 2;               /**< \brief [25:24]  (rw) */
    Ifx_Strict_32Bit SEL13 : 2;               /**< \brief [27:26]  (rw) */
    Ifx_Strict_32Bit SEL14 : 2;               /**< \brief [29:28]  (rw) */
    Ifx_Strict_32Bit SEL15 : 2;               /**< \brief [31:30]  (rw) */
} Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits;

