Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC0 Input Low Control Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_IN_INLCON_Bits
{
    Ifx_Strict_32Bit SEL0 : 2;                /**< \brief [1:0]  (rw) */
    Ifx_Strict_32Bit SEL1 : 2;                /**< \brief [3:2]  (rw) */
    Ifx_Strict_32Bit SEL2 : 2;                /**< \brief [5:4]  (rw) */
    Ifx_Strict_32Bit SEL3 : 2;                /**< \brief [7:6]  (rw) */
    Ifx_Strict_32Bit SEL4 : 2;                /**< \brief [9:8]  (rw) */
    Ifx_Strict_32Bit SEL5 : 2;                /**< \brief [11:10]  (rw) */
    Ifx_Strict_32Bit SEL6 : 2;                /**< \brief [13:12]  (rw) */
    Ifx_Strict_32Bit SEL7 : 2;                /**< \brief [15:14]  (rw) */
    Ifx_Strict_32Bit SEL8 : 2;                /**< \brief [17:16]  (rw) */
    Ifx_Strict_32Bit SEL9 : 2;                /**< \brief [19:18]  (rw) */
    Ifx_Strict_32Bit SEL10 : 2;               /**< \brief [21:20]  (rw) */
    Ifx_Strict_32Bit SEL11 : 2;               /**< \brief [23:22]  (rw) */
    Ifx_Strict_32Bit SEL12 : 2;               /**< \brief [25:24]  (rw) */
    Ifx_Strict_32Bit SEL13 : 2;               /**< \brief [27:26]  (rw) */
    Ifx_Strict_32Bit SEL14 : 2;               /**< \brief [29:28]  (rw) */
    Ifx_Strict_32Bit SEL15 : 2;               /**< \brief [31:30]  (rw) */
} Ifx_GTM_INOUTSEL_MSC_IN_INLCON_Bits;

/** \\brief  MSC0 Input Low Extended Control Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits
{
    Ifx_Strict_32Bit SEL0 : 2;                /**< \brief [1:0] GTM MSC0 LowE0tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL1 : 2;                /**< \brief [3:2] GTM MSC0 LowE1tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL2 : 2;                /**< \brief [5:4] GTM MSC0 LowE2tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL3 : 2;                /**< \brief [7:6] GTM MSC0 LowE3tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL4 : 2;                /**< \brief [9:8] GTM MSC0 LowE4tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL5 : 2;                /**< \brief [11:10] GTM MSC0 LowE5tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL6 : 2;                /**< \brief [13:12] GTM MSC0 LowE6tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL7 : 2;                /**< \brief [15:14] GTM MSC0 LowE7tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL8 : 2;                /**< \brief [17:16] GTM MSC0 LowE8tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL9 : 2;                /**< \brief [19:18] GTM MSC0 LowE9tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL10 : 2;               /**< \brief [21:20] GTM MSC0 LowE10tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL11 : 2;               /**< \brief [23:22] GTM MSC0 LowE11tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL12 : 2;               /**< \brief [25:24] GTM MSC0 LowE12tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL13 : 2;               /**< \brief [27:26] GTM MSC0 LowE13tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL14 : 2;               /**< \brief [29:28] GTM MSC0 LowE14tended x Output Selection (rw) */
    Ifx_Strict_32Bit SEL15 : 2;               /**< \brief [31:30] GTM MSC0 LowE15tended x Output Selection (rw) */
} Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits;

/** \\brief  MSC Set 1 Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits;

/** \\brief  MSC Set 1 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits;

/** \\brief  MSC Set 1 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits;

/** \\brief  MSC Set 1 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET1CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET1CON3_Bits;

