Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 2 Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET2CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET2CON0_Bits;

/** \\brief  MSC Set 2 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET2CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET2CON1_Bits;

/** \\brief  MSC Set 2 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET2CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET2CON2_Bits;

/** \\brief  MSC Set 2 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET2CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET2CON3_Bits;

/** \\brief  MSC Set 3Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET3CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET3CON0_Bits;

/** \\brief  MSC Set 3Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET3CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET3CON1_Bits;

/** \\brief  MSC Set 3 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET3CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET3CON2_Bits;

/** \\brief  MSC Set 3 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET3CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET3CON3_Bits;

/** \\brief  MSC Set 4 Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET4CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET4CON0_Bits;

/** \\brief  MSC Set 4 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET4CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET4CON1_Bits;

/** \\brief  MSC Set 4 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET4CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET4CON2_Bits;

