Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 4 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET4CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET4CON3_Bits;

/** \\brief  MSC Set 5 Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET5CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0] Set 5[0] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8] Set 5[1] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16] Set 5[2] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24] Set 5[3] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET5CON0_Bits;

/** \\brief  MSC Set 5 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET5CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0] Set 5[4] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8] Set 5[5] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16] Set 5[6] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24] Set 5[7] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET5CON1_Bits;

/** \\brief  MSC Set 5 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET5CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0] Set 5[8] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8] Set 5[9] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16] Set 5[10] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24] Set 5[11] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET5CON2_Bits;

/** \\brief  MSC Set 5 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET5CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0] Set 5[12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8] Set 5[13] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16] Set 5[14] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24] Set 5[15] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET5CON3_Bits;

/** \\brief  MSC Set 6 Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET6CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0] Set 6[0] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8] Set 6[1] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16] Set 6[2] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24] Set 6[3] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET6CON0_Bits;

/** \\brief  MSC Set 6 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET6CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0] Set 6[4] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8] Set 6[5] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16] Set 6[6] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24] Set 6[7] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET6CON1_Bits;

/** \\brief  MSC Set 6 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET6CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0] Set 6[8] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8] Set 6[9] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16] Set 6[10] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24] Set 6[11] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET6CON2_Bits;

/** \\brief  MSC Set 6 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET6CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0] Set 6[12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8] Set 6[13] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16] Set 6[14] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24] Set 6[15] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET6CON3_Bits;

/** \\brief  MSC Set 7Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET7CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0] Set 7[0] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8] Set 7[1] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16] Set 7[2] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24] Set 7[3] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET7CON0_Bits;

/** \\brief  MSC Set 7 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET7CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0] Set 7[4] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8] Set 7[5] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16] Set 7[6] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24] Set 7[7] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET7CON1_Bits;

