Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 7 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET7CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0] Set 7[8] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8] Set 7[9] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16] Set 7[10] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24] Set 7[11] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET7CON2_Bits;

/** \\brief  MSC Set 7 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET7CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0] Set 7[12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8] Set 7[13] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16] Set 7[14] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24] Set 7[15] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET7CON3_Bits;

/** \\brief  MSC Set 8Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET8CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0] Set 8[0] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8] Set 8[1] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16] Set 8[2] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24] Set 8[3] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET8CON0_Bits;

/** \\brief  MSC Set 8 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET8CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0] Set 8[4] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8] Set 8[5] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16] Set 8[6] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24] Set 8[7] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET8CON1_Bits;

/** \\brief  MSC Set 8 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET8CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0] Set 8[8] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8] Set 8[9] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16] Set 8[10] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24] Set 8[11] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET8CON2_Bits;

/** \\brief  MSC Set 8 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET8CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0] Set 8[12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8] Set 8[13] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16] Set 8[14] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24] Set 8[15] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET8CON3_Bits;

/** \\brief  MSC Set 9Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET9CON0_Bits
{
    Ifx_Strict_32Bit SEL0 : 5;                /**< \brief [4:0] Set 9[0] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1 : 5;                /**< \brief [12:8] Set 9[1] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2 : 5;                /**< \brief [20:16] Set 9[2] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3 : 5;                /**< \brief [28:24] Set 9[3] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET9CON0_Bits;

/** \\brief  MSC Set 9 Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET9CON1_Bits
{
    Ifx_Strict_32Bit SEL4 : 5;                /**< \brief [4:0] Set 9[4] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5 : 5;                /**< \brief [12:8] Set 9[5] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6 : 5;                /**< \brief [20:16] Set 9[6] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7 : 5;                /**< \brief [28:24] Set 9[7] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET9CON1_Bits;

