Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 9 Control 2 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET9CON2_Bits
{
    Ifx_Strict_32Bit SEL8 : 5;                /**< \brief [4:0] Set 9[8] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9 : 5;                /**< \brief [12:8] Set 9[9] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10 : 5;               /**< \brief [20:16] Set 9[10] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11 : 5;               /**< \brief [28:24] Set 9[11] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET9CON2_Bits;

/** \\brief  MSC Set 9 Control 3 Register */
typedef struct _Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits
{
    Ifx_Strict_32Bit SEL12 : 5;               /**< \brief [4:0] Set 9[12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL13 : 5;               /**< \brief [12:8] Set 9[13] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_13 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL14 : 5;               /**< \brief [20:16] Set 9[14] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_21 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL15 : 5;               /**< \brief [28:24] Set 9[15] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits;

/** \\brief  OCDS Control and Status */
typedef struct _Ifx_GTM_INOUTSEL_OCS_Bits
{
    Ifx_Strict_32Bit reserved_0 : 24;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SUS : 4;                 /**< \brief [27:24] OCDS Suspend Control (rw) */
    Ifx_Strict_32Bit SUS_P : 1;               /**< \brief [28:28] SUS Write Protection (w) */
    Ifx_Strict_32Bit SUSSTA : 1;              /**< \brief [29:29] Suspend State (rh) */
    Ifx_Strict_32Bit reserved_30 : 2;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OCS_Bits;

/** \\brief  OCDS Debug Access Register */
typedef struct _Ifx_GTM_INOUTSEL_ODA_Bits
{
    Ifx_Strict_32Bit DRAC : 2;                /**< \brief [1:0] Destructive Read Access Control (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_ODA_Bits;

/** \\brief  OCDS TBU0 Trigger Register */
typedef struct _Ifx_GTM_INOUTSEL_OTBU0T_Bits
{
    Ifx_Strict_32Bit CV : 27;                 /**< \brief [26:0] Compare Value (rw) */
    Ifx_Strict_32Bit reserved_27 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CM : 2;                  /**< \brief [29:28] Compare Mode (rw) */
    Ifx_Strict_32Bit reserved_30 : 2;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OTBU0T_Bits;

/** \\brief  OCDS TBU1 Trigger Register */
typedef struct _Ifx_GTM_INOUTSEL_OTBU1T_Bits
{
    Ifx_Strict_32Bit CV : 24;                 /**< \brief [23:0] Compare Value (rw) */
    Ifx_Strict_32Bit reserved_24 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EN : 1;                  /**< \brief [28:28] Enable (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OTBU1T_Bits;

/** \\brief  OCDS TBU2 Trigger Register */
typedef struct _Ifx_GTM_INOUTSEL_OTBU2T_Bits
{
    Ifx_Strict_32Bit CV : 24;                 /**< \brief [23:0] Compare Value (rw) */
    Ifx_Strict_32Bit reserved_24 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EN : 1;                  /**< \brief [28:28] Enable (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OTBU2T_Bits;

/** \\brief  OCDS Trigger Set Control 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_OTSC0_Bits
{
    Ifx_Strict_32Bit B0LMT : 3;               /**< \brief [2:0] OTGB0 TS16_IOS Low Byte Module Type (rw) */
    Ifx_Strict_32Bit reserved_3 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit B0LMI : 4;               /**< \brief [7:4] OTGB0 TS16_IOS Low Byte Module Instance (rw) */
    Ifx_Strict_32Bit B0HMT : 3;               /**< \brief [10:8] OTGB0 TS16_IOS High Byte Module Type (rw) */
    Ifx_Strict_32Bit reserved_11 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit B0HMI : 4;               /**< \brief [15:12] OTGB0 TS16_IOS High Byte Module Instance (rw) */
    Ifx_Strict_32Bit B1LMT : 3;               /**< \brief [18:16] OTGB1 TS16_IOS Low Byte Module Type (rw) */
    Ifx_Strict_32Bit reserved_19 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit B1LMI : 4;               /**< \brief [23:20] OTGB1 TS16_IOS Low Byte Module Instance (rw) */
    Ifx_Strict_32Bit B1HMT : 3;               /**< \brief [26:24] OTGB1 TS16_IOS High Byte Module Type (rw) */
    Ifx_Strict_32Bit reserved_27 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit B1HMI : 4;               /**< \brief [31:28] OTGB1 TS16_IOS High Byte Module Instance (rw) */
} Ifx_GTM_INOUTSEL_OTSC0_Bits;

/** \\brief  OCDS Trigger Set Control 1 Register */
typedef struct _Ifx_GTM_INOUTSEL_OTSC1_Bits
{
    Ifx_Strict_32Bit MCS : 4;                 /**< \brief [3:0] MCS Channel Select (rw) */
    Ifx_Strict_32Bit MI : 4;                  /**< \brief [7:4] MCS Instance (rw) */
    Ifx_Strict_32Bit reserved_8 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MOE : 1;                 /**< \brief [9:9] MCS Opcode Trace Enable (rw) */
    Ifx_Strict_32Bit reserved_10 : 22;        /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OTSC1_Bits;

/** \\brief  OCDS Trigger Set Select Register */
typedef struct _Ifx_GTM_INOUTSEL_OTSS_Bits
{
    Ifx_Strict_32Bit OTGB0 : 4;               /**< \brief [3:0] Trigger Set for OTGB0 (rw) */
    Ifx_Strict_32Bit reserved_4 : 4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OTGB1 : 4;               /**< \brief [11:8] Trigger Set for OTGB1 (rw) */
    Ifx_Strict_32Bit reserved_12 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OTGBM0 : 4;              /**< \brief [19:16] Trigger Set for OTGBM0 (rw) */
    Ifx_Strict_32Bit reserved_20 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OTGBM1 : 4;              /**< \brief [27:24] Trigger Set for OTGBM1 (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_OTSS_Bits;

/** \\brief  PSI5 Output Select 0 Register */
typedef struct _Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for PSI50 GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for PSI51 GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for PSI52 GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for PSI53 GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for PSI54 GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for PSI55 GTM connection (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits;

