Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  PSI5-S Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] Output Selection for PSI5-S GTM connection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] Output Selection for PSI5-S GTM connection (rw) */
} Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_GTM_INOUTSEL_RESET1_Bits
{
    Ifx_Strict_32Bit RST : 1;                 /**< \brief [0:0] Kernel Reset (rwh) */
    Ifx_Strict_32Bit RSTSTAT : 1;             /**< \brief [1:1] Kernel Reset Status (rh) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_RESET1_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_GTM_INOUTSEL_RESET2_Bits
{
    Ifx_Strict_32Bit RST : 1;                 /**< \brief [0:0] Kernel Reset (rwh) */
    Ifx_Strict_32Bit reserved_1 : 31;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_RESET2_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_GTM_INOUTSEL_RESET_CLR_Bits
{
    Ifx_Strict_32Bit CLR : 1;                 /**< \brief [0:0] Kernel Reset Status Clear (w) */
    Ifx_Strict_32Bit reserved_1 : 31;         /**< \brief \internal Reserved */
} Ifx_GTM_INOUTSEL_RESET_CLR_Bits;

/** \\brief  Timer Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_T_OUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0 : 4;                /**< \brief [3:0] TOUT(n*8+0) Output Selection (rw) */
    Ifx_Strict_32Bit SEL1 : 4;                /**< \brief [7:4] TOUT(n*8+1) Output Selection (rw) */
    Ifx_Strict_32Bit SEL2 : 4;                /**< \brief [11:8] TOUT(n*8+2) Output Selection (rw) */
    Ifx_Strict_32Bit SEL3 : 4;                /**< \brief [15:12] TOUT(n*8+3) Output Selection (rw) */
    Ifx_Strict_32Bit SEL4 : 4;                /**< \brief [19:16] TOUT(n*8+4) Output Selection (rw) */
    Ifx_Strict_32Bit SEL5 : 4;                /**< \brief [23:20] TOUT(n*8+5) Output Selection (rw) */
    Ifx_Strict_32Bit SEL6 : 4;                /**< \brief [27:24] TOUT(n*8+6) Output Selection (rw) */
    Ifx_Strict_32Bit SEL7 : 4;                /**< \brief [31:28] TOUT(n*8+7) Output Selection (rw) */
} Ifx_GTM_INOUTSEL_T_OUTSEL_Bits;

/** \\brief  TIM Input Select Register */
typedef struct _Ifx_GTM_INOUTSEL_TIM_INSEL_Bits
{
    Ifx_Strict_32Bit CH0SEL : 4;              /**< \brief [3:0] TIM Channel 0 Input Selection (rw) */
    Ifx_Strict_32Bit CH1SEL : 4;              /**< \brief [7:4] TIM Channel 1 Input Selection (rw) */
    Ifx_Strict_32Bit CH2SEL : 4;              /**< \brief [11:8] TIM Channel 2 Input Selection (rw) */
    Ifx_Strict_32Bit CH3SEL : 4;              /**< \brief [15:12] TIM Channel 3 Input Selection (rw) */
    Ifx_Strict_32Bit CH4SEL : 4;              /**< \brief [19:16] TIM Channel 4 Input Selection (rw) */
    Ifx_Strict_32Bit CH5SEL : 4;              /**< \brief [23:20] TIM Channel 5 Input Selection (rw) */
    Ifx_Strict_32Bit CH6SEL : 4;              /**< \brief [27:24] TIM Channel 6 Input Selection (rw) */
    Ifx_Strict_32Bit CH7SEL : 4;              /**< \brief [31:28] TIM Channel 7 Input Selection (rw) */
} Ifx_GTM_INOUTSEL_TIM_INSEL_Bits;

/** \\brief  Trigger Output Register 0 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits;

/** \\brief  Trigger Output Register 1 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT1_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT1_Bits;

/** \\brief  Trigger Output Register 2 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits;

/** \\brief  Trigger Output Register 3 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits;

/** \\brief  Trigger Output Register 4 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT4_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT4_Bits;

/** \\brief  Trigger Output Register 5 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT5_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT5_Bits;

