Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  Trigger Output Register 6 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT6_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT6_Bits;

/** \\brief  Trigger Output Register 7 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT7_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT7_Bits;

/** \\brief  Trigger Output Register 8 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT8_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT8_Bits;

/** \\brief  Trigger Output Register 9 */
typedef struct _Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits
{
    Ifx_Strict_32Bit TRIG0 : 2;               /**< \brief [1:0] Trigger 0 (rw) */
    Ifx_Strict_32Bit TRIG1 : 2;               /**< \brief [3:2] Trigger 1 (rw) */
    Ifx_Strict_32Bit TRIG2 : 2;               /**< \brief [5:4] Trigger 2 (rw) */
    Ifx_Strict_32Bit TRIG3 : 2;               /**< \brief [7:6] Trigger 3 (rw) */
    Ifx_Strict_32Bit TRIG4 : 2;               /**< \brief [9:8] Trigger 4 (rw) */
    Ifx_Strict_32Bit TRIG5 : 2;               /**< \brief [11:10] Trigger 5 (rw) */
    Ifx_Strict_32Bit TRIG6 : 2;               /**< \brief [13:12] Trigger 6 (rw) */
    Ifx_Strict_32Bit TRIG7 : 2;               /**< \brief [15:14] Trigger 7 (rw) */
    Ifx_Strict_32Bit TRIG8 : 2;               /**< \brief [17:16] Trigger 8 (rw) */
    Ifx_Strict_32Bit TRIG9 : 2;               /**< \brief [19:18] Trigger 9 (rw) */
    Ifx_Strict_32Bit TRIG10 : 2;              /**< \brief [21:20] Trigger 10 (rw) */
    Ifx_Strict_32Bit TRIG11 : 2;              /**< \brief [23:22] Trigger 11 (rw) */
    Ifx_Strict_32Bit TRIG12 : 2;              /**< \brief [25:24] Trigger 12 (rw) */
    Ifx_Strict_32Bit TRIG13 : 2;              /**< \brief [27:26] Trigger 13 (rw) */
    Ifx_Strict_32Bit TRIG14 : 2;              /**< \brief [29:28] Trigger 14 (rw) */
    Ifx_Strict_32Bit TRIG15 : 2;              /**< \brief [31:30] Trigger 15 (rw) */
} Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits;

/** \\brief  GTM Interrupt enable register */
typedef struct _Ifx_GTM_IRQ_EN_Bits
{
    Ifx_Strict_32Bit AEI_TO_XPT_IRQ_EN : 1;    /**< \brief [0:0] AEI_TO_XPT_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEI_USP_ADDR_IRQ_EN : 1;  /**< \brief [1:1] AEI_USP_ADDR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEI_IM_ADDR_IRQ_EN : 1;   /**< \brief [2:2] AEI_IM_ADDR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEI_USP_BE_IRQ_EN : 1;    /**< \brief [3:3] AEI_USP_BE_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEIM_USP_ADDR_IRQ_EN : 1; /**< \brief [4:4] AEI_MUSP_ADDR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEIM_IM_ADDR_IRQ_EN : 1;  /**< \brief [5:5] AEIM_IM_ADDR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit AEIM_USP_BE_IRQ_EN : 1;   /**< \brief [6:6] AEIM_USP_BE_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit CLK_EN_ERR_IRQ_EN : 1;    /**< \brief [7:7] CLK_EN_ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit CLK_PER_ERR_IRQ_EN : 1;   /**< \brief [8:8] CLK_PER_ERR_IRQ interrupt enable. (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;          /**< \brief \internal Reserved */
} Ifx_GTM_IRQ_EN_Bits;

/** \\brief  GTM Software interrupt generation register */
typedef struct _Ifx_GTM_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_AEI_TO_XPT : 1;      /**< \brief [0:0] Trigger AEI_TO_XPT_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEI_USP_ADDR : 1;    /**< \brief [1:1] Trigger AEI_USP_ADDR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEI_IM_ADDR : 1;     /**< \brief [2:2] Trigger AEI_IM_ADDR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEI_USP_BE : 1;      /**< \brief [3:3] Trigger AEI_USP_BE_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEIM_USP_ADDR : 1;   /**< \brief [4:4] Trigger AEIM_USP_ADDR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEIM_IM_ADDR : 1;    /**< \brief [5:5] Trigger AEIM_IM_ADDR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_AEIM_USP_BE : 1;     /**< \brief [6:6] Trigger AEIM_USP_BE_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_CLK_EN_ERR : 1;      /**< \brief [7:7] Trigger CLK_EN_ERR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit TRG_CLK_PER_ERR : 1;     /**< \brief [8:8] Trigger CLK_PER_ERR_IRQ interrupt by software. (rw) */
    Ifx_Strict_32Bit reserved_9 : 23;         /**< \brief \internal Reserved */
} Ifx_GTM_IRQ_FORCINT_Bits;

