Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  GTM top level interrupts mode selection */
typedef struct _Ifx_GTM_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] Interrupt strategy mode selection for the AEI timeout and address monitoring interrupts. (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_IRQ_MODE_Bits;

/** \\brief  GTM Interrupt notification register */
typedef struct _Ifx_GTM_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit AEI_TO_XPT : 1;          /**< \brief [0:0] AEI timeout exception occurred. (rw) */
    Ifx_Strict_32Bit AEI_USP_ADDR : 1;        /**< \brief [1:1] AEI unsupported address interrupt. (rw) */
    Ifx_Strict_32Bit AEI_IM_ADDR : 1;         /**< \brief [2:2] AEI illegal Module address interrupt. (rw) */
    Ifx_Strict_32Bit AEI_USP_BE : 1;          /**< \brief [3:3] AEI unsupported byte enable interrupt. (rw) */
    Ifx_Strict_32Bit AEIM_USP_ADDR : 1;       /**< \brief [4:4] AEI master port unsupported address interrupt. (rw) */
    Ifx_Strict_32Bit AEIM_IM_ADDR : 1;        /**< \brief [5:5] AEI master port illegal Module address interrupt (rw) */
    Ifx_Strict_32Bit AEIM_USP_BE : 1;         /**< \brief [6:6] AEI master port unsupported byte enable interrupt (rw) */
    Ifx_Strict_32Bit CLK_EN_ERR : 1;          /**< \brief [7:7] Clock enable error interrupt (rw) */
    Ifx_Strict_32Bit CLK_PER_ERR : 1;         /**< \brief [8:8] Clock period error interrupt (rw) */
    Ifx_Strict_32Bit reserved_9 : 15;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLK_EN_ERR_STATE : 4;    /**< \brief [27:24] Erroneous clock enable state (r) */
    Ifx_Strict_32Bit CLK_EN_EXP_STATE : 4;    /**< \brief [31:28] Expected clock enable state (r) */
} Ifx_GTM_IRQ_NOTIFY_Bits;

/** \\brief  LCDCDC Output Select Register */
typedef struct _Ifx_GTM_LCDCDCOUTSEL_Bits
{
    Ifx_Strict_32Bit SEL : 4;                 /**< \brief [3:0] Output Selection for LCDCDC GTM connection (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_LCDCDCOUTSEL_Bits;

/** \\brief  MAP Control register */
typedef struct _Ifx_GTM_MAP_CTRL_Bits
{
    Ifx_Strict_32Bit TSEL : 1;                /**< \brief [0:0] TRIGGER signal output select (rw) */
    Ifx_Strict_32Bit SSL : 3;                 /**< \brief [3:1] STATE signal output select (rw) */
    Ifx_Strict_32Bit LSEL : 1;                /**< \brief [4:4] TIM0_IN6 input level selection (rw) */
    Ifx_Strict_32Bit reserved_5 : 11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TSPP0_EN : 1;            /**< \brief [16:16] Enable of TSPP0 subunit (rw) */
    Ifx_Strict_32Bit TSPP0_DLD : 1;           /**< \brief [17:17] DIR level definition bit (rw) */
    Ifx_Strict_32Bit reserved_18 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TSPP0_I0V : 1;           /**< \brief [20:20] Disable of TSPP0 TIM0_CHx(48) input line (rw) */
    Ifx_Strict_32Bit TSPP0_I1V : 1;           /**< \brief [21:21] Disable of TSPP0 TIM0_CHy(48) input line (rw) */
    Ifx_Strict_32Bit TSPP0_I2V : 1;           /**< \brief [22:22] Disable of TSPP0 TIM0_CHz(48) input line (rw) */
    Ifx_Strict_32Bit reserved_23 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TSPP1_EN : 1;            /**< \brief [24:24] Enable of TSPP1 subunit (rw) */
    Ifx_Strict_32Bit TSPP1_DLD : 1;           /**< \brief [25:25] DIR level definition bit (rw) */
    Ifx_Strict_32Bit reserved_26 : 2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TSPP1_I0V : 1;           /**< \brief [28:28] Disable of TSPP1 TIM0_CHx(48) input line (rw) */
    Ifx_Strict_32Bit TSPP1_I1V : 1;           /**< \brief [29:29] Disable of TSPP1 TIM0_CHy(48) input line (rw) */
    Ifx_Strict_32Bit TSPP1_I2V : 1;           /**< \brief [30:30] Disable of TSPP1 TIM0_CHz(48) input line (rw) */
    Ifx_Strict_32Bit reserved_31 : 1;         /**< \brief \internal Reserved */
} Ifx_GTM_MAP_CTRL_Bits;

/** \\brief  MCFG Memory layout configuration. */
typedef struct _Ifx_GTM_MCFG_CTRL_Bits
{
    Ifx_Strict_32Bit MEM0 : 2;                /**< \brief [1:0] Configure Memory pages for MCS-instance MCS0 (rw) */
    Ifx_Strict_32Bit MEM1 : 2;                /**< \brief [3:2] Configure Memory pages for MCS-instance MCS1 (rw) */
    Ifx_Strict_32Bit MEM2 : 2;                /**< \brief [5:4] Configure Memory pages for MCS-instance MCS2 (rw) */
    Ifx_Strict_32Bit MEM3 : 2;                /**< \brief [7:6] Configure Memory pages for MCS-instance MCS3 (rw) */
    Ifx_Strict_32Bit MEM4 : 2;                /**< \brief [9:8] Configure Memory pages for MCS-instance MCS4 (rw) */
    Ifx_Strict_32Bit MEM5 : 2;                /**< \brief [11:10] Configure Memory pages for MCS-instance MCS5 (rw) */
    Ifx_Strict_32Bit MEM6 : 2;                /**< \brief [13:12] Configure Memory pages for MCS-instance MCS6 (rw) */
    Ifx_Strict_32Bit MEM7 : 2;                /**< \brief [15:14] Configure Memory pages for MCS-instance MCS7 (rw) */
    Ifx_Strict_32Bit MEM8 : 2;                /**< \brief [17:16] Configure Memory pages for MCS-instance MCS8 (rw) */
    Ifx_Strict_32Bit MEM9 : 2;                /**< \brief [19:18] Configure Memory pages for MCS-instance MCS9 (rw) */
    Ifx_Strict_32Bit reserved_20 : 12;        /**< \brief \internal Reserved */
} Ifx_GTM_MCFG_CTRL_Bits;

/** \\brief  MCS to DPLL Data Exchange Buffer 0 */
typedef struct _Ifx_GTM_MCS2DPLL_DEB_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data exchange buffer 0 (rw) */
    Ifx_Strict_32Bit na : 8;                  /**< \brief [31:24] Not applicable (r) */
} Ifx_GTM_MCS2DPLL_DEB_Bits;

/** \\brief  GTM MCS master port disable register */
typedef struct _Ifx_GTM_MCS_AEM_DIS_Bits
{
    Ifx_Strict_32Bit DIS_CLS0 : 2;            /**< \brief [1:0] Disable MCS AEIM access in cluster 0 (r) */
    Ifx_Strict_32Bit DIS_CLS1 : 2;            /**< \brief [3:2] Disable MCS AEIM access in cluster 1, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS2 : 2;            /**< \brief [5:4] Disable MCS AEIM access in cluster 2, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS3 : 2;            /**< \brief [7:6] Disable MCS AEIM access in cluster 3, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS4 : 2;            /**< \brief [9:8] Disable MCS AEIM access in cluster 4, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS5 : 2;            /**< \brief [11:10] Disable MCS AEIM access in cluster 5, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS6 : 2;            /**< \brief [13:12] Disable MCS AEIM access in cluster 6, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS7 : 2;            /**< \brief [15:14] Disable MCS AEIM access in cluster 7, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS8 : 2;            /**< \brief [17:16] Disable MCS AEIM access in cluster 8, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS9 : 2;            /**< \brief [19:18] Disable MCS AEIM access in cluster 9, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS10 : 2;           /**< \brief [21:20] Disable MCS AEIM access in cluster 10, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit DIS_CLS11 : 2;           /**< \brief [23:22] Disable MCS AEIM access in cluster 11, see bit DIS_CLS0 (r) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_AEM_DIS_Bits;

