Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MCS cancel ARU transfer instruction */
typedef struct _Ifx_GTM_MCS_CAT_Bits
{
    Ifx_Strict_32Bit CAT0 : 1;                /**< \brief [0:0] Cancel ARU transfer for channel 0 (rw) */
    Ifx_Strict_32Bit CAT1 : 1;                /**< \brief [1:1] Cancel ARU transfer for channel 1 (rw) */
    Ifx_Strict_32Bit CAT2 : 1;                /**< \brief [2:2] Cancel ARU transfer for channel 2 (rw) */
    Ifx_Strict_32Bit CAT3 : 1;                /**< \brief [3:3] Cancel ARU transfer for channel 3 (rw) */
    Ifx_Strict_32Bit CAT4 : 1;                /**< \brief [4:4] Cancel ARU transfer for channel 4 (rw) */
    Ifx_Strict_32Bit CAT5 : 1;                /**< \brief [5:5] Cancel ARU transfer for channel 5 (rw) */
    Ifx_Strict_32Bit CAT6 : 1;                /**< \brief [6:6] Cancel ARU transfer for channel 6 (rw) */
    Ifx_Strict_32Bit CAT7 : 1;                /**< \brief [7:7] Cancel ARU transfer for channel 7 (rw) */
    Ifx_Strict_32Bit Reserved : 24;           /**< \brief [31:8] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CAT_Bits;

/** \\brief  MCS clear trigger control register */
typedef struct _Ifx_GTM_MCS_CH0_CTRG_Bits
{
    Ifx_Strict_32Bit TRG0 : 1;                /**< \brief [0:0] Trigger bit 0 (rw) */
    Ifx_Strict_32Bit TRG1 : 1;                /**< \brief [1:1] Trigger bit 1 (rw) */
    Ifx_Strict_32Bit TRG2 : 1;                /**< \brief [2:2] Trigger bit 2 (rw) */
    Ifx_Strict_32Bit TRG3 : 1;                /**< \brief [3:3] Trigger bit 3 (rw) */
    Ifx_Strict_32Bit TRG4 : 1;                /**< \brief [4:4] Trigger bit 4 (rw) */
    Ifx_Strict_32Bit TRG5 : 1;                /**< \brief [5:5] Trigger bit 5 (rw) */
    Ifx_Strict_32Bit TRG6 : 1;                /**< \brief [6:6] Trigger bit 6 (rw) */
    Ifx_Strict_32Bit TRG7 : 1;                /**< \brief [7:7] Trigger bit 7 (rw) */
    Ifx_Strict_32Bit TRG8 : 1;                /**< \brief [8:8] Trigger bit 8 (rw) */
    Ifx_Strict_32Bit TRG9 : 1;                /**< \brief [9:9] Trigger bit 9 (rw) */
    Ifx_Strict_32Bit TRG10 : 1;               /**< \brief [10:10] Trigger bit 10 (rw) */
    Ifx_Strict_32Bit TRG11 : 1;               /**< \brief [11:11] Trigger bit 11 (rw) */
    Ifx_Strict_32Bit TRG12 : 1;               /**< \brief [12:12] Trigger bit 12 (rw) */
    Ifx_Strict_32Bit TRG13 : 1;               /**< \brief [13:13] Trigger bit 13 (rw) */
    Ifx_Strict_32Bit TRG14 : 1;               /**< \brief [14:14] Trigger bit 14 (rw) */
    Ifx_Strict_32Bit TRG15 : 1;               /**< \brief [15:15] Trigger bit 15 (rw) */
    Ifx_Strict_32Bit TRG16 : 1;               /**< \brief [16:16] Trigger bit 16 (rw) */
    Ifx_Strict_32Bit TRG17 : 1;               /**< \brief [17:17] Trigger bit 17 (rw) */
    Ifx_Strict_32Bit TRG18 : 1;               /**< \brief [18:18] Trigger bit 18 (rw) */
    Ifx_Strict_32Bit TRG19 : 1;               /**< \brief [19:19] Trigger bit 19 (rw) */
    Ifx_Strict_32Bit TRG20 : 1;               /**< \brief [20:20] Trigger bit 20 (rw) */
    Ifx_Strict_32Bit TRG21 : 1;               /**< \brief [21:21] Trigger bit 21 (rw) */
    Ifx_Strict_32Bit TRG22 : 1;               /**< \brief [22:22] Trigger bit 22 (rw) */
    Ifx_Strict_32Bit TRG23 : 1;               /**< \brief [23:23] Trigger bit 23 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH0_CTRG_Bits;

/** \\brief  MCS set trigger control register */
typedef struct _Ifx_GTM_MCS_CH0_STRG_Bits
{
    Ifx_Strict_32Bit TRG0 : 1;                /**< \brief [0:0] Trigger bit 0 (rw) */
    Ifx_Strict_32Bit TRG1 : 1;                /**< \brief [1:1] Trigger bit 1 (rw) */
    Ifx_Strict_32Bit TRG2 : 1;                /**< \brief [2:2] Trigger bit 2 (rw) */
    Ifx_Strict_32Bit TRG3 : 1;                /**< \brief [3:3] Trigger bit 3 (rw) */
    Ifx_Strict_32Bit TRG4 : 1;                /**< \brief [4:4] Trigger bit 4 (rw) */
    Ifx_Strict_32Bit TRG5 : 1;                /**< \brief [5:5] Trigger bit 5 (rw) */
    Ifx_Strict_32Bit TRG6 : 1;                /**< \brief [6:6] Trigger bit 6 (rw) */
    Ifx_Strict_32Bit TRG7 : 1;                /**< \brief [7:7] Trigger bit 7 (rw) */
    Ifx_Strict_32Bit TRG8 : 1;                /**< \brief [8:8] Trigger bit 8 (rw) */
    Ifx_Strict_32Bit TRG9 : 1;                /**< \brief [9:9] Trigger bit 9 (rw) */
    Ifx_Strict_32Bit TRG10 : 1;               /**< \brief [10:10] Trigger bit 10 (rw) */
    Ifx_Strict_32Bit TRG11 : 1;               /**< \brief [11:11] Trigger bit 11 (rw) */
    Ifx_Strict_32Bit TRG12 : 1;               /**< \brief [12:12] Trigger bit 12 (rw) */
    Ifx_Strict_32Bit TRG13 : 1;               /**< \brief [13:13] Trigger bit 13 (rw) */
    Ifx_Strict_32Bit TRG14 : 1;               /**< \brief [14:14] Trigger bit 14 (rw) */
    Ifx_Strict_32Bit TRG15 : 1;               /**< \brief [15:15] Trigger bit 15 (rw) */
    Ifx_Strict_32Bit TRG16 : 1;               /**< \brief [16:16] Trigger bit 16 (rw) */
    Ifx_Strict_32Bit TRG17 : 1;               /**< \brief [17:17] Trigger bit 17 (rw) */
    Ifx_Strict_32Bit TRG18 : 1;               /**< \brief [18:18] Trigger bit 18 (rw) */
    Ifx_Strict_32Bit TRG19 : 1;               /**< \brief [19:19] Trigger bit 19 (rw) */
    Ifx_Strict_32Bit TRG20 : 1;               /**< \brief [20:20] Trigger bit 20 (rw) */
    Ifx_Strict_32Bit TRG21 : 1;               /**< \brief [21:21] Trigger bit 21 (rw) */
    Ifx_Strict_32Bit TRG22 : 1;               /**< \brief [22:22] Trigger bit 22 (rw) */
    Ifx_Strict_32Bit TRG23 : 1;               /**< \brief [23:23] Trigger bit 23 (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH0_STRG_Bits;

/** \\brief  MCS channel 0 ARU control Bit register */
typedef struct _Ifx_GTM_MCS_CH_ACB_Bits
{
    Ifx_Strict_32Bit ACB0 : 1;                /**< \brief [0:0] ARU Control bit 0 (r) */
    Ifx_Strict_32Bit ACB1 : 1;                /**< \brief [1:1] ARU Control bit 1 (r) */
    Ifx_Strict_32Bit ACB2 : 1;                /**< \brief [2:2] ARU Control bit 2 (r) */
    Ifx_Strict_32Bit ACB3 : 1;                /**< \brief [3:3] ARU Control bit 3 (r) */
    Ifx_Strict_32Bit ACB4 : 1;                /**< \brief [4:4] ARU Control bit 4 (r) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_ACB_Bits;

