Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MCS channel 0 control register */
typedef struct _Ifx_GTM_MCS_CH_CTRL_Bits
{
    Ifx_Strict_32Bit EN : 1;                  /**< \brief [0:0] Enable MCS-channel (rw) */
    Ifx_Strict_32Bit IRQ : 1;                 /**< \brief [1:1] Interrupt state (r) */
    Ifx_Strict_32Bit ERR : 1;                 /**< \brief [2:2] Error state (r) */
    Ifx_Strict_32Bit reserved_3 : 1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CY : 1;                  /**< \brief [4:4] Carry bit state (r) */
    Ifx_Strict_32Bit Z : 1;                   /**< \brief [5:5] Zero bit state (r) */
    Ifx_Strict_32Bit V : 1;                   /**< \brief [6:6] Overflow bit state (r) */
    Ifx_Strict_32Bit N : 1;                   /**< \brief [7:7] Negative bit state (r) */
    Ifx_Strict_32Bit CAT : 1;                 /**< \brief [8:8] Cancel ARU transfer state (r) */
    Ifx_Strict_32Bit CWT : 1;                 /**< \brief [9:9] Cancel WURM instruction state (r) */
    Ifx_Strict_32Bit SAT : 1;                 /**< \brief [10:10] Successful ARU transfer bit (r) */
    Ifx_Strict_32Bit reserved_11 : 5;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SP_CNT : 3;              /**< \brief [18:16] Stack pointer counter value (r) */
    Ifx_Strict_32Bit reserved_19 : 13;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_CTRL_Bits;

/** \\brief  MCS channel 0 error interrupt enable register */
typedef struct _Ifx_GTM_MCS_CH_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit MCS_EIRQ_EN0 : 1;        /**< \brief [0:0] MCS channel x MCS_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit STK_ERR_EIRQ_EN : 1;     /**< \brief [1:1] MCS channel x STK_ERR_IRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit ERR_EIRQ_EN : 1;         /**< \brief [2:2] MCS channel x ERR_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_3 : 29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_EIRQ_EN_Bits;

/** \\brief  MCS channel 0 interrupt enable register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_EN_Bits
{
    Ifx_Strict_32Bit MCS_IRQ_EN : 1;          /**< \brief [0:0] MCS channel x MCS_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit STK_ERR_IRQ_EN : 1;      /**< \brief [1:1] MCS channel x STK_ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit ERR_IRQ_EN : 1;          /**< \brief [2:2] MCS channel x ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_3 : 29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_EN_Bits;

/** \\brief  MCS channel 0 force interrupt register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_MCS_IRQ : 1;         /**< \brief [0:0] Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software (rw) */
    Ifx_Strict_32Bit TRG_STK_ERR_IRQ : 1;     /**< \brief [1:1] Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software (rw) */
    Ifx_Strict_32Bit TRG_ERR_IRQ : 1;         /**< \brief [2:2] Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software (rw) */
    Ifx_Strict_32Bit reserved_3 : 29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits;

/** \\brief  MCS channel 0 IRQ mode configuration register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_MODE_Bits;

/** \\brief  MCS channel 0 interrupt notification register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit MCS_IRQ : 1;             /**< \brief [0:0] Interrupt request by MCS-channel x (rw) */
    Ifx_Strict_32Bit STK_ERR_IRQ : 1;         /**< \brief [1:1] Stack counter overflow/underflow of channel x (rw) */
    Ifx_Strict_32Bit ERR_IRQ : 1;             /**< \brief [2:2] MCS channel x ERR interrupt (rw) */
    Ifx_Strict_32Bit reserved_3 : 29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits;

/** \\brief  MCS channel 0 memory high byte register */
typedef struct _Ifx_GTM_MCS_CH_MHB_Bits
{
    Ifx_Strict_32Bit DATA : 8;                /**< \brief [7:0] Data of memory high bit register MHB (r) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_MHB_Bits;

/** \\brief  MCS channel 0 program counter register */
typedef struct _Ifx_GTM_MCS_CH_PC_Bits
{
    Ifx_Strict_32Bit PC : 16;                 /**< \brief [15:0] Current Program Counter (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_PC_Bits;

/** \\brief  MCS channel 0 general purpose register 0 */
typedef struct _Ifx_GTM_MCS_CH_R0_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data of general purpose register R[y]. (rw) */
    Ifx_Strict_32Bit Reserved : 8;            /**< \brief [31:24] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CH_R0_Bits;

/** \\brief  MCS channel 0 general purpose register 1 */
typedef struct _Ifx_GTM_MCS_CH_R1_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data of general purpose register R[y]. (rw) */
    Ifx_Strict_32Bit Reserved : 8;            /**< \brief [31:24] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CH_R1_Bits;

/** \\brief  MCS channel 0 general purpose register 2 */
typedef struct _Ifx_GTM_MCS_CH_R2_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data of general purpose register R[y]. (rw) */
    Ifx_Strict_32Bit Reserved : 8;            /**< \brief [31:24] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CH_R2_Bits;

/** \\brief  MCS channel 0 general purpose register 3 */
typedef struct _Ifx_GTM_MCS_CH_R3_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data of general purpose register R[y]. (rw) */
    Ifx_Strict_32Bit Reserved : 8;            /**< \brief [31:24] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CH_R3_Bits;

/** \\brief  MCS channel 0 general purpose register 4 */
typedef struct _Ifx_GTM_MCS_CH_R4_Bits
{
    Ifx_Strict_32Bit DATA : 24;               /**< \brief [23:0] Data of general purpose register R[y]. (rw) */
    Ifx_Strict_32Bit Reserved : 8;            /**< \brief [31:24] Read as zero, should be written as zero. (r) */
} Ifx_GTM_MCS_CH_R4_Bits;

