Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  Monitor activity register for MCS 9 */
typedef struct _Ifx_GTM_MON_ACTIVITY_MCS9_Bits
{
    Ifx_Strict_32Bit MCA_0 : 1;               /**< \brief [0:0] Activity of check performed in module MCS[z] at channel 0 (rw) */
    Ifx_Strict_32Bit MCA_1 : 1;               /**< \brief [1:1] Activity of check performed in module MCS[z] at channel 1 (rw) */
    Ifx_Strict_32Bit MCA_2 : 1;               /**< \brief [2:2] Activity of check performed in module MCS[z] at channel 2 (rw) */
    Ifx_Strict_32Bit MCA_3 : 1;               /**< \brief [3:3] Activity of check performed in module MCS[z] at channel 3 (rw) */
    Ifx_Strict_32Bit MCA_4 : 1;               /**< \brief [4:4] Activity of check performed in module MCS[z] at channel 4 (rw) */
    Ifx_Strict_32Bit MCA_5 : 1;               /**< \brief [5:5] Activity of check performed in module MCS[z] at channel 5 (rw) */
    Ifx_Strict_32Bit MCA_6 : 1;               /**< \brief [6:6] Activity of check performed in module MCS[z] at channel 6 (rw) */
    Ifx_Strict_32Bit MCA_7 : 1;               /**< \brief [7:7] Activity of check performed in module MCS[z] at channel 7 (rw) */
    Ifx_Strict_32Bit reserved_8 : 24;         /**< \brief \internal Reserved */
} Ifx_GTM_MON_ACTIVITY_MCS9_Bits;

/** \\brief  Monitor status register */
typedef struct _Ifx_GTM_MON_STATUS_Bits
{
    Ifx_Strict_32Bit ACT_CMU0 : 1;            /**< \brief [0:0] CMU_CLK0 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU1 : 1;            /**< \brief [1:1] CMU_CLK1 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU2 : 1;            /**< \brief [2:2] CMU_CLK2 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU3 : 1;            /**< \brief [3:3] CMU_CLK3 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU4 : 1;            /**< \brief [4:4] CMU_CLK4 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU5 : 1;            /**< \brief [5:5] CMU_CLK5 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU6 : 1;            /**< \brief [6:6] CMU_CLK6 activity (rw) */
    Ifx_Strict_32Bit ACT_CMU7 : 1;            /**< \brief [7:7] CMU_CLK7 activity (rw) */
    Ifx_Strict_32Bit ACT_CMUFX0 : 1;          /**< \brief [8:8] CMU_CLKFX0 activity (rw) */
    Ifx_Strict_32Bit ACT_CMUFX1 : 1;          /**< \brief [9:9] CMU_CLKFX1 activity (rw) */
    Ifx_Strict_32Bit ACT_CMUFX2 : 1;          /**< \brief [10:10] CMU_CLKFX2 activity (rw) */
    Ifx_Strict_32Bit ACT_CMUFX3 : 1;          /**< \brief [11:11] CMU_CLKFX3 activity (rw) */
    Ifx_Strict_32Bit ACT_CMUFX4 : 1;          /**< \brief [12:12] CMU_CLKFX4 activity (rw) */
    Ifx_Strict_32Bit reserved_13 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACT_CMU8 : 1;            /**< \brief [14:14] CMU_CLK8 activity (rw) */
    Ifx_Strict_32Bit reserved_15 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CMP_ERR : 1;             /**< \brief [16:16] Error detected at CMP (r) */
    Ifx_Strict_32Bit reserved_17 : 3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MCS0_ERR : 1;            /**< \brief [20:20] Error detected at MCS0 (r) */
    Ifx_Strict_32Bit MCS1_ERR : 1;            /**< \brief [21:21] Error detected at MCS1 (r) */
    Ifx_Strict_32Bit MCS2_ERR : 1;            /**< \brief [22:22] Error detected at MCS2 (r) */
    Ifx_Strict_32Bit MCS3_ERR : 1;            /**< \brief [23:23] Error detected at MCS3 (r) */
    Ifx_Strict_32Bit MCS4_ERR : 1;            /**< \brief [24:24] Error detected at MCS4 (r) */
    Ifx_Strict_32Bit MCS5_ERR : 1;            /**< \brief [25:25] Error detected at MCS5 (r) */
    Ifx_Strict_32Bit MCS6_ERR : 1;            /**< \brief [26:26] Error detected at MCS6 (r) */
    Ifx_Strict_32Bit MCS7_ERR : 1;            /**< \brief [27:27] Error detected at MCS7 (r) */
    Ifx_Strict_32Bit MCS8_ERR : 1;            /**< \brief [28:28] Error detected at MCS8 (r) */
    Ifx_Strict_32Bit MCS9_ERR : 1;            /**< \brief [29:29] Error detected at MCS9 (r) */
    Ifx_Strict_32Bit reserved_30 : 2;         /**< \brief \internal Reserved */
} Ifx_GTM_MON_STATUS_Bits;

/** \\brief  OCDS TBU3 Trigger Register */
typedef struct _Ifx_GTM_OTBU3T_Bits
{
    Ifx_Strict_32Bit CV : 24;                 /**< \brief [23:0] Compare Value (rw) */
    Ifx_Strict_32Bit reserved_24 : 4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EN : 1;                  /**< \brief [28:28] Enable (rw) */
    Ifx_Strict_32Bit reserved_29 : 3;         /**< \brief \internal Reserved */
} Ifx_GTM_OTBU3T_Bits;

/** \\brief  GTM Version control register */
typedef struct _Ifx_GTM_REV_Bits
{
    Ifx_Strict_32Bit STEP : 8;                /**< \brief [7:0] Release step (r) */
    Ifx_Strict_32Bit NO : 4;                  /**< \brief [11:8] Delivery number (r) */
    Ifx_Strict_32Bit MINOR : 4;               /**< \brief [15:12] Minor version number (r) */
    Ifx_Strict_32Bit MAJOR : 4;               /**< \brief [19:16] Major version number (r) */
    Ifx_Strict_32Bit DEV_CODE0 : 4;           /**< \brief [23:20] Device encoding digit 0 (r) */
    Ifx_Strict_32Bit DEV_CODE1 : 4;           /**< \brief [27:24] Device encoding digit 1 (r) */
    Ifx_Strict_32Bit DEV_CODE2 : 4;           /**< \brief [31:28] Device encoding digit 2 (r) */
} Ifx_GTM_REV_Bits;

/** \\brief  GTM Global reset register */
typedef struct _Ifx_GTM_RST_Bits
{
    Ifx_Strict_32Bit RST : 1;                 /**< \brief [0:0] GTM Reset (rw) */
    Ifx_Strict_32Bit reserved_1 : 26;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRIDGE_MODE_WRDIS : 1;   /**< \brief [27:27] GTM_BRIDGE_MODE write disable (rw) */
    Ifx_Strict_32Bit reserved_28 : 4;         /**< \brief \internal Reserved */
} Ifx_GTM_RST_Bits;

/** \\brief  SPE Command register */
typedef struct _Ifx_GTM_SPE_CMD_Bits
{
    Ifx_Strict_32Bit SPE_CTRL_CMD : 2;        /**< \brief [1:0] SPE control command (rw) */
    Ifx_Strict_32Bit reserved_2 : 14;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SPE_UPD_TRIG : 1;        /**< \brief [16:16] SPE update trigger (rw) */
    Ifx_Strict_32Bit reserved_17 : 15;        /**< \brief \internal Reserved */
} Ifx_GTM_SPE_CMD_Bits;

