Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  SPE Control status register 2 */
typedef struct _Ifx_GTM_SPE_CTRL_STAT2_Bits
{
    Ifx_Strict_32Bit reserved_0 : 8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SPE_PAT_PTR_BWD : 3;     /**< \brief [10:8] Pattern selector for TOM output signals in case of SPE_CTRL_CMD = 0b01 (e.g. backward direction) (rw) */
    Ifx_Strict_32Bit reserved_11 : 21;        /**< \brief \internal Reserved */
} Ifx_GTM_SPE_CTRL_STAT2_Bits;

/** \\brief  SPE Control status register */
typedef struct _Ifx_GTM_SPE_CTRL_STAT_Bits
{
    Ifx_Strict_32Bit EN : 1;                  /**< \brief [0:0] SPE Submodule enable (rw) */
    Ifx_Strict_32Bit SIE0 : 1;                /**< \brief [1:1] SPE Input enable for TIM_CHx(48) (rw) */
    Ifx_Strict_32Bit SIE1 : 1;                /**< \brief [2:2] SPE Input enable for TIM_CHy(48) (rw) */
    Ifx_Strict_32Bit SIE2 : 1;                /**< \brief [3:3] SPE Input enable for TIM_CHz(48) (rw) */
    Ifx_Strict_32Bit TRIG_SEL : 2;            /**< \brief [5:4] Select trigger input signal (rw) */
    Ifx_Strict_32Bit TIM_SEL : 1;             /**< \brief [6:6] Select TIM input signal (rw) */
    Ifx_Strict_32Bit FSOM : 1;                /**< \brief [7:7] Fast Shutoff Mode (rw) */
    Ifx_Strict_32Bit SPE_PAT_PTR : 3;         /**< \brief [10:8] Pattern selector for TOM output signals (rw) */
    Ifx_Strict_32Bit reserved_11 : 1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AIP : 3;                 /**< \brief [14:12] Actual input pattern that was detected by a regular input pattern change. (rw) */
    Ifx_Strict_32Bit ADIR : 1;                /**< \brief [15:15] Actual rotation direction (rw) */
    Ifx_Strict_32Bit PIP : 3;                 /**< \brief [18:16] Previous input pattern that was detected by a regular input pattern change. (rw) */
    Ifx_Strict_32Bit PDIR : 1;                /**< \brief [19:19] Previous rotation direction (rw) */
    Ifx_Strict_32Bit NIP : 3;                 /**< \brief [22:20] New input pattern that was detected (r) */
    Ifx_Strict_32Bit ETRIG_SEL : 1;           /**< \brief [23:23] Extended TRIG_SEL (rw) */
    Ifx_Strict_32Bit FSOL : 8;                /**< \brief [31:24] Fast Shutoff Level for TOM[i] channel 0 to 7 (rw) */
} Ifx_GTM_SPE_CTRL_STAT_Bits;

/** \\brief  SPE Error interrupt enable register. */
typedef struct _Ifx_GTM_SPE_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit SPE_NIPD_EIRQ_EN : 1;    /**< \brief [0:0] SPE_NIPD_EIRQ interrupt enable. (rw) */
    Ifx_Strict_32Bit SPE_DCHG_EIRQ_EN : 1;    /**< \brief [1:1] SPE_DCHG_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit SPE_PERR_EIRQ_EN : 1;    /**< \brief [2:2] SPE_PERR_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit SPE_BIS_EIRQ_EN : 1;     /**< \brief [3:3] SPE_BIS_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit SPE_RCMP_EIRQ_EN : 1;    /**< \brief [4:4] SPE_RCMP_EIRQ error interrupt enable. (rw) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_EIRQ_EN_Bits;

/** \\brief  SPE Interrupt enable register. */
typedef struct _Ifx_GTM_SPE_IRQ_EN_Bits
{
    Ifx_Strict_32Bit SPE_NIPD_IRQ_EN : 1;     /**< \brief [0:0] SPE_NIPD_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit SPE_DCHG_IRQ_EN : 1;     /**< \brief [1:1] SPE_DCHG_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit SPE_PERR_IRQ_EN : 1;     /**< \brief [2:2] SPE_PERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit SPE_BIS_IRQ_EN : 1;      /**< \brief [3:3] SPE_BIS_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit SPE_RCMP_IRQ_EN : 1;     /**< \brief [4:4] SPE_RCMP_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_IRQ_EN_Bits;

/** \\brief  SPE Interrupt generation by software. */
typedef struct _Ifx_GTM_SPE_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_SPE_NIPD : 1;        /**< \brief [0:0] Force interrupt of SPE_NIPD (rw) */
    Ifx_Strict_32Bit TRG_SPE_DCHG : 1;        /**< \brief [1:1] Force interrupt of SPE_DCHG (rw) */
    Ifx_Strict_32Bit TRG_SPE_PERR : 1;        /**< \brief [2:2] Force interrupt of SPE_PERR (rw) */
    Ifx_Strict_32Bit TRG_SPE_BIS : 1;         /**< \brief [3:3] Force interrupt of SPE_BIS (rw) */
    Ifx_Strict_32Bit TRG_SPE_RCMP : 1;        /**< \brief [4:4] Force interrupt of SPE_RCMP (rw) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_IRQ_FORCINT_Bits;

/** \\brief  SPE Interrupt mode configuration register */
typedef struct _Ifx_GTM_SPE_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE : 2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2 : 30;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_IRQ_MODE_Bits;

/** \\brief  SPE Interrupt notification register. */
typedef struct _Ifx_GTM_SPE_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit SPE_NIPD : 1;            /**< \brief [0:0] New input pattern interrupt occurred (rw) */
    Ifx_Strict_32Bit SPE_DCHG : 1;            /**< \brief [1:1] SPE_DIR bit changed on behalf of new input pattern (rw) */
    Ifx_Strict_32Bit SPE_PERR : 1;            /**< \brief [2:2] Wrong or invalid pattern detected at input (rw) */
    Ifx_Strict_32Bit SPE_BIS : 1;             /**< \brief [3:3] Bouncing input signal detected (rw) */
    Ifx_Strict_32Bit SPE_RCMP : 1;            /**< \brief [4:4] SPE revolution counter match event (rw) */
    Ifx_Strict_32Bit reserved_5 : 27;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_IRQ_NOTIFY_Bits;

/** \\brief  SPE output control register */
typedef struct _Ifx_GTM_SPE_OUT_CTRL_Bits
{
    Ifx_Strict_32Bit SPE_OUT_CTRL : 16;       /**< \brief [15:0] SPE output control value for TOM_CH0 to TOM_CH7 (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_SPE_OUT_CTRL_Bits;

/** \\brief  SPE Output definition register */
typedef struct _Ifx_GTM_SPE_OUT_PAT_Bits
{
    Ifx_Strict_32Bit SPE_OUT_PAT : 16;        /**< \brief [15:0] SPE output control value for TOM_CH0 to TOM_CH7 (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_SPE_OUT_PAT_Bits;

/** \\brief  SPE Input pattern definition register. */
typedef struct _Ifx_GTM_SPE_PAT_Bits
{
    Ifx_Strict_32Bit IP0_VAL : 1;             /**< \brief [0:0] Input pattern 0 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP0_PAT : 3;             /**< \brief [3:1] Input pattern 0 (rw) */
    Ifx_Strict_32Bit IP1_VAL : 1;             /**< \brief [4:4] Input pattern 1 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP1_PAT : 3;             /**< \brief [7:5] Input pattern 1 (rw) */
    Ifx_Strict_32Bit IP2_VAL : 1;             /**< \brief [8:8] Input pattern 2 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP2_PAT : 3;             /**< \brief [11:9] Input pattern 2 (rw) */
    Ifx_Strict_32Bit IP3_VAL : 1;             /**< \brief [12:12] Input pattern 3 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP3_PAT : 3;             /**< \brief [15:13] Input pattern 3 (rw) */
    Ifx_Strict_32Bit IP4_VAL : 1;             /**< \brief [16:16] Input pattern 4 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP4_PAT : 3;             /**< \brief [19:17] Input pattern 4 (rw) */
    Ifx_Strict_32Bit IP5_VAL : 1;             /**< \brief [20:20] Input pattern 5 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP5_PAT : 3;             /**< \brief [23:21] Input pattern 5 (rw) */
    Ifx_Strict_32Bit IP6_VAL : 1;             /**< \brief [24:24] Input pattern 6 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP6_PAT : 3;             /**< \brief [27:25] Input pattern 6 (rw) */
    Ifx_Strict_32Bit IP7_VAL : 1;             /**< \brief [28:28] Input pattern 7 is a valid pattern. (rw) */
    Ifx_Strict_32Bit IP7_PAT : 3;             /**< \brief [31:29] Input pattern 7 (rw) */
} Ifx_GTM_SPE_PAT_Bits;

/** \\brief  SPE Revolution counter compare value */
typedef struct _Ifx_GTM_SPE_REV_CMP_Bits
{
    Ifx_Strict_32Bit REV_CMP : 24;            /**< \brief [23:0] Input signal revolution counter compare value (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_REV_CMP_Bits;

/** \\brief  SPE input revolution counter */
typedef struct _Ifx_GTM_SPE_REV_CNT_Bits
{
    Ifx_Strict_32Bit REV_CNT : 24;            /**< \brief [23:0] Input signal revolution counter (rw) */
    Ifx_Strict_32Bit reserved_24 : 8;         /**< \brief \internal Reserved */
} Ifx_GTM_SPE_REV_CNT_Bits;

/** \\brief  TBU channel 0 base */
typedef struct _Ifx_GTM_TBU_CH0_BASE_Bits
{
    Ifx_Strict_32Bit BASE : 27;               /**< \brief [26:0] Time base value for channel 0. (rw) */
    Ifx_Strict_32Bit reserved_27 : 5;         /**< \brief \internal Reserved */
} Ifx_GTM_TBU_CH0_BASE_Bits;

/** \\brief  TBU channel 0 control */
typedef struct _Ifx_GTM_TBU_CH0_CTRL_Bits
{
    Ifx_Strict_32Bit LOW_RES : 1;             /**< \brief [0:0] TBU_CH0_BASE register resolution. (rw) */
    Ifx_Strict_32Bit CH_CLK_SRC : 3;          /**< \brief [3:1] Clock source for channel x (x:0...2) time base counter (rw) */
    Ifx_Strict_32Bit reserved_4 : 28;         /**< \brief \internal Reserved */
} Ifx_GTM_TBU_CH0_CTRL_Bits;

