Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  TOM TGC 1 output enable control register */
typedef struct _Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits
{
    Ifx_Strict_32Bit OUTEN_CTRL0 : 2;         /**< \brief [1:0] Output TOM[i]_CH0_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL1 : 2;         /**< \brief [3:2] Output TOM[i]_CH1_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL2 : 2;         /**< \brief [5:4] Output TOM[i]_CH2_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL3 : 2;         /**< \brief [7:6] Output TOM[i]_CH3_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL4 : 2;         /**< \brief [9:8] Output TOM[i]_CH4_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL5 : 2;         /**< \brief [11:10] Output TOM[i]_CH5_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL6 : 2;         /**< \brief [13:12] Output TOM[i]_CH6_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit OUTEN_CTRL7 : 2;         /**< \brief [15:14] Output TOM[i]_CH7_OUT enable/disable update value (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits;

/** \\brief  TOM TGC 1 output enable status register */
typedef struct _Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits
{
    Ifx_Strict_32Bit OUTEN_STAT0 : 2;         /**< \brief [1:0] Control/status of output TOM[i]_CH0_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT1 : 2;         /**< \brief [3:2] Control/status of output TOM[i]_CH1_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT2 : 2;         /**< \brief [5:4] Control/status of output TOM[i]_CH2_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT3 : 2;         /**< \brief [7:6] Control/status of output TOM[i]_CH3_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT4 : 2;         /**< \brief [9:8] Control/status of output TOM[i]_CH4_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT5 : 2;         /**< \brief [11:10] Control/status of output TOM[i]_CH5_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT6 : 2;         /**< \brief [13:12] Control/status of output TOM[i]_CH6_OUT (rw) */
    Ifx_Strict_32Bit OUTEN_STAT7 : 2;         /**< \brief [15:14] Control/status of output TOM[i]_CH7_OUT (rw) */
    Ifx_Strict_32Bit reserved_16 : 16;        /**< \brief \internal Reserved */
} Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_union
 * \{  */

/** \\brief  ADC Trigger 3Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_ADCTRIG4OUT0_Bits B;
} Ifx_GTM_ADCTRIG4OUT0;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_ADCTRIG4OUT1_Bits B;
} Ifx_GTM_ADCTRIG4OUT1;

/** \\brief  GTM AEI Timeout exception address register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_AEI_ADDR_XPT_Bits B;
} Ifx_GTM_AEI_ADDR_XPT;

/** \\brief  GTM AEI Non zero status register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_AEI_STA_XPT_Bits B;
} Ifx_GTM_AEI_STA_XPT;

/** \\brief  AFD 0 FIFO 0 buffer access register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_AFD_CH_BUF_ACC_Bits B;
} Ifx_GTM_AFD_CH_BUF_ACC;

/** \\brief  ARU 0 dynamic routing control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_CTRL_Bits B;
} Ifx_GTM_ARU_0_DYN_CTRL;

/** \\brief  ARU 0 read ID for dynamic routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_RDADDR_Bits B;
} Ifx_GTM_ARU_0_DYN_RDADDR;

/** \\brief  ARU 0 higher bits of DYN_ROUTE register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                      U;
    /** \brief Signed access */
    signed int                        I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits B;
} Ifx_GTM_ARU_0_DYN_ROUTE_HIGH;

/** \\brief  ARU 0 lower bits of DYN_ROUTE register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits B;
} Ifx_GTM_ARU_0_DYN_ROUTE_LOW;

/** \\brief  ARU 0 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                         U;
    /** \brief Signed access */
    signed int                           I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits B;
} Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH;

/** \\brief  ARU 0 shadow register for ARU_[z]_DYN_ROUTE_LOW */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW_Bits B;
} Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW;

/** \\brief  ARU 1 dynamic routing control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_1_DYN_CTRL_Bits B;
} Ifx_GTM_ARU_1_DYN_CTRL;

/** \\brief  ARU 1 read ID for dynamic routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ARU_1_DYN_RDADDR_Bits B;
} Ifx_GTM_ARU_1_DYN_RDADDR;

