Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  BRC interrupt enable register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_IRQ_EN_Bits B;
} Ifx_GTM_BRC_IRQ_EN;

/** \\brief  BRC force interrupt register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_IRQ_FORCINT_Bits B;
} Ifx_GTM_BRC_IRQ_FORCINT;

/** \\brief  BRC interrupt mode configuration register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_IRQ_MODE_Bits B;
} Ifx_GTM_BRC_IRQ_MODE;

/** \\brief  BRC interrupt notification register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_IRQ_NOTIFY_Bits B;
} Ifx_GTM_BRC_IRQ_NOTIFY;

/** \\brief  BRC software reset register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_RST_Bits B;
} Ifx_GTM_BRC_RST;

/** \\brief  BRC read address for input channel 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_SRC_ADDR_Bits B;
} Ifx_GTM_BRC_SRC_ADDR;

/** \\brief  BRC destination channels for input channel 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_BRC_SRC_DEST_Bits B;
} Ifx_GTM_BRC_SRC_DEST;

/** \\brief  GTM AEI bridge mode register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_BRIDGE_MODE_Bits B;
} Ifx_GTM_BRIDGE_MODE;

/** \\brief  GTM AEI bridge pointer 1 register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_BRIDGE_PTR1_Bits B;
} Ifx_GTM_BRIDGE_PTR1;

/** \\brief  GTM AEI bridge pointer 2 register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_BRIDGE_PTR2_Bits B;
} Ifx_GTM_BRIDGE_PTR2;

/** \\brief  CCM10 Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM10_CFG_Bits B;
} Ifx_GTM_CCM10_CFG;

/** \\brief  CCM10 CMU Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM10_CMU_CLK_CFG_Bits B;
} Ifx_GTM_CCM10_CMU_CLK_CFG;

/** \\brief  CCM10 CMU Fixed Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM10_CMU_FXCLK_CFG_Bits B;
} Ifx_GTM_CCM10_CMU_FXCLK_CFG;

/** \\brief  CCM10 Hardware Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM10_HW_CONF_Bits B;
} Ifx_GTM_CCM10_HW_CONF;

/** \\brief  CCM10 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM10_PROT_Bits B;
} Ifx_GTM_CCM10_PROT;

/** \\brief  CCM11 Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM11_CFG_Bits B;
} Ifx_GTM_CCM11_CFG;

/** \\brief  CCM11 CMU Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM11_CMU_CLK_CFG_Bits B;
} Ifx_GTM_CCM11_CMU_CLK_CFG;

/** \\brief  CCM11 CMU Fixed Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits B;
} Ifx_GTM_CCM11_CMU_FXCLK_CFG;

/** \\brief  CCM11 Hardware Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM11_HW_CONF_Bits B;
} Ifx_GTM_CCM11_HW_CONF;

/** \\brief  CCM11 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM11_PROT_Bits B;
} Ifx_GTM_CCM11_PROT;

/** \\brief  CCM MCS Bus Master Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_AEIM_STA_Bits B;
} Ifx_GTM_CCM_AEIM_STA;

/** \\brief  CCM Address Range Protector 0 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP0_CTRL_Bits B;
} Ifx_GTM_CCM_ARP0_CTRL;

