Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CCM Address Range Protector 0 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP0_PROT_Bits B;
} Ifx_GTM_CCM_ARP0_PROT;

/** \\brief  CCM Address Range Protector 1 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP1_CTRL_Bits B;
} Ifx_GTM_CCM_ARP1_CTRL;

/** \\brief  CCM Address Range Protector 1 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP1_PROT_Bits B;
} Ifx_GTM_CCM_ARP1_PROT;

/** \\brief  CCM Address Range Protector 2 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP2_CTRL_Bits B;
} Ifx_GTM_CCM_ARP2_CTRL;

/** \\brief  CCM Address Range Protector 2 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP2_PROT_Bits B;
} Ifx_GTM_CCM_ARP2_PROT;

/** \\brief  CCM Address Range Protector 3 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP3_CTRL_Bits B;
} Ifx_GTM_CCM_ARP3_CTRL;

/** \\brief  CCM Address Range Protector 3 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP3_PROT_Bits B;
} Ifx_GTM_CCM_ARP3_PROT;

/** \\brief  CCM Address Range Protector 4 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP4_CTRL_Bits B;
} Ifx_GTM_CCM_ARP4_CTRL;

/** \\brief  CCM Address Range Protector 4 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP4_PROT_Bits B;
} Ifx_GTM_CCM_ARP4_PROT;

/** \\brief  CCM Address Range Protector 5 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP5_CTRL_Bits B;
} Ifx_GTM_CCM_ARP5_CTRL;

/** \\brief  CCM Address Range Protector 5 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP5_PROT_Bits B;
} Ifx_GTM_CCM_ARP5_PROT;

/** \\brief  CCM Address Range Protector 6 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP6_CTRL_Bits B;
} Ifx_GTM_CCM_ARP6_CTRL;

/** \\brief  CCM Address Range Protector 6 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP6_PROT_Bits B;
} Ifx_GTM_CCM_ARP6_PROT;

/** \\brief  CCM Address Range Protector 7 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP7_CTRL_Bits B;
} Ifx_GTM_CCM_ARP7_CTRL;

/** \\brief  CCM Address Range Protector 7 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP7_PROT_Bits B;
} Ifx_GTM_CCM_ARP7_PROT;

/** \\brief  CCM Address Range Protector 8 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP8_CTRL_Bits B;
} Ifx_GTM_CCM_ARP8_CTRL;

/** \\brief  CCM Address Range Protector 8 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP8_PROT_Bits B;
} Ifx_GTM_CCM_ARP8_PROT;

/** \\brief  CCM Address Range Protector 9 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP9_CTRL_Bits B;
} Ifx_GTM_CCM_ARP9_CTRL;

/** \\brief  CCM Address Range Protector 9 Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ARP9_PROT_Bits B;
} Ifx_GTM_CCM_ARP9_PROT;

/** \\brief  GTM CCM ATOM Output Level */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_ATOM_OUT_Bits B;
} Ifx_GTM_CCM_ATOM_OUT;

/** \\brief  CCM Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_CFG_Bits B;
} Ifx_GTM_CCM_CFG;

/** \\brief  CCM CMU Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_CMU_CLK_CFG_Bits B;
} Ifx_GTM_CCM_CMU_CLK_CFG;

/** \\brief  CCM CMU Fixed Clock Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits B;
} Ifx_GTM_CCM_CMU_FXCLK_CFG;

/** \\brief  CCM external capture trigger enable */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_EXT_CAP_EN_Bits B;
} Ifx_GTM_CCM_EXT_CAP_EN;

/** \\brief  CCM Hardware Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_HW_CONF_Bits B;
} Ifx_GTM_CCM_HW_CONF;

/** \\brief  CCM Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_PROT_Bits B;
} Ifx_GTM_CCM_PROT;

/** \\brief  CCM TIM module AUX_IN source selection register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits B;
} Ifx_GTM_CCM_TIM_AUX_IN_SRC;

/** \\brief  GTM CCM TOM output level */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_CCM_TOM_OUT_Bits B;
} Ifx_GTM_CCM_TOM_OUT;

/** \\brief  CDTM5 DTM4 channel 0 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH0_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH0_DTV;

/** \\brief  CDTM5 DTM4 channel 1 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH1_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH1_DTV;

