Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CDTM5 DTM4 channel 2 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH2_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH2_DTV;

/** \\brief  CDTM5 DTM4 channel 3 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH3_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH3_DTV;

/** \\brief  CDTM5 DTM4 channel control register 2 shadow */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH_CTRL2_SR_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH_CTRL2_SR;

/** \\brief  CDTM5 DTM4 channel control register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH_CTRL3;

/** \\brief  CDTM5 DTM4 channel shadow register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CH_SR_Bits B;
} Ifx_GTM_CDTM5_DTM4_CH_SR;

/** \\brief  CDTM5 DTM4 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_CTRL_Bits B;
} Ifx_GTM_CDTM5_DTM4_CTRL;

/** \\brief  CDTM5 DTM4 phase shift unit configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM4_PS_CTRL_Bits B;
} Ifx_GTM_CDTM5_DTM4_PS_CTRL;

/** \\brief  CDTM5 DTM5 channel 0 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH0_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH0_DTV;

/** \\brief  CDTM5 DTM5 channel 1 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH1_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH1_DTV;

/** \\brief  CDTM5 DTM5 channel 2 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH2_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH2_DTV;

/** \\brief  CDTM5 DTM5 channel 3 dead t5me reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH3_DTV_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH3_DTV;

/** \\brief  CDTM5 DTM5 channel control register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL1_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH_CTRL1;

/** \\brief  CDTM5 DTM5 channel control register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL2_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH_CTRL2;

/** \\brief  CDTM5 DTM5 channel control register 2 shadow */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL2_SR_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH_CTRL2_SR;

/** \\brief  CDTM5 DTM5 channel control register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL3_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH_CTRL3;

/** \\brief  CDTM5 DTM5 channel shadow register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CH_SR_Bits B;
} Ifx_GTM_CDTM5_DTM5_CH_SR;

/** \\brief  CDTM5 DTM5 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_CTRL_Bits B;
} Ifx_GTM_CDTM5_DTM5_CTRL;

/** \\brief  CDTM5 DTM5 phase shift unit configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits B;
} Ifx_GTM_CDTM5_DTM5_PS_CTRL;

/** \\brief  CDTM6 DTM4 channel 0 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH0_DTV;

/** \\brief  CDTM6 DTM4 channel 1 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH1_DTV;

/** \\brief  CDTM6 DTM4 channel 2 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH2_DTV;

