Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  CDTM6 DTM4 channel 3 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH3_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH3_DTV;

/** \\brief  CDTM6 DTM4 channel control register 2 shadow */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR;

/** \\brief  CDTM6 DTM4 channel control register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH_CTRL3;

/** \\brief  CDTM6 DTM4 channel shadow register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CH_SR_Bits B;
} Ifx_GTM_CDTM6_DTM4_CH_SR;

/** \\brief  CDTM6 DTM4 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_CTRL_Bits B;
} Ifx_GTM_CDTM6_DTM4_CTRL;

/** \\brief  CDTM6 DTM4 phase shift unit configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM4_PS_CTRL_Bits B;
} Ifx_GTM_CDTM6_DTM4_PS_CTRL;

/** \\brief  CDTM6 DTM5 channel 0 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH0_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH0_DTV;

/** \\brief  CDTM6 DTM5 channel 1 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH1_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH1_DTV;

/** \\brief  CDTM6 DTM5 channel 2 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH2_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH2_DTV;

/** \\brief  CDTM6 DTM5 channel 3 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH3_DTV_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH3_DTV;

/** \\brief  CDTM6 DTM5 channel control register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL1_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH_CTRL1;

/** \\brief  CDTM6 DTM5 channel control register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL2_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH_CTRL2;

/** \\brief  CDTM6 DTM5 channel control register 2 shadow */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL2_SR_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH_CTRL2_SR;

/** \\brief  CDTM6 DTM5 channel control register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL3_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH_CTRL3;

/** \\brief  CDTM6 DTM5 channel shadow register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CH_SR_Bits B;
} Ifx_GTM_CDTM6_DTM5_CH_SR;

/** \\brief  CDTM6 DTM5 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_CTRL_Bits B;
} Ifx_GTM_CDTM6_DTM5_CTRL;

/** \\brief  CDTM6 DTM5 phase shift unit configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits B;
} Ifx_GTM_CDTM6_DTM5_PS_CTRL;

/** \\brief  CDTM0 DTM2 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM2_CTRL_Bits B;
} Ifx_GTM_CDTM_DTM2_CTRL;

/** \\brief  CDTM0 DTM3 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM3_CTRL_Bits B;
} Ifx_GTM_CDTM_DTM3_CTRL;

/** \\brief  CDTM0 DTM0 channel control register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits B;
} Ifx_GTM_CDTM_DTM_CH_CTRL1;

/** \\brief  CDTM0 DTM0 channel control register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits B;
} Ifx_GTM_CDTM_DTM_CH_CTRL2;

/** \\brief  CDTM0 DTM0 channel control register 2 shadow */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                      U;
    /** \brief Signed access */
    signed int                        I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits B;
} Ifx_GTM_CDTM_DTM_CH_CTRL2_SR;

/** \\brief  CDTM0 DTM0 channel control register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits B;
} Ifx_GTM_CDTM_DTM_CH_CTRL3;

/** \\brief  CDTM0 DTM0 channel 0 dead time reload values */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_DTV_Bits B;
} Ifx_GTM_CDTM_DTM_CH_DTV;

/** \\brief  CDTM DTM0 channel shadow reg0ster */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CH_SR_Bits B;
} Ifx_GTM_CDTM_DTM_CH_SR;

/** \\brief  CDTM0 DTM0 global configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_CTRL_Bits B;
} Ifx_GTM_CDTM_DTM_CTRL;

/** \\brief  CDTM0 DTM0 phase shift unit configuration and control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_CDTM_DTM_PS_CTRL_Bits B;
} Ifx_GTM_CDTM_DTM_PS_CTRL;

/** \\brief  GTM Configuration register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_GTM_CFG_Bits B;
} Ifx_GTM_CFG;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_GTM_CLC_Bits B;
} Ifx_GTM_CLC;

