Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Minimum CDT_T Nominal Value Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTN_MIN_Bits B;
} Ifx_GTM_DPLL_CTN_MIN;

/** \\brief  DPLL Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_0_Bits B;
} Ifx_GTM_DPLL_CTRL_0;

/** \\brief  DPLL Control 0 Shadow STATE Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                          U;
    /** \brief Signed access */
    signed int                            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits B;
} Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE;

/** \\brief  DPLL Control 0 Shadow Trigger Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                            U;
    /** \brief Signed access */
    signed int                              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits B;
} Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER;

/** \\brief  DPLL Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_1_Bits B;
} Ifx_GTM_DPLL_CTRL_1;

/** \\brief  DPLL Control Register 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_11_Bits B;
} Ifx_GTM_DPLL_CTRL_11;

/** \\brief  DPLL Control 1 Shadow STATE Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                          U;
    /** \brief Signed access */
    signed int                            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits B;
} Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE;

/** \\brief  DPLL Control 1 Shadow TRIGGER Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                            U;
    /** \brief Signed access */
    signed int                              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits B;
} Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER;

/** \\brief  DPLL Control Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_2_Bits B;
} Ifx_GTM_DPLL_CTRL_2;

/** \\brief  DPLL Control Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_3_Bits B;
} Ifx_GTM_DPLL_CTRL_3;

/** \\brief  DPLL Control Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_4_Bits B;
} Ifx_GTM_DPLL_CTRL_4;

/** \\brief  DPLL Control Register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_5_Bits B;
} Ifx_GTM_DPLL_CTRL_5;

/** \\brief  DPLL Extension register for DPLL_CTRL) */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_CTRL_EXT_Bits B;
} Ifx_GTM_DPLL_CTRL_EXT;

/** \\brief  DPLL ACTION Time To React Before PSAz */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DLA_Bits B;
} Ifx_GTM_DPLL_DLA;

/** \\brief  DPLL Nominal STATE Increment Duration in FULL_SCALE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DT_S_Bits B;
} Ifx_GTM_DPLL_DT_S;

/** \\brief  DPLL Duration of the Last STATE Increment */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DT_S_ACT_Bits B;
} Ifx_GTM_DPLL_DT_S_ACT;

/** \\brief  DPLL Start Value of DPLL_DT_S_ACT for the first Increment after
 * SIP2 is set to 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DT_S_START_Bits B;
} Ifx_GTM_DPLL_DT_S_START;

/** \\brief  DPLL Duration of the Last TRIGGER Increment */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DT_T_ACT_Bits B;
} Ifx_GTM_DPLL_DT_T_ACT;

/** \\brief  DPLL Start Value of DPLL_DT_T_ACT for the first Increment after
 * SIP1 is set to 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DT_T_START_Bits B;
} Ifx_GTM_DPLL_DT_T_START;

/** \\brief  DPLL Calculated Relative TIME To ACTION */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_DTA_Bits B;
} Ifx_GTM_DPLL_DTA;

/** \\brief  DPLL Difference of Prediction to Actual Value of the Last STATE
 * Increment */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_EDT_S_Bits B;
} Ifx_GTM_DPLL_EDT_S;

/** \\brief  DPLL Difference of Prediction to Actual Value of the Last TRIGGER
 * Increment */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_EDT_T_Bits B;
} Ifx_GTM_DPLL_EDT_T;

/** \\brief  DPLL Error Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_EIRQ_EN_Bits B;
} Ifx_GTM_DPLL_EIRQ_EN;

/** \\brief  DPLL Actual STATE Filter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_FTV_S_Bits B;
} Ifx_GTM_DPLL_FTV_S;

