Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Actual TRIGGER Filter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_FTV_T_Bits B;
} Ifx_GTM_DPLL_FTV_T;

/** \\brief  DPLL ID Information For Input Signal PMT 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_ID_PMTR_Bits B;
} Ifx_GTM_DPLL_ID_PMTR;

/** \\brief  DPLL Counter for Pulses for TBU_CH1_BASE to be sent in Automatic
 * End Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INC_CNT1_Bits B;
} Ifx_GTM_DPLL_INC_CNT1;

/** \\brief  DPLL INC_CNT1 Trigger Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INC_CNT1_MASK_Bits B;
} Ifx_GTM_DPLL_INC_CNT1_MASK;

/** \\brief  DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End
 * Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INC_CNT2_Bits B;
} Ifx_GTM_DPLL_INC_CNT2;

/** \\brief  DPLL INC_CNT2 Trigger Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INC_CNT2_MASK_Bits B;
} Ifx_GTM_DPLL_INC_CNT2_MASK;

/** \\brief  DPLL Start Value of the ADD_IN_ADDER1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INCF1_OFFSET_Bits B;
} Ifx_GTM_DPLL_INCF1_OFFSET;

/** \\brief  DPLL Start Value of the ADD_IN_ADDER2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_INCF2_OFFSET_Bits B;
} Ifx_GTM_DPLL_INCF2_OFFSET;

/** \\brief  DPLL Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_IRQ_EN_Bits B;
} Ifx_GTM_DPLL_IRQ_EN;

/** \\brief  DPLL Interrupt Force Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_IRQ_FORCINT_Bits B;
} Ifx_GTM_DPLL_IRQ_FORCINT;

/** \\brief  DPLL Interrupt Mode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_IRQ_MODE_Bits B;
} Ifx_GTM_DPLL_IRQ_MODE;

/** \\brief  DPLL Interrupt Notification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_IRQ_NOTIFY_Bits B;
} Ifx_GTM_DPLL_IRQ_NOTIFY;

/** \\brief  DPLL Weighted Difference of Prediction Errors of STATE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MEDT_S_Bits B;
} Ifx_GTM_DPLL_MEDT_S;

/** \\brief  DPLL Weighted Difference of Prediction Errors of TRIGGER */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MEDT_T_Bits B;
} Ifx_GTM_DPLL_MEDT_T;

/** \\brief  DPLL Calculated Number of Sub-Pulses between two nominal STATE
 * Events for SMC=0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MLS1_Bits B;
} Ifx_GTM_DPLL_MLS1;

/** \\brief  DPLL Calculated Number of Sub-Pulses between two nominal STATE
 * Events for SMC=1 and RMO=1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MLS2_Bits B;
} Ifx_GTM_DPLL_MLS2;

/** \\brief  DPLL Missing Pulses to be Added or Subtracted Directly 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MPVAL1_Bits B;
} Ifx_GTM_DPLL_MPVAL1;

/** \\brief  DPLL Missing Pulses to be Added or Subtracted Directly 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_MPVAL2_Bits B;
} Ifx_GTM_DPLL_MPVAL2;

/** \\brief  DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NA_Bits B;
} Ifx_GTM_DPLL_NA;

/** \\brief  DPLL Number of Pulses to be Sent in Emergency Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_S_Bits B;
} Ifx_GTM_DPLL_NMB_S;

/** \\brief  DPLL Target Number of Pulses to be Sent in Emergency Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_S_TAR_Bits B;
} Ifx_GTM_DPLL_NMB_S_TAR;

/** \\brief  DPLL Last but one Target Number of Pulses to be Sent in Emergency
 * Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits B;
} Ifx_GTM_DPLL_NMB_S_TAR_OLD;

/** \\brief  DPLL Number of Pulses to be Sent in Normal Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_T_Bits B;
} Ifx_GTM_DPLL_NMB_T;

/** \\brief  DPLL Target Number of Pulses to be Sent in Normal Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_T_TAR_Bits B;
} Ifx_GTM_DPLL_NMB_T_TAR;

