Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Last but one Target Number of Pulses to be Sent in Normal Mode */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits B;
} Ifx_GTM_DPLL_NMB_T_TAR_OLD;

/** \\brief  DPLL Number of Active TRIGGER Events to Interrupt */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NTI_CNT_Bits B;
} Ifx_GTM_DPLL_NTI_CNT;

/** \\brief  DPLL Number of Recent STATE Events Used for Calculations */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NUSC_Bits B;
} Ifx_GTM_DPLL_NUSC;

/** \\brief  DPLL Extension register number 1 for DPLL_NUSC 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NUSC_EXT1_Bits B;
} Ifx_GTM_DPLL_NUSC_EXT1;

/** \\brief  DPLL Extension register number 2 for DPLL_NUSC 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NUSC_EXT2_Bits B;
} Ifx_GTM_DPLL_NUSC_EXT2;

/** \\brief  DPLL Number of Recent TRIGGER Events Used for Calculations */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_NUTC_Bits B;
} Ifx_GTM_DPLL_NUTC;

/** \\brief  DPLL Offset And Switch Old/New Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_OSW_Bits B;
} Ifx_GTM_DPLL_OSW;

/** \\brief  DPLL Projected Increment Sum Relations for Action 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_0_Bits B;
} Ifx_GTM_DPLL_PDT_0;

/** \\brief  DPLL Projected Increment Sum Relations for Action 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_1_Bits B;
} Ifx_GTM_DPLL_PDT_1;

/** \\brief  DPLL Projected Increment Sum Relations for Action 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_10_Bits B;
} Ifx_GTM_DPLL_PDT_10;

/** \\brief  DPLL Projected Increment Sum Relations for Action 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_11_Bits B;
} Ifx_GTM_DPLL_PDT_11;

/** \\brief  DPLL Projected Increment Sum Relations for Action 12 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_12_Bits B;
} Ifx_GTM_DPLL_PDT_12;

/** \\brief  DPLL Projected Increment Sum Relations for Action 13 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_13_Bits B;
} Ifx_GTM_DPLL_PDT_13;

/** \\brief  DPLL Projected Increment Sum Relations for Action 14 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_14_Bits B;
} Ifx_GTM_DPLL_PDT_14;

/** \\brief  DPLL Projected Increment Sum Relations for Action 15 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_15_Bits B;
} Ifx_GTM_DPLL_PDT_15;

/** \\brief  DPLL Projected Increment Sum Relations for Action 16 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_16_Bits B;
} Ifx_GTM_DPLL_PDT_16;

/** \\brief  DPLL Projected Increment Sum Relations for Action 17 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_17_Bits B;
} Ifx_GTM_DPLL_PDT_17;

/** \\brief  DPLL Projected Increment Sum Relations for Action 18 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_18_Bits B;
} Ifx_GTM_DPLL_PDT_18;

/** \\brief  DPLL Projected Increment Sum Relations for Action 19 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_19_Bits B;
} Ifx_GTM_DPLL_PDT_19;

/** \\brief  DPLL Projected Increment Sum Relations for Action 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_2_Bits B;
} Ifx_GTM_DPLL_PDT_2;

/** \\brief  DPLL Projected Increment Sum Relations for Action 20 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_20_Bits B;
} Ifx_GTM_DPLL_PDT_20;

/** \\brief  DPLL Projected Increment Sum Relations for Action 21 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_21_Bits B;
} Ifx_GTM_DPLL_PDT_21;

