Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL Projected Increment Sum Relations for Action 22 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_22_Bits B;
} Ifx_GTM_DPLL_PDT_22;

/** \\brief  DPLL Projected Increment Sum Relations for Action 23 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_23_Bits B;
} Ifx_GTM_DPLL_PDT_23;

/** \\brief  DPLL Projected Increment Sum Relations for Action 24 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_24_Bits B;
} Ifx_GTM_DPLL_PDT_24;

/** \\brief  DPLL Projected Increment Sum Relations for Action 25 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_25_Bits B;
} Ifx_GTM_DPLL_PDT_25;

/** \\brief  DPLL Projected Increment Sum Relations for Action 26 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_26_Bits B;
} Ifx_GTM_DPLL_PDT_26;

/** \\brief  DPLL Projected Increment Sum Relations for Action 27 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_27_Bits B;
} Ifx_GTM_DPLL_PDT_27;

/** \\brief  DPLL Projected Increment Sum Relations for Action 28 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_28_Bits B;
} Ifx_GTM_DPLL_PDT_28;

/** \\brief  DPLL Projected Increment Sum Relations for Action 29 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_29_Bits B;
} Ifx_GTM_DPLL_PDT_29;

/** \\brief  DPLL Projected Increment Sum Relations for Action 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_3_Bits B;
} Ifx_GTM_DPLL_PDT_3;

/** \\brief  DPLL Projected Increment Sum Relations for Action 30 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_30_Bits B;
} Ifx_GTM_DPLL_PDT_30;

/** \\brief  DPLL Projected Increment Sum Relations for Action 31 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_31_Bits B;
} Ifx_GTM_DPLL_PDT_31;

/** \\brief  DPLL Projected Increment Sum Relations for Action 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_4_Bits B;
} Ifx_GTM_DPLL_PDT_4;

/** \\brief  DPLL Projected Increment Sum Relations for Action 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_5_Bits B;
} Ifx_GTM_DPLL_PDT_5;

/** \\brief  DPLL Projected Increment Sum Relations for Action 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_6_Bits B;
} Ifx_GTM_DPLL_PDT_6;

/** \\brief  DPLL Projected Increment Sum Relations for Action 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_7_Bits B;
} Ifx_GTM_DPLL_PDT_7;

/** \\brief  DPLL Projected Increment Sum Relations for Action 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_8_Bits B;
} Ifx_GTM_DPLL_PDT_8;

/** \\brief  DPLL Projected Increment Sum Relations for Action 9 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PDT_9_Bits B;
} Ifx_GTM_DPLL_PDT_9;

/** \\brief  DPLL ACTION Position/Value Request */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSA_Bits B;
} Ifx_GTM_DPLL_PSA;

/** \\brief  DPLL ACTION Position/Value Action 0 Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSAC_Bits B;
} Ifx_GTM_DPLL_PSAC;

/** \\brief  DPLL Actual Calculated Position Stamp of STATE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSSC_Bits B;
} Ifx_GTM_DPLL_PSSC;

/** \\brief  DPLL Measured Position Stamp at Last STATE Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSSM_Bits B;
} Ifx_GTM_DPLL_PSSM;

/** \\brief  DPLL Measured Position Stamp at Last but one STATE Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSSM_OLD_Bits B;
} Ifx_GTM_DPLL_PSSM_OLD;

/** \\brief  DPLL Actual Calculated Position Stamp of TRIGGER */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSTC_Bits B;
} Ifx_GTM_DPLL_PSTC;

/** \\brief  DPLL Measured Position Stamp at Last TRIGGER Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSTM_Bits B;
} Ifx_GTM_DPLL_PSTM;

/** \\brief  DPLL Measured Position Stamp at Last but one TRIGGER Input */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PSTM_OLD_Bits B;
} Ifx_GTM_DPLL_PSTM_OLD;

/** \\brief  DPLL Plausibility Value of Next TRIGGER Slope */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_GTM_DPLL_PVT_Bits B;
} Ifx_GTM_DPLL_PVT;

