Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  FIFO0 channel 0 force interrupt register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits B;
} Ifx_GTM_FIFO_CH_IRQ_FORCINT;

/** \\brief  FIFO0 channel 0 interrupt mode control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_IRQ_MODE_Bits B;
} Ifx_GTM_FIFO_CH_IRQ_MODE;

/** \\brief  FIFO0 channel 0 interrupt notification register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits B;
} Ifx_GTM_FIFO_CH_IRQ_NOTIFY;

/** \\brief  FIFO0 channel 0 lower watermark register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_LOWER_WM_Bits B;
} Ifx_GTM_FIFO_CH_LOWER_WM;

/** \\brief  FIFO0 channel 0 read pointer register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_RD_PTR_Bits B;
} Ifx_GTM_FIFO_CH_RD_PTR;

/** \\brief  FIFO0 channel 0 start address register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_START_ADDR_Bits B;
} Ifx_GTM_FIFO_CH_START_ADDR;

/** \\brief  FIFO0 channel 0 status register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_STATUS_Bits B;
} Ifx_GTM_FIFO_CH_STATUS;

/** \\brief  FIFO0 channel 0 upper watermark register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_UPPER_WM_Bits B;
} Ifx_GTM_FIFO_CH_UPPER_WM;

/** \\brief  FIFO0 channel 0 write pointer register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_FIFO_CH_WR_PTR_Bits B;
} Ifx_GTM_FIFO_CH_WR_PTR;

/** \\brief  GTM Hardware Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_HW_CONF_Bits B;
} Ifx_GTM_HW_CONF;

/** \\brief  ICM Interrupt group register covering infrastructure and safety
 * components ARU, BRC, AEI, PSM0, PSM1, MAP, CMP,SPE */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_0_Bits B;
} Ifx_GTM_ICM_IRQG_0;

/** \\brief  ICM Interrupt group register covering DPLL */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_1_Bits B;
} Ifx_GTM_ICM_IRQG_1;

/** \\brief  ICM Interrupt group register covering GTM output sub-modules ATOM4
 * to ATOM7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_10_Bits B;
} Ifx_GTM_ICM_IRQG_10;

/** \\brief  ICM Interrupt group register covering GTM output sub-modules ATOM8
 * to ATOM11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_11_Bits B;
} Ifx_GTM_ICM_IRQG_11;

/** \\brief  ICM Interrupt group register covering TIM0, TIM1, TIM2, TIM3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_2_Bits B;
} Ifx_GTM_ICM_IRQG_2;

/** \\brief  ICM Interrupt group register covering TIM4, TIM5, TIM6, TIM7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_3_Bits B;
} Ifx_GTM_ICM_IRQG_3;

/** \\brief  ICM Interrupt group register covering MCS0 to MCS3 sub-modules */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_4_Bits B;
} Ifx_GTM_ICM_IRQG_4;

/** \\brief  ICM Interrupt group register covering MCS4 to MCS6 sub-modules */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_5_Bits B;
} Ifx_GTM_ICM_IRQG_5;

/** \\brief  ICM Interrupt group register covering GTM output sub-modules TOM0
 * to TOM1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_6_Bits B;
} Ifx_GTM_ICM_IRQG_6;

/** \\brief  ICM Interrupt group register covering GTM output sub-modules TOM2
 * to TOM3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_7_Bits B;
} Ifx_GTM_ICM_IRQG_7;

