Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group register covering GTM output sub-modules TOM4
 * to TOM5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_8_Bits B;
} Ifx_GTM_ICM_IRQG_8;

/** \\brief  ICM Interrupt group register covering GTM output sub-modules ATOM0,
 * ATOM1, ATOM2 and ATOM3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_9_Bits B;
} Ifx_GTM_ICM_IRQG_9;

/** \\brief  ICM Interrupt group ATOM 0 for Channel Interrupt information of
 * ATOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_ATOM_0_CI_Bits B;
} Ifx_GTM_ICM_IRQG_ATOM_0_CI;

/** \\brief  ICM Interrupt group ATOM 1 for Channel Interrupt information of
 * ATOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_ATOM_1_CI_Bits B;
} Ifx_GTM_ICM_IRQG_ATOM_1_CI;

/** \\brief  ICM Interrupt group ATOM 2 for Channel Interrupt information of
 * ATOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits B;
} Ifx_GTM_ICM_IRQG_ATOM_2_CI;

/** \\brief  ICM Interrupt group register 0 for channel error interrupt
 * information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CEI0_Bits B;
} Ifx_GTM_ICM_IRQG_CEI0;

/** \\brief  ICM Interrupt group register 1 for channel error interrupt
 * information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CEI1_Bits B;
} Ifx_GTM_ICM_IRQG_CEI1;

/** \\brief  ICM Interrupt group register 2 for channel error interrupt
 * information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CEI2_Bits B;
} Ifx_GTM_ICM_IRQG_CEI2;

/** \\brief  ICM Interrupt group register 3 for channel error interrupt
 * information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CEI3_Bits B;
} Ifx_GTM_ICM_IRQG_CEI3;

/** \\brief  ICM Interrupt group register 4 for channel error interrupt
 * information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CEI4_Bits B;
} Ifx_GTM_ICM_IRQG_CEI4;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits B;
} Ifx_GTM_ICM_IRQG_CLS_0_MEI;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CLS_1_MEI_Bits B;
} Ifx_GTM_ICM_IRQG_CLS_1_MEI;

/** \\brief  ICM Interrupt group for module Error Interrupt information for each
 * TIMm, MCSm, SPEm, FIFOm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits B;
} Ifx_GTM_ICM_IRQG_CLS_2_MEI;

/** \\brief  ICM Interrupt group MCS 0 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS0_CEI;

/** \\brief  ICM Interrupt group MCS 0 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS0_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS0_CI;

/** \\brief  ICM Interrupt group MCS 1 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS1_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS1_CEI;

/** \\brief  ICM Interrupt group MCS 1 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS1_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS1_CI;

/** \\brief  ICM Interrupt group MCS 2 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS2_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS2_CEI;

/** \\brief  ICM Interrupt group MCS 2 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS2_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS2_CI;

