Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group MCS 3 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS3_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS3_CEI;

/** \\brief  ICM Interrupt group MCS 3 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS3_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS3_CI;

/** \\brief  ICM Interrupt group MCS 4 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS4_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS4_CEI;

/** \\brief  ICM Interrupt group MCS 4 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS4_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS4_CI;

/** \\brief  ICM Interrupt group MCS 5 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS5_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS5_CEI;

/** \\brief  ICM Interrupt group MCS 5 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS5_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS5_CI;

/** \\brief  ICM Interrupt group MCS 6 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS6_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS6_CEI;

/** \\brief  ICM Interrupt group MCS 6 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS6_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS6_CI;

/** \\brief  ICM Interrupt group MCS 7 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS7_CEI;

/** \\brief  ICM Interrupt group MCS 7 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS7_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS7_CI;

/** \\brief  ICM Interrupt group MCS 8 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS8_CEI;

/** \\brief  ICM Interrupt group MCS 8 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS8_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS8_CI;

/** \\brief  ICM Interrupt group MCS 9 for Channel Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS9_CEI;

/** \\brief  ICM Interrupt group MCS 9 for Channel Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MCS9_CI_Bits B;
} Ifx_GTM_ICM_IRQG_MCS9_CI;

/** \\brief  ICM Interrupt group register for module error interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_MEI_Bits B;
} Ifx_GTM_ICM_IRQG_MEI;

/** \\brief  ICM Interrupt group PSM 0 for Channel Error Interrupt information
 * of FIFO0, FIFO1, FIFO2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_PSM_0_CEI;

/** \\brief  ICM Interrupt group PSM 0 for Channel Interrupt information of
 * FIFO0, FIFO1, FIFO2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits B;
} Ifx_GTM_ICM_IRQG_PSM_0_CI;

/** \\brief  ICM Interrupt group SPE for module Error Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_SPE_CEI_Bits B;
} Ifx_GTM_ICM_IRQG_SPE_CEI;

/** \\brief  ICM Interrupt group SPE for module Interrupt information */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_SPE_CI_Bits B;
} Ifx_GTM_ICM_IRQG_SPE_CI;

