Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  ICM Interrupt group TOM 0 for Channel Interrupt information of TOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits B;
} Ifx_GTM_ICM_IRQG_TOM_0_CI;

/** \\brief  ICM Interrupt group TOM 1 for Channel Interrupt information of TOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits B;
} Ifx_GTM_ICM_IRQG_TOM_1_CI;

/** \\brief  ICM Interrupt group TOM 2 for Channel Interrupt information of TOMm */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits B;
} Ifx_GTM_ICM_IRQG_TOM_2_CI;

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ACCEN0_Bits B;
} Ifx_GTM_INOUTSEL_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ACCEN1_Bits B;
} Ifx_GTM_INOUTSEL_ACCEN1;

/** \\brief  ADC Trigger 0 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT00;

/** \\brief  ADC Trigger 0 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT01;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT10;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT11;

/** \\brief  ADC Trigger 2 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT20;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT21;

/** \\brief  ADC Trigger 3Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT30;

/** \\brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits B;
} Ifx_GTM_INOUTSEL_ADCTRIG_OUT31;

/** \\brief  CAN Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits B;
} Ifx_GTM_INOUTSEL_CAN_OUTSEL;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN0_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN0;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN1_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN1;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN2_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN2;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN3_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN3;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN4_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN4;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN5_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN5;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN6_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN6;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN7_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN7;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN8_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN8;

/** \\brief  Data Input n Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DATA_IN9_Bits B;
} Ifx_GTM_INOUTSEL_DATA_IN9;

