Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DSADC Input Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                      U;
    /** \brief Signed access */
    signed int                        I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits B;
} Ifx_GTM_INOUTSEL_DSADC_INSEL;

/** \\brief  DSADC Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits B;
} Ifx_GTM_INOUTSEL_DSADC_OUTSEL0;

/** \\brief  DSADC Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits B;
} Ifx_GTM_INOUTSEL_DSADC_OUTSEL1;

/** \\brief  Data Exchange Input Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                  U;
    /** \brief Signed access */
    signed int                    I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DXINCON_Bits B;
} Ifx_GTM_INOUTSEL_DXINCON;

/** \\brief  Data Exchange Output Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_DXOUTCON_Bits B;
} Ifx_GTM_INOUTSEL_DXOUTCON;

/** \\brief  I0terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT0_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT0;

/** \\brief  I1terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT1_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT1;

/** \\brief  I2terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT2_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT2;

/** \\brief  I3terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT3_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT3;

/** \\brief  I4terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT4_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT4;

/** \\brief  I5terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT5_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT5;

/** \\brief  I6terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT6_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT6;

/** \\brief  I7terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT7_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT7;

/** \\brief  I8terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT8_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT8;

/** \\brief  I9terrupt Output Register n */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_INT_OUT9_Bits B;
} Ifx_GTM_INOUTSEL_INT_OUT9;

/** \\brief  MCS Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MCSINTCLR_Bits B;
} Ifx_GTM_INOUTSEL_MCSINTCLR;

/** \\brief  MCS Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits B;
} Ifx_GTM_INOUTSEL_MCSINTSTAT;

/** \\brief  Trigger Output Sel Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits B;
} Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL;

/** \\brief  MSC0 Input High Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits B;
} Ifx_GTM_INOUTSEL_MSC_IN_INHCON;

/** \\brief  MSC0 Input Low Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                        U;
    /** \brief Signed access */
    signed int                          I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_IN_INLCON_Bits B;
} Ifx_GTM_INOUTSEL_MSC_IN_INLCON;

/** \\brief  MSC0 Input Low Extended Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                           U;
    /** \brief Signed access */
    signed int                             I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits B;
} Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON;

/** \\brief  MSC Set 1 Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET1CON0;

