Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 1 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET1CON1;

/** \\brief  MSC Set 1 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET1CON2;

/** \\brief  MSC Set 1 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET1CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET1CON3;

/** \\brief  MSC Set 2 Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET2CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET2CON0;

/** \\brief  MSC Set 2 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET2CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET2CON1;

/** \\brief  MSC Set 2 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET2CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET2CON2;

/** \\brief  MSC Set 2 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET2CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET2CON3;

/** \\brief  MSC Set 3Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET3CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET3CON0;

/** \\brief  MSC Set 3Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET3CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET3CON1;

/** \\brief  MSC Set 3 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET3CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET3CON2;

/** \\brief  MSC Set 3 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET3CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET3CON3;

/** \\brief  MSC Set 4 Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET4CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET4CON0;

/** \\brief  MSC Set 4 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET4CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET4CON1;

/** \\brief  MSC Set 4 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET4CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET4CON2;

/** \\brief  MSC Set 4 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET4CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET4CON3;

/** \\brief  MSC Set 5 Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET5CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET5CON0;

/** \\brief  MSC Set 5 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET5CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET5CON1;

/** \\brief  MSC Set 5 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET5CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET5CON2;

/** \\brief  MSC Set 5 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET5CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET5CON3;

/** \\brief  MSC Set 6 Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET6CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET6CON0;

/** \\brief  MSC Set 6 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET6CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET6CON1;

