Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MSC Set 6 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET6CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET6CON2;

/** \\brief  MSC Set 6 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET6CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET6CON3;

/** \\brief  MSC Set 7Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET7CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET7CON0;

/** \\brief  MSC Set 7 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET7CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET7CON1;

/** \\brief  MSC Set 7 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET7CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET7CON2;

/** \\brief  MSC Set 7 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET7CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET7CON3;

/** \\brief  MSC Set 8Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET8CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET8CON0;

/** \\brief  MSC Set 8 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET8CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET8CON1;

/** \\brief  MSC Set 8 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET8CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET8CON2;

/** \\brief  MSC Set 8 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET8CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET8CON3;

/** \\brief  MSC Set 9Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET9CON0_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET9CON0;

/** \\brief  MSC Set 9 Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET9CON1_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET9CON1;

/** \\brief  MSC Set 9 Control 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET9CON2_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET9CON2;

/** \\brief  MSC Set 9 Control 3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits B;
} Ifx_GTM_INOUTSEL_MSC_SET9CON3;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OCS_Bits B;
} Ifx_GTM_INOUTSEL_OCS;

/** \\brief  OCDS Debug Access Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_ODA_Bits B;
} Ifx_GTM_INOUTSEL_ODA;

/** \\brief  OCDS TBU0 Trigger Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTBU0T_Bits B;
} Ifx_GTM_INOUTSEL_OTBU0T;

/** \\brief  OCDS TBU1 Trigger Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTBU1T_Bits B;
} Ifx_GTM_INOUTSEL_OTBU1T;

/** \\brief  OCDS TBU2 Trigger Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTBU2T_Bits B;
} Ifx_GTM_INOUTSEL_OTBU2T;

/** \\brief  OCDS Trigger Set Control 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTSC0_Bits B;
} Ifx_GTM_INOUTSEL_OTSC0;

/** \\brief  OCDS Trigger Set Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTSC1_Bits B;
} Ifx_GTM_INOUTSEL_OTSC1;

