Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  OCDS Trigger Set Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_OTSS_Bits B;
} Ifx_GTM_INOUTSEL_OTSS;

/** \\brief  PSI5 Output Select 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits B;
} Ifx_GTM_INOUTSEL_PSI5OUTSEL;

/** \\brief  PSI5-S Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                       U;
    /** \brief Signed access */
    signed int                         I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits B;
} Ifx_GTM_INOUTSEL_PSI5S_OUTSEL;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_RESET1_Bits B;
} Ifx_GTM_INOUTSEL_RESET1;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                 U;
    /** \brief Signed access */
    signed int                   I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_RESET2_Bits B;
} Ifx_GTM_INOUTSEL_RESET2;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_RESET_CLR_Bits B;
} Ifx_GTM_INOUTSEL_RESET_CLR;

/** \\brief  Timer Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_T_OUTSEL_Bits B;
} Ifx_GTM_INOUTSEL_T_OUTSEL;

/** \\brief  TIM Input Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TIM_INSEL_Bits B;
} Ifx_GTM_INOUTSEL_TIM_INSEL;

/** \\brief  Trigger Output Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT0;

/** \\brief  Trigger Output Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT1_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT1;

/** \\brief  Trigger Output Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT2;

/** \\brief  Trigger Output Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT3;

/** \\brief  Trigger Output Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT4_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT4;

/** \\brief  Trigger Output Register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT5_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT5;

/** \\brief  Trigger Output Register 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT6_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT6;

/** \\brief  Trigger Output Register 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT7_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT7;

/** \\brief  Trigger Output Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT8_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT8;

/** \\brief  Trigger Output Register 9 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits B;
} Ifx_GTM_INOUTSEL_TRIG_OUT9;

/** \\brief  GTM Interrupt enable register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_GTM_IRQ_EN_Bits B;
} Ifx_GTM_IRQ_EN;

/** \\brief  GTM Software interrupt generation register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_GTM_IRQ_FORCINT_Bits B;
} Ifx_GTM_IRQ_FORCINT;

