Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  MCS channel 0 general purpose register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CH_R3_Bits B;
} Ifx_GTM_MCS_CH_R3;

/** \\brief  MCS channel 0 general purpose register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CH_R4_Bits B;
} Ifx_GTM_MCS_CH_R4;

/** \\brief  MCS channel 0 general purpose register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CH_R5_Bits B;
} Ifx_GTM_MCS_CH_R5;

/** \\brief  MCS channel 0 general purpose register 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CH_R6_Bits B;
} Ifx_GTM_MCS_CH_R6;

/** \\brief  MCS channel 0 general purpose register 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CH_R7_Bits B;
} Ifx_GTM_MCS_CH_R7;

/** \\brief  MCS control and status register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int               U;
    /** \brief Signed access */
    signed int                 I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CTRL_STAT_Bits B;
} Ifx_GTM_MCS_CTRL_STAT;

/** \\brief  MCS cancel WURM instruction */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_CWT_Bits B;
} Ifx_GTM_MCS_CWT;

/** \\brief  MCS error register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_ERR_Bits B;
} Ifx_GTM_MCS_ERR;

/** \\brief  MCS write protection register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int              U;
    /** \brief Signed access */
    signed int                I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_REG_PROT_Bits B;
} Ifx_GTM_MCS_REG_PROT;

/** \\brief  MCS reset register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_GTM_MCS_RESET_Bits B;
} Ifx_GTM_MCS_RESET;

/** \\brief  Monitor activity register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_0_Bits B;
} Ifx_GTM_MON_ACTIVITY_0;

/** \\brief  Monitor activity register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                U;
    /** \brief Signed access */
    signed int                  I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_1_Bits B;
} Ifx_GTM_MON_ACTIVITY_1;

/** \\brief  Monitor activity register for MCS 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS0_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS0;

/** \\brief  Monitor activity register for MCS 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS1_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS1;

/** \\brief  Monitor activity register for MCS 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS2_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS2;

/** \\brief  Monitor activity register for MCS 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS3_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS3;

/** \\brief  Monitor activity register for MCS 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS4_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS4;

/** \\brief  Monitor activity register for MCS 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS5_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS5;

/** \\brief  Monitor activity register for MCS 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS6_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS6;

/** \\brief  Monitor activity register for MCS 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS7_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS7;

/** \\brief  Monitor activity register for MCS 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_MON_ACTIVITY_MCS8_Bits B;
} Ifx_GTM_MON_ACTIVITY_MCS8;

