Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  TOM TGC 1 enable/disable status register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits B;
} Ifx_GTM_TOM_TGC1_ENDIS_STAT;

/** \\brief  TOM TGC 1 force update control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                    U;
    /** \brief Signed access */
    signed int                      I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits B;
} Ifx_GTM_TOM_TGC1_FUPD_CTRL;

/** \\brief  TOM TGC 1 global control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits B;
} Ifx_GTM_TOM_TGC1_GLB_CTRL;

/** \\brief  TOM TGC 1 internal trigger control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                   U;
    /** \brief Signed access */
    signed int                     I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_INT_TRIG_Bits B;
} Ifx_GTM_TOM_TGC1_INT_TRIG;

/** \\brief  TOM TGC 1 output enable control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits B;
} Ifx_GTM_TOM_TGC1_OUTEN_CTRL;

/** \\brief  TOM TGC 1 output enable status register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int                     U;
    /** \brief Signed access */
    signed int                       I;
    /** \brief Bitfield access */
    Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits B;
} Ifx_GTM_TOM_TGC1_OUTEN_STAT;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L3
 * \{  */

/** \\brief  MSC Input Control Register */
typedef volatile struct _Ifx_GTM_INOUTSEL_MSC_IN
{
    Ifx_GTM_INOUTSEL_MSC_IN_INLCON    INLCON;    /**< \brief 0, MSC0 Input Low Control Register */
    Ifx_GTM_INOUTSEL_MSC_IN_INHCON    INHCON;    /**< \brief 4, MSC0 Input High Control Register */
    Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON INLEXTCON; /**< \brief 8, MSC0 Input Low Extended Control Register */
} Ifx_GTM_INOUTSEL_MSC_IN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \\brief  AFD FIFO channel objects */
typedef volatile struct _Ifx_GTM_AFD_CH
{
    Ifx_GTM_AFD_CH_BUF_ACC BUF_ACC;         /**< \brief 0, AFD 0 FIFO 0 buffer access register */
    unsigned char          reserved_4[12];  /**< \brief 4, \internal Reserved */
} Ifx_GTM_AFD_CH;

/** \\brief  ACG object */
typedef volatile struct _Ifx_GTM_ATOM_AGC
{
    Ifx_GTM_ATOM_AGC_GLB_CTRL   GLB_CTRL;        /**< \brief 0, ATOM AGC global control register */
    Ifx_GTM_ATOM_AGC_ENDIS_CTRL ENDIS_CTRL;      /**< \brief 4, ATOM AGC enable/disable control register */
    Ifx_GTM_ATOM_AGC_ENDIS_STAT ENDIS_STAT;      /**< \brief 8, ATOM AGC enable/disable status register */
    Ifx_GTM_ATOM_AGC_ACT_TB     ACT_TB;          /**< \brief C, ATOM AGC action time base register */
    Ifx_GTM_ATOM_AGC_OUTEN_CTRL OUTEN_CTRL;      /**< \brief 10, ATOM AGC output enable control register */
    Ifx_GTM_ATOM_AGC_OUTEN_STAT OUTEN_STAT;      /**< \brief 14, ATOM AGC output enable status register */
    Ifx_GTM_ATOM_AGC_FUPD_CTRL  FUPD_CTRL;       /**< \brief 18, ATOM AGC force update control register */
    Ifx_GTM_ATOM_AGC_INT_TRIG   INT_TRIG;        /**< \brief 1C, ATOM AGC internal trigger control register */
    unsigned char               reserved_20[32]; /**< \brief 20, \internal Reserved */
} Ifx_GTM_ATOM_AGC;

/** \\brief  ATOM channel objects */
typedef volatile struct _Ifx_GTM_ATOM_CH
{
    Ifx_GTM_ATOM_CH_RDADDR      RDADDR;          /**< \brief 0, ATOM channel 0 ARU read address register */
    union
    {
        Ifx_GTM_ATOM_CH_CTRL CTRL;               /**< \brief 4, ATOM Channel Control Register */
        Ifx_GTM_ATOM_CH_SOMI SOMI;               /**< \brief 4, ATOM Channel Control in SOMI mode Register */
        Ifx_GTM_ATOM_CH_SOMC SOMC;               /**< \brief 4, ATOM Channel Control in SOMC mode Register */
        Ifx_GTM_ATOM_CH_SOMP SOMP;               /**< \brief 4, ATOM Channel Control in SOMP mode Register */
        Ifx_GTM_ATOM_CH_SOMS SOMS;               /**< \brief 4, ATOM Channel Control in SOMS mode Register */
        Ifx_GTM_ATOM_CH_SOMB SOMB;               /**< \brief 4, ATOM Channel Control in SOMB mode Register */
    };
    Ifx_GTM_ATOM_CH_SR0         SR0;             /**< \brief 8, ATOM channel 0 CCU0 compare shadow register */
    Ifx_GTM_ATOM_CH_SR1         SR1;             /**< \brief C, ATOM channel 0 CCU1 compare shadow register */
    Ifx_GTM_ATOM_CH_CM0         CM0;             /**< \brief 10, ATOM channel 0 CCU0 compare register */
    Ifx_GTM_ATOM_CH_CM1         CM1;             /**< \brief 14, ATOM channel 0 CCU1 compare register */
    Ifx_GTM_ATOM_CH_CN0         CN0;             /**< \brief 18, ATOM channel 0 CCU0 counter register */
    Ifx_GTM_ATOM_CH_STAT        STAT;            /**< \brief 1C, ATOM channel 0 status register */
    Ifx_GTM_ATOM_CH_IRQ_NOTIFY  IRQ_NOTIFY;      /**< \brief 20, ATOM channel 0 interrupt notification register */
    Ifx_GTM_ATOM_CH_IRQ_EN      IRQ_EN;          /**< \brief 24, ATOM channel 0 interrupt enable register */
    Ifx_GTM_ATOM_CH_IRQ_FORCINT IRQ_FORCINT;     /**< \brief 28, ATOM channel 0 software interrupt generation */
    Ifx_GTM_ATOM_CH_IRQ_MODE    IRQ_MODE;        /**< \brief 2C, ATOM channel 0 interrupt mode configuration register */
    unsigned char               reserved_30[16]; /**< \brief 30, \internal Reserved */
} Ifx_GTM_ATOM_CH;

/** \\brief  BRC input channel objects */
typedef volatile struct _Ifx_GTM_BRC_SRC
{
    Ifx_GTM_BRC_SRC_ADDR ADDR;              /**< \brief 0, BRC read address for input channel 0 */
    Ifx_GTM_BRC_SRC_DEST DEST;              /**< \brief 4, BRC destination channels for input channel 0 */
} Ifx_GTM_BRC_SRC;

