Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DTM channel objects */
typedef volatile struct _Ifx_GTM_CDTM_DTM
{
    Ifx_GTM_CDTM_DTM_CTRL        CTRL;            /**< \brief 0, CDTM0 DTM0 global configuration and control register */
    Ifx_GTM_CDTM_DTM_CH_CTRL1    CH_CTRL1;        /**< \brief 4, CDTM0 DTM0 channel control register 1 */
    Ifx_GTM_CDTM_DTM_CH_CTRL2    CH_CTRL2;        /**< \brief 8, CDTM0 DTM0 channel control register 2 */
    Ifx_GTM_CDTM_DTM_CH_CTRL2_SR CH_CTRL2_SR;     /**< \brief C, CDTM0 DTM0 channel control register 2 shadow */
    Ifx_GTM_CDTM_DTM_PS_CTRL     PS_CTRL;         /**< \brief 10, CDTM0 DTM0 phase shift unit configuration and control register */
    Ifx_GTM_CDTM_DTM_CH_DTV      CH_DTV[4];       /**< \brief 14, CDTM0 DTM0 channel 0 dead time reload values */
    Ifx_GTM_CDTM_DTM_CH_SR       CH_SR;           /**< \brief 24, CDTM DTM0 channel shadow reg0ster */
    Ifx_GTM_CDTM_DTM_CH_CTRL3    CH_CTRL3;        /**< \brief 28, CDTM0 DTM0 channel control register 3 */
    unsigned char                reserved_2C[20]; /**< \brief 2C, \internal Reserved */
} Ifx_GTM_CDTM_DTM;

/** \\brief  CLK objects */
typedef volatile struct _Ifx_GTM_CMU_CLK0_5
{
    Ifx_GTM_CMU_CLK0_5_CTRL CTRL;           /**< \brief 0, CMU control for clock source 0 */
} Ifx_GTM_CMU_CLK0_5;

/** \\brief  CLK objects */
typedef volatile struct _Ifx_GTM_CMU_CLK_6
{
    Ifx_GTM_CMU_CLK_6_CTRL CTRL;            /**< \brief 0, CMU control for clock source 6 */
} Ifx_GTM_CMU_CLK_6;

/** \\brief  CLK objects */
typedef volatile struct _Ifx_GTM_CMU_CLK_7
{
    Ifx_GTM_CMU_CLK_7_CTRL CTRL;            /**< \brief 0, CMU control for clock source 7 */
} Ifx_GTM_CMU_CLK_7;

/** \\brief  ECLK objects */
typedef volatile struct _Ifx_GTM_CMU_ECLK
{
    Ifx_GTM_CMU_ECLK_NUM NUM;               /**< \brief 0, CMU external clock 0 control numerator */
    Ifx_GTM_CMU_ECLK_DEN DEN;               /**< \brief 4, CMU external clock 0 control denominator */
} Ifx_GTM_CMU_ECLK;

/** \\brief  FXCLK objects */
typedef volatile struct _Ifx_GTM_CMU_FXCLK
{
    Ifx_GTM_CMU_FXCLK_CTRL CTRL;            /**< \brief 0, CMU control FXCLK sub-unit input clock */
} Ifx_GTM_CMU_FXCLK;

/** \\brief  F2A ARU RD FIFO address */
typedef volatile struct _Ifx_GTM_F2A_RD_CH
{
    Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO ARU_RD_FIFO;  /**< \brief 0, F2A0 stream 0 read address register */
} Ifx_GTM_F2A_RD_CH;

/** \\brief  F2A Stream configuration */
typedef volatile struct _Ifx_GTM_F2A_STR_CH
{
    Ifx_GTM_F2A_STR_CH_STR_CFG STR_CFG;     /**< \brief 0, F2A0 stream 0 configuration register */
} Ifx_GTM_F2A_STR_CH;

/** \\brief  FIFO channel */
typedef volatile struct _Ifx_GTM_FIFO_CH
{
    Ifx_GTM_FIFO_CH_CTRL        CTRL;           /**< \brief 0, FIFO0 channel 0 control register */
    Ifx_GTM_FIFO_CH_END_ADDR    END_ADDR;       /**< \brief 4, FIFO0 channel 0 end address register */
    Ifx_GTM_FIFO_CH_START_ADDR  START_ADDR;     /**< \brief 8, FIFO0 channel 0 start address register */
    Ifx_GTM_FIFO_CH_UPPER_WM    UPPER_WM;       /**< \brief C, FIFO0 channel 0 upper watermark register */
    Ifx_GTM_FIFO_CH_LOWER_WM    LOWER_WM;       /**< \brief 10, FIFO0 channel 0 lower watermark register */
    Ifx_GTM_FIFO_CH_STATUS      STATUS;         /**< \brief 14, FIFO0 channel 0 status register */
    Ifx_GTM_FIFO_CH_FILL_LEVEL  FILL_LEVEL;     /**< \brief 18, FIFO0 channel 0 fill level register */
    Ifx_GTM_FIFO_CH_WR_PTR      WR_PTR;         /**< \brief 1C, FIFO0 channel 0 write pointer register */
    Ifx_GTM_FIFO_CH_RD_PTR      RD_PTR;         /**< \brief 20, FIFO0 channel 0 read pointer register */
    Ifx_GTM_FIFO_CH_IRQ_NOTIFY  IRQ_NOTIFY;     /**< \brief 24, FIFO0 channel 0 interrupt notification register */
    Ifx_GTM_FIFO_CH_IRQ_EN      IRQ_EN;         /**< \brief 28, FIFO0 channel 0 interrupt enable register */
    Ifx_GTM_FIFO_CH_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 2C, FIFO0 channel 0 force interrupt register */
    Ifx_GTM_FIFO_CH_IRQ_MODE    IRQ_MODE;       /**< \brief 30, FIFO0 channel 0 interrupt mode control register */
    Ifx_GTM_FIFO_CH_EIRQ_EN     EIRQ_EN;        /**< \brief 34, FIFO0 channel 0 error interrupt enable register */
    unsigned char               reserved_38[8]; /**< \brief 38, \internal Reserved */
} Ifx_GTM_FIFO_CH;

/** \\brief  ADCTRIG */
typedef volatile struct _Ifx_GTM_INOUTSEL_ADCTRIG
{
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT00 OUT00;   /**< \brief 0, ADC Trigger 0 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT01 OUT01;   /**< \brief 4, ADC Trigger 0 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT10 OUT10;   /**< \brief 8, ADC Trigger 1 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT11 OUT11;   /**< \brief C, ADC Trigger 1 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT20 OUT20;   /**< \brief 10, ADC Trigger 2 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT21 OUT21;   /**< \brief 14, ADC Trigger 1 Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT30 OUT30;   /**< \brief 18, ADC Trigger 3Output Select 1 Register */
    Ifx_GTM_INOUTSEL_ADCTRIG_OUT31 OUT31;   /**< \brief 1C, ADC Trigger 1 Output Select 1 Register */
} Ifx_GTM_INOUTSEL_ADCTRIG;

/** \\brief  CAN */
typedef volatile struct _Ifx_GTM_INOUTSEL_CAN
{
    Ifx_GTM_INOUTSEL_CAN_OUTSEL OUTSEL;     /**< \brief 0, CAN Output Select Register */
} Ifx_GTM_INOUTSEL_CAN;

/** \\brief  DATAIN */
typedef volatile struct _Ifx_GTM_INOUTSEL_DATA
{
    Ifx_GTM_INOUTSEL_DATA_IN0 IN0;          /**< \brief 0, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN1 IN1;          /**< \brief 4, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN2 IN2;          /**< \brief 8, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN3 IN3;          /**< \brief C, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN4 IN4;          /**< \brief 10, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN5 IN5;          /**< \brief 14, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN6 IN6;          /**< \brief 18, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN7 IN7;          /**< \brief 1C, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN8 IN8;          /**< \brief 20, Data Input n Register */
    Ifx_GTM_INOUTSEL_DATA_IN9 IN9;          /**< \brief 24, Data Input n Register */
} Ifx_GTM_INOUTSEL_DATA;

/** \\brief  DSADC */
typedef volatile struct _Ifx_GTM_INOUTSEL_DSADC
{
    Ifx_GTM_INOUTSEL_DSADC_INSEL   INSEL[6]; /**< \brief 0, DSADC Input Select Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 OUTSEL00; /**< \brief 18, DSADC Output Select 00 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 OUTSEL01; /**< \brief 1C, DSADC Output Select 01 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 OUTSEL10; /**< \brief 20, DSADC Output Select 10 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 OUTSEL11; /**< \brief 24, DSADC Output Select 11 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 OUTSEL20; /**< \brief 28, DSADC Output Select 20 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 OUTSEL21; /**< \brief 2C, DSADC Output Select 21 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 OUTSEL30; /**< \brief 30, DSADC Output Select 30 Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 OUTSEL31; /**< \brief 34, DSADC Output Select 31 Register */
} Ifx_GTM_INOUTSEL_DSADC;

/** \\brief  INT */
typedef volatile struct _Ifx_GTM_INOUTSEL_INT
{
    Ifx_GTM_INOUTSEL_INT_OUT0 OUT0;         /**< \brief 0, I0terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT1 OUT1;         /**< \brief 4, I1terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT2 OUT2;         /**< \brief 8, I2terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT3 OUT3;         /**< \brief C, I3terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT4 OUT4;         /**< \brief 10, I4terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT5 OUT5;         /**< \brief 14, I5terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT6 OUT6;         /**< \brief 18, I6terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT7 OUT7;         /**< \brief 1C, I7terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT8 OUT8;         /**< \brief 20, I8terrupt Output Register n */
    Ifx_GTM_INOUTSEL_INT_OUT9 OUT9;         /**< \brief 24, I9terrupt Output Register n */
} Ifx_GTM_INOUTSEL_INT;

/** \\brief  MSC */
typedef volatile struct _Ifx_GTM_INOUTSEL_MSC
{
    Ifx_GTM_INOUTSEL_MSC_SET1CON0 SET1CON0; /**< \brief 0, MSC Set 1 Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET1CON1 SET1CON1; /**< \brief 4, MSC Set 1 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET1CON2 SET1CON2; /**< \brief 8, MSC Set 1 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET1CON3 SET1CON3; /**< \brief C, MSC Set 1 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET2CON0 SET2CON0; /**< \brief 10, MSC Set 2 Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET2CON1 SET2CON1; /**< \brief 14, MSC Set 2 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET2CON2 SET2CON2; /**< \brief 18, MSC Set 2 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET2CON3 SET2CON3; /**< \brief 1C, MSC Set 2 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET3CON0 SET3CON0; /**< \brief 20, MSC Set 3Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET3CON1 SET3CON1; /**< \brief 24, MSC Set 3Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET3CON2 SET3CON2; /**< \brief 28, MSC Set 3 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET3CON3 SET3CON3; /**< \brief 2C, MSC Set 3 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET4CON0 SET4CON0; /**< \brief 30, MSC Set 4 Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET4CON1 SET4CON1; /**< \brief 34, MSC Set 4 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET4CON2 SET4CON2; /**< \brief 38, MSC Set 4 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET4CON3 SET4CON3; /**< \brief 3C, MSC Set 4 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET5CON0 SET5CON0; /**< \brief 40, MSC Set 5 Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET5CON1 SET5CON1; /**< \brief 44, MSC Set 5 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET5CON2 SET5CON2; /**< \brief 48, MSC Set 5 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET5CON3 SET5CON3; /**< \brief 4C, MSC Set 5 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET6CON0 SET6CON0; /**< \brief 50, MSC Set 6 Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET6CON1 SET6CON1; /**< \brief 54, MSC Set 6 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET6CON2 SET6CON2; /**< \brief 58, MSC Set 6 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET6CON3 SET6CON3; /**< \brief 5C, MSC Set 6 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET7CON0 SET7CON0; /**< \brief 60, MSC Set 7Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET7CON1 SET7CON1; /**< \brief 64, MSC Set 7 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET7CON2 SET7CON2; /**< \brief 68, MSC Set 7 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET7CON3 SET7CON3; /**< \brief 6C, MSC Set 7 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET8CON0 SET8CON0; /**< \brief 70, MSC Set 8Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET8CON1 SET8CON1; /**< \brief 74, MSC Set 8 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET8CON2 SET8CON2; /**< \brief 78, MSC Set 8 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET8CON3 SET8CON3; /**< \brief 7C, MSC Set 8 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_SET9CON0 SET9CON0; /**< \brief 80, MSC Set 9Control 0 Register */
    Ifx_GTM_INOUTSEL_MSC_SET9CON1 SET9CON1; /**< \brief 84, MSC Set 9 Control 1 Register */
    Ifx_GTM_INOUTSEL_MSC_SET9CON2 SET9CON2; /**< \brief 88, MSC Set 9 Control 2 Register */
    Ifx_GTM_INOUTSEL_MSC_SET9CON3 SET9CON3; /**< \brief 8C, MSC Set 9 Control 3 Register */
    Ifx_GTM_INOUTSEL_MSC_IN       IN[4];    /**< \brief 90, MSC Input Control Register */
} Ifx_GTM_INOUTSEL_MSC;

/** \\brief  PSI5S */
typedef volatile struct _Ifx_GTM_INOUTSEL_PSI5S
{
    Ifx_GTM_INOUTSEL_PSI5S_OUTSEL OUTSEL;   /**< \brief 0, PSI5-S Output Select Register */
} Ifx_GTM_INOUTSEL_PSI5S;

/** \\brief  Timer */
typedef volatile struct _Ifx_GTM_INOUTSEL_T
{
    Ifx_GTM_INOUTSEL_T_OUTSEL OUTSEL[34];   /**< \brief 0, Timer Output Select Register */
} Ifx_GTM_INOUTSEL_T;

/** \\brief  TIM */
typedef volatile struct _Ifx_GTM_INOUTSEL_TIM
{
    Ifx_GTM_INOUTSEL_TIM_INSEL INSEL;       /**< \brief 0, TIM Input Select Register */
} Ifx_GTM_INOUTSEL_TIM;

/** \\brief  TRIG */
typedef volatile struct _Ifx_GTM_INOUTSEL_TRIG
{
    Ifx_GTM_INOUTSEL_TRIG_OUT0 OUT0;        /**< \brief 0, Trigger Output Register 0 */
    Ifx_GTM_INOUTSEL_TRIG_OUT1 OUT1;        /**< \brief 4, Trigger Output Register 1 */
    Ifx_GTM_INOUTSEL_TRIG_OUT2 OUT2;        /**< \brief 8, Trigger Output Register 2 */
    Ifx_GTM_INOUTSEL_TRIG_OUT3 OUT3;        /**< \brief C, Trigger Output Register 3 */
    Ifx_GTM_INOUTSEL_TRIG_OUT4 OUT4;        /**< \brief 10, Trigger Output Register 4 */
    Ifx_GTM_INOUTSEL_TRIG_OUT5 OUT5;        /**< \brief 14, Trigger Output Register 5 */
    Ifx_GTM_INOUTSEL_TRIG_OUT6 OUT6;        /**< \brief 18, Trigger Output Register 6 */
    Ifx_GTM_INOUTSEL_TRIG_OUT7 OUT7;        /**< \brief 1C, Trigger Output Register 7 */
    Ifx_GTM_INOUTSEL_TRIG_OUT8 OUT8;        /**< \brief 20, Trigger Output Register 8 */
    Ifx_GTM_INOUTSEL_TRIG_OUT9 OUT9;        /**< \brief 24, Trigger Output Register 9 */
} Ifx_GTM_INOUTSEL_TRIG;

/** \\brief  MCS channel objects */
typedef volatile struct _Ifx_GTM_MCS_CH
{
    Ifx_GTM_MCS_CH_R0          R0;              /**< \brief 0, MCS channel 1 general purpose register 0 */
    Ifx_GTM_MCS_CH_R1          R1;              /**< \brief 4, MCS channel 1 general purpose register 1 */
    Ifx_GTM_MCS_CH_R2          R2;              /**< \brief 8, MCS channel 1 general purpose register 2 */
    Ifx_GTM_MCS_CH_R3          R3;              /**< \brief C, MCS channel 1 general purpose register 3 */
    Ifx_GTM_MCS_CH_R4          R4;              /**< \brief 10, MCS channel 1 general purpose register 4 */
    Ifx_GTM_MCS_CH_R5          R5;              /**< \brief 14, MCS channel 1 general purpose register 5 */
    Ifx_GTM_MCS_CH_R6          R6;              /**< \brief 18, MCS channel 1 general purpose register 6 */
    Ifx_GTM_MCS_CH_R7          R7;              /**< \brief 1C, MCS channel 1 general purpose register 7 */
    Ifx_GTM_MCS_CH_CTRL        CTRL;            /**< \brief 20, MCS channel 1 control register */
    Ifx_GTM_MCS_CH_ACB         ACB;             /**< \brief 24, MCS channel 1 ARU control Bit register */
    unsigned char              reserved_28[20]; /**< \brief 28, \internal Reserved */
    Ifx_GTM_MCS_CH_MHB         MHB;             /**< \brief 3C, MCS channel 1 memory high byte register */
    Ifx_GTM_MCS_CH_PC          PC;              /**< \brief 40, MCS channel 1 program counter register */
    Ifx_GTM_MCS_CH_IRQ_NOTIFY  IRQ_NOTIFY;      /**< \brief 44, MCS channel 1 interrupt notification register */
    Ifx_GTM_MCS_CH_IRQ_EN      IRQ_EN;          /**< \brief 48, MCS channel 1 interrupt enable register */
    Ifx_GTM_MCS_CH_IRQ_FORCINT IRQ_FORCINT;     /**< \brief 4C, MCS channel 1 force interrupt register */
    Ifx_GTM_MCS_CH_IRQ_MODE    IRQ_MODE;        /**< \brief 50, MCS channel 1 IRQ mode configuration register */
    Ifx_GTM_MCS_CH_EIRQ_EN     EIRQ_EN;         /**< \brief 54, MCS channel 1 error interrupt enable register */
    unsigned char              reserved_58[40]; /**< \brief 58, \internal Reserved */
} Ifx_GTM_MCS_CH;

/** \\brief  MCS channel0 object */
typedef volatile struct _Ifx_GTM_MCS_CH0
{
    Ifx_GTM_MCS_CH_R0          R0;              /**< \brief 0, MCS channel 0 general purpose register 0 */
    Ifx_GTM_MCS_CH_R1          R1;              /**< \brief 4, MCS channel 0 general purpose register 1 */
    Ifx_GTM_MCS_CH_R2          R2;              /**< \brief 8, MCS channel 0 general purpose register 2 */
    Ifx_GTM_MCS_CH_R3          R3;              /**< \brief C, MCS channel 0 general purpose register 3 */
    Ifx_GTM_MCS_CH_R4          R4;              /**< \brief 10, MCS channel 0 general purpose register 4 */
    Ifx_GTM_MCS_CH_R5          R5;              /**< \brief 14, MCS channel 0 general purpose register 5 */
    Ifx_GTM_MCS_CH_R6          R6;              /**< \brief 18, MCS channel 0 general purpose register 6 */
    Ifx_GTM_MCS_CH_R7          R7;              /**< \brief 1C, MCS channel 0 general purpose register 7 */
    Ifx_GTM_MCS_CH_CTRL        CTRL;            /**< \brief 20, MCS channel 0 control register */
    Ifx_GTM_MCS_CH_ACB         ACB;             /**< \brief 24, MCS channel 0 ARU control Bit register */
    Ifx_GTM_MCS_CH0_CTRG       CTRG;            /**< \brief 28, MCS clear trigger control register */
    Ifx_GTM_MCS_CH0_STRG       STRG;            /**< \brief 2C, MCS set trigger control register */
    unsigned char              reserved_30[12]; /**< \brief 30, \internal Reserved */
    Ifx_GTM_MCS_CH_MHB         MHB;             /**< \brief 3C, MCS channel 0 memory high byte register */
    Ifx_GTM_MCS_CH_PC          PC;              /**< \brief 40, MCS channel 0 program counter register */
    Ifx_GTM_MCS_CH_IRQ_NOTIFY  IRQ_NOTIFY;      /**< \brief 44, MCS channel 0 interrupt notification register */
    Ifx_GTM_MCS_CH_IRQ_EN      IRQ_EN;          /**< \brief 48, MCS channel 0 interrupt enable register */
    Ifx_GTM_MCS_CH_IRQ_FORCINT IRQ_FORCINT;     /**< \brief 4C, MCS channel 0 force interrupt register */
    Ifx_GTM_MCS_CH_IRQ_MODE    IRQ_MODE;        /**< \brief 50, MCS channel 0 IRQ mode configuration register */
    Ifx_GTM_MCS_CH_EIRQ_EN     EIRQ_EN;         /**< \brief 54, MCS channel 0 error interrupt enable register */
} Ifx_GTM_MCS_CH0;

/** \\brief  TIM channel objects */
typedef volatile struct _Ifx_GTM_TIM_CH
{
    Ifx_GTM_TIM_CH_GPR0        GPR0;            /**< \brief 0, TIM channel 0 general purpose 0 register */
    Ifx_GTM_TIM_CH_GPR1        GPR1;            /**< \brief 4, TIM channel 0 general purpose 1 register */
    Ifx_GTM_TIM_CH_CNT         CNT;             /**< \brief 8, TIM channel 0 SMU counter register */
    Ifx_GTM_TIM_CH_ECNT        ECNT;            /**< \brief C, TIM channel 0 SMU edge counter register */
    Ifx_GTM_TIM_CH_CNTS        CNTS;            /**< \brief 10, TIM channel 0 SMU shadow counter register */
    Ifx_GTM_TIM_CH_TDUC        TDUC;            /**< \brief 14, TIM channel 0 TDU counter register */
    Ifx_GTM_TIM_CH_TDUV        TDUV;            /**< \brief 18, TIM channel 0 TDU control register */
    Ifx_GTM_TIM_CH_FLT_RE      FLT_RE;          /**< \brief 1C, TIM channel 0 filter parameter 0 register */
    Ifx_GTM_TIM_CH_FLT_FE      FLT_FE;          /**< \brief 20, TIM channel 0 filter parameter 1 register */
    Ifx_GTM_TIM_CH_CTRL        CTRL;            /**< \brief 24, TIM channel 0 control register */
    Ifx_GTM_TIM_CH_ECTRL       ECTRL;           /**< \brief 28, TIM channel 0 extended control register */
    Ifx_GTM_TIM_CH_IRQ_NOTIFY  IRQ_NOTIFY;      /**< \brief 2C, TIM channel 0 interrupt notification register */
    Ifx_GTM_TIM_CH_IRQ_EN      IRQ_EN;          /**< \brief 30, TIM channel 0 interrupt enable register */
    Ifx_GTM_TIM_CH_IRQ_FORCINT IRQ_FORCINT;     /**< \brief 34, TIM channel 0 force interrupt register */
    Ifx_GTM_TIM_CH_IRQ_MODE    IRQ_MODE;        /**< \brief 38, TIM channel 0 interrupt mode configuration register */
    Ifx_GTM_TIM_CH_EIRQ_EN     EIRQ_EN;         /**< \brief 3C, TIM channel 0 error interrupt enable register */
    unsigned char              reserved_40[52]; /**< \brief 40, \internal Reserved */
} Ifx_GTM_TIM_CH;

