Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  TOM channel objects */
typedef volatile struct _Ifx_GTM_TOM_CH
{
    Ifx_GTM_TOM_CH_CTRL        CTRL;           /**< \brief 0, TOM channel 0 control register */
    Ifx_GTM_TOM_CH_SR0         SR0;            /**< \brief 4, TOM channel 0 CCU0 compare shadow register */
    Ifx_GTM_TOM_CH_SR1         SR1;            /**< \brief 8, TOM channel 0 CCU1 compare shadow register */
    Ifx_GTM_TOM_CH_CM0         CM0;            /**< \brief C, TOM channel 0 CCU0 compare register */
    Ifx_GTM_TOM_CH_CM1         CM1;            /**< \brief 10, TOM channel 0 CCU1 compare register */
    Ifx_GTM_TOM_CH_CN0         CN0;            /**< \brief 14, TOM channel 0 CCU0 counter register */
    Ifx_GTM_TOM_CH_STAT        STAT;           /**< \brief 18, TOM channel 0 status register */
    Ifx_GTM_TOM_CH_IRQ_NOTIFY  IRQ_NOTIFY;     /**< \brief 1C, TOM channel 0 interrupt notification register */
    Ifx_GTM_TOM_CH_IRQ_EN      IRQ_EN;         /**< \brief 20, TOM channel 0 interrupt enable register */
    Ifx_GTM_TOM_CH_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 24, TOM channel 0 force interrupt register */
    Ifx_GTM_TOM_CH_IRQ_MODE    IRQ_MODE;       /**< \brief 28, TOM channel 0 interrupt mode register */
    unsigned char              reserved_2C[4]; /**< \brief 2C, \internal Reserved */
} Ifx_GTM_TOM_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  AFD object */
typedef volatile struct _Ifx_GTM_AFD
{
    Ifx_GTM_AFD_CH CH[8];                   /**< \brief 0, AFD FIFO channel objects */
    unsigned char  reserved_80[768];        /**< \brief 80, \internal Reserved */
} Ifx_GTM_AFD;

/** \\brief  ARU object */
typedef volatile struct _Ifx_GTM_ARU
{
    Ifx_GTM_ARU_ARU_ACCESS          ARU_ACCESS;         /**< \brief 0, ARU access register */
    Ifx_GTM_ARU_DATA_H              DATA_H;             /**< \brief 4, ARU access register upper data word */
    Ifx_GTM_ARU_DATA_L              DATA_L;             /**< \brief 8, ARU access register lower data word */
    Ifx_GTM_ARU_DBG_ACCESS0         DBG_ACCESS0;        /**< \brief C, ARU debug access channel 0 */
    Ifx_GTM_ARU_DBG_DATA0_H         DBG_DATA0_H;        /**< \brief 10, ARU debug access 0 transfer register upper data word */
    Ifx_GTM_ARU_DBG_DATA0_L         DBG_DATA0_L;        /**< \brief 14, ARU debug access 0 transfer register lower data word */
    Ifx_GTM_ARU_DBG_ACCESS1         DBG_ACCESS1;        /**< \brief 18, ARU debug access channel 1 */
    Ifx_GTM_ARU_DBG_DATA1_H         DBG_DATA1_H;        /**< \brief 1C, ARU debug access 1 transfer register upper data word */
    Ifx_GTM_ARU_DBG_DATA1_L         DBG_DATA1_L;        /**< \brief 20, ARU debug access 1 transfer register lower data word */
    Ifx_GTM_ARU_IRQ_NOTIFY          IRQ_NOTIFY;         /**< \brief 24, ARU interrupt notification register */
    Ifx_GTM_ARU_IRQ_EN              IRQ_EN;             /**< \brief 28, ARU interrupt enable register */
    Ifx_GTM_ARU_IRQ_FORCINT         IRQ_FORCINT;        /**< \brief 2C, ARU force interrupt register */
    Ifx_GTM_ARU_IRQ_MODE            IRQ_MODE;           /**< \brief 30, ARU interrupt mode register */
    Ifx_GTM_ARU_CADDR_END           CADDR_END;          /**< \brief 34, ARU caddr counter end value */
    unsigned char                   reserved_38[4];     /**< \brief 38, \internal Reserved */
    Ifx_GTM_ARU_CTRL                CTRL;               /**< \brief 3C, ARU enable dynamic routing */
    Ifx_GTM_ARU_0_DYN_CTRL          DYN_CTRL0;          /**< \brief 40, ARU 0 dynamic routing control register */
    Ifx_GTM_ARU_1_DYN_CTRL          DYN_CTRL1;          /**< \brief 44, ARU 1 dynamic routing control register */
    Ifx_GTM_ARU_0_DYN_ROUTE_LOW     DYN_ROUTE_LOW0;     /**< \brief 48, ARU 0 lower bits of DYN_ROUTE register */
    Ifx_GTM_ARU_1_DYN_ROUTE_LOW     DYN_ROUTE_LOW1;     /**< \brief 4C, ARU 1 lower bits of DYN_ROUTE register */
    Ifx_GTM_ARU_0_DYN_ROUTE_HIGH    DYN_ROUTE_HIGH0;    /**< \brief 50, ARU 0 higher bits of DYN_ROUTE register */
    Ifx_GTM_ARU_1_DYN_ROUTE_HIGH    DYN_ROUTE_HIGH1;    /**< \brief 54, ARU 1 higher bits of DYN_ROUTE register */
    Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW  DYN_ROUTE_SR_LOW0;  /**< \brief 58, ARU 0 shadow register for ARU_[z]_DYN_ROUTE_LOW */
    Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW  DYN_ROUTE_SR_LOW1;  /**< \brief 5C, ARU 1 shadow register for ARU_[z]_DYN_ROUTE_LOW */
    Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH DYN_ROUTE_SR_HIGH0; /**< \brief 60, ARU 0 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
    Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH DYN_ROUTE_SR_HIGH1; /**< \brief 64, ARU 1 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
    Ifx_GTM_ARU_0_DYN_RDADDR        DYN_RDADDR0;        /**< \brief 68, ARU 0 read ID for dynamic routing */
    Ifx_GTM_ARU_1_DYN_RDADDR        DYN_RDADDR1;        /**< \brief 6C, ARU 1 read ID for dynamic routing */
    unsigned char                   reserved_70[12];    /**< \brief 70, \internal Reserved */
    Ifx_GTM_ARU_CADDR               CADDR;              /**< \brief 7C, ARU caddr counter value */
} Ifx_GTM_ARU;

/** \\brief  ATOM objects */
typedef volatile struct _Ifx_GTM_ATOM
{
    Ifx_GTM_ATOM_CH  CH0;                   /**< \brief 0, ATOM channel objects */
    Ifx_GTM_ATOM_AGC AGC;                   /**< \brief 40, ACG object */
    Ifx_GTM_ATOM_CH  CH1;                   /**< \brief 80, ATOM channel objects */
    unsigned char    reserved_C0[64];       /**< \brief C0, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH2;                   /**< \brief 100, ATOM channel objects */
    unsigned char    reserved_140[64];      /**< \brief 140, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH3;                   /**< \brief 180, ATOM channel objects */
    unsigned char    reserved_1C0[64];      /**< \brief 1C0, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH4;                   /**< \brief 200, ATOM channel objects */
    unsigned char    reserved_240[64];      /**< \brief 240, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH5;                   /**< \brief 280, ATOM channel objects */
    unsigned char    reserved_2C0[64];      /**< \brief 2C0, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH6;                   /**< \brief 300, ATOM channel objects */
    unsigned char    reserved_340[64];      /**< \brief 340, \internal Reserved */
    Ifx_GTM_ATOM_CH  CH7;                   /**< \brief 380, ATOM channel objects */
    unsigned char    reserved_3C0[1088];    /**< \brief 3C0, \internal Reserved */
} Ifx_GTM_ATOM;

/** \\brief  BRC object */
typedef volatile struct _Ifx_GTM_BRC
{
    Ifx_GTM_BRC_SRC         SRC[12];        /**< \brief 0, BRC input channel objects */
    Ifx_GTM_BRC_IRQ_NOTIFY  IRQ_NOTIFY;     /**< \brief 60, BRC interrupt notification register */
    Ifx_GTM_BRC_IRQ_EN      IRQ_EN;         /**< \brief 64, BRC interrupt enable register */
    Ifx_GTM_BRC_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 68, BRC force interrupt register */
    Ifx_GTM_BRC_IRQ_MODE    IRQ_MODE;       /**< \brief 6C, BRC interrupt mode configuration register */
    Ifx_GTM_BRC_RST         RST;            /**< \brief 70, BRC software reset register */
    Ifx_GTM_BRC_EIRQ_EN     EIRQ_EN;        /**< \brief 74, BRC error interrupt enable register */
} Ifx_GTM_BRC;

/** \\brief  BRIDGE object */
typedef volatile struct _Ifx_GTM_BRIDGE
{
    Ifx_GTM_BRIDGE_MODE MODE;               /**< \brief 0, GTM AEI bridge mode register */
    Ifx_GTM_BRIDGE_PTR1 PTR1;               /**< \brief 4, GTM AEI bridge pointer 1 register */
    Ifx_GTM_BRIDGE_PTR2 PTR2;               /**< \brief 8, GTM AEI bridge pointer 2 register */
} Ifx_GTM_BRIDGE;

/** \\brief  CCM objects */
typedef volatile struct _Ifx_GTM_CCM
{
    Ifx_GTM_CCM_ARP0_CTRL      ARP0_CTRL;        /**< \brief 0, CCM Address Range Protector 0 Control Register */
    Ifx_GTM_CCM_ARP0_PROT      ARP0_PROT;        /**< \brief 4, CCM Address Range Protector 0 Protection Register */
    Ifx_GTM_CCM_ARP1_CTRL      ARP1_CTRL;        /**< \brief 8, CCM Address Range Protector 1 Control Register */
    Ifx_GTM_CCM_ARP1_PROT      ARP1_PROT;        /**< \brief C, CCM Address Range Protector 1 Protection Register */
    Ifx_GTM_CCM_ARP2_CTRL      ARP2_CTRL;        /**< \brief 10, CCM Address Range Protector 2 Control Register */
    Ifx_GTM_CCM_ARP2_PROT      ARP2_PROT;        /**< \brief 14, CCM Address Range Protector 2 Protection Register */
    Ifx_GTM_CCM_ARP3_CTRL      ARP3_CTRL;        /**< \brief 18, CCM Address Range Protector 3 Control Register */
    Ifx_GTM_CCM_ARP3_PROT      ARP3_PROT;        /**< \brief 1C, CCM Address Range Protector 3 Protection Register */
    Ifx_GTM_CCM_ARP4_CTRL      ARP4_CTRL;        /**< \brief 20, CCM Address Range Protector 4 Control Register */
    Ifx_GTM_CCM_ARP4_PROT      ARP4_PROT;        /**< \brief 24, CCM Address Range Protector 4 Protection Register */
    Ifx_GTM_CCM_ARP5_CTRL      ARP5_CTRL;        /**< \brief 28, CCM Address Range Protector 5 Control Register */
    Ifx_GTM_CCM_ARP5_PROT      ARP5_PROT;        /**< \brief 2C, CCM Address Range Protector 5 Protection Register */
    Ifx_GTM_CCM_ARP6_CTRL      ARP6_CTRL;        /**< \brief 30, CCM Address Range Protector 6 Control Register */
    Ifx_GTM_CCM_ARP6_PROT      ARP6_PROT;        /**< \brief 34, CCM Address Range Protector 6 Protection Register */
    Ifx_GTM_CCM_ARP7_CTRL      ARP7_CTRL;        /**< \brief 38, CCM Address Range Protector 7 Control Register */
    Ifx_GTM_CCM_ARP7_PROT      ARP7_PROT;        /**< \brief 3C, CCM Address Range Protector 7 Protection Register */
    Ifx_GTM_CCM_ARP8_CTRL      ARP8_CTRL;        /**< \brief 40, CCM Address Range Protector 8 Control Register */
    Ifx_GTM_CCM_ARP8_PROT      ARP8_PROT;        /**< \brief 44, CCM Address Range Protector 8 Protection Register */
    Ifx_GTM_CCM_ARP9_CTRL      ARP9_CTRL;        /**< \brief 48, CCM Address Range Protector 9 Control Register */
    Ifx_GTM_CCM_ARP9_PROT      ARP9_PROT;        /**< \brief 4C, CCM Address Range Protector 9 Protection Register */
    unsigned char              reserved_50[392]; /**< \brief 50, \internal Reserved */
    Ifx_GTM_CCM_AEIM_STA       AEIM_STA;         /**< \brief 1D8, CCM MCS Bus Master Status Register */
    Ifx_GTM_CCM_HW_CONF        HW_CONF;          /**< \brief 1DC, CCM Hardware Configuration */
    Ifx_GTM_CCM_TIM_AUX_IN_SRC TIM_AUX_IN_SRC;   /**< \brief 1E0, CCM TIM module AUX_IN source selection register */
    Ifx_GTM_CCM_EXT_CAP_EN     EXT_CAP_EN;       /**< \brief 1E4, CCM external capture trigger enable */
    Ifx_GTM_CCM_TOM_OUT        TOM_OUT;          /**< \brief 1E8, GTM CCM TOM output level */
    Ifx_GTM_CCM_ATOM_OUT       ATOM_OUT;         /**< \brief 1EC, GTM CCM ATOM Output Level */
    Ifx_GTM_CCM_CMU_CLK_CFG    CMU_CLK_CFG;      /**< \brief 1F0, CCM CMU Clock Configuration Register */
    Ifx_GTM_CCM_CMU_FXCLK_CFG  CMU_FXCLK_CFG;    /**< \brief 1F4, CCM CMU Fixed Clock Configuration Register */
    Ifx_GTM_CCM_CFG            CFG;              /**< \brief 1F8, CCM Configuration Register */
    Ifx_GTM_CCM_PROT           PROT;             /**< \brief 1FC, CCM Protection Register */
} Ifx_GTM_CCM;

/** \\brief  CDTM objects */
typedef volatile struct _Ifx_GTM_CDTM
{
    Ifx_GTM_CDTM_DTM       DTM0;              /**< \brief 0, DTM channel objects */
    Ifx_GTM_CDTM_DTM       DTM1;              /**< \brief 40, DTM channel objects */
    Ifx_GTM_CDTM_DTM2_CTRL DTM2_CTRL;         /**< \brief 80, CDTM0 DTM2 global configuration and control register */
    unsigned char          reserved_84[60];   /**< \brief 84, \internal Reserved */
    Ifx_GTM_CDTM_DTM3_CTRL DTM3_CTRL;         /**< \brief C0, CDTM0 DTM3 global configuration and control register */
    unsigned char          reserved_C4[60];   /**< \brief C4, \internal Reserved */
    Ifx_GTM_CDTM_DTM       DTM4;              /**< \brief 100, DTM channel objects */
    Ifx_GTM_CDTM_DTM       DTM5;              /**< \brief 140, DTM channel objects */
    unsigned char          reserved_180[640]; /**< \brief 180, \internal Reserved */
} Ifx_GTM_CDTM;

/** \\brief  CMP object */
typedef volatile struct _Ifx_GTM_CMP
{
    Ifx_GTM_CMP_EN          EN;             /**< \brief 0, CMP comparator enable register */
    Ifx_GTM_CMP_IRQ_NOTIFY  IRQ_NOTIFY;     /**< \brief 4, CMP event notification register */
    Ifx_GTM_CMP_IRQ_EN      IRQ_EN;         /**< \brief 8, CMP interrupt enable register */
    Ifx_GTM_CMP_IRQ_FORCINT IRQ_FORCINT;    /**< \brief C, CMP interrupt force register */
    Ifx_GTM_CMP_IRQ_MODE    IRQ_MODE;       /**< \brief 10, CMP interrupt mode configuration register */
    Ifx_GTM_CMP_EIRQ_EN     EIRQ_EN;        /**< \brief 14, CMP error interrupt enable register */
} Ifx_GTM_CMP;

/** \\brief  CMU object */
typedef volatile struct _Ifx_GTM_CMU
{
    Ifx_GTM_CMU_CLK_EN   CLK_EN;            /**< \brief 0, CMU clock enable */
    Ifx_GTM_CMU_GCLK_NUM GCLK_NUM;          /**< \brief 4, CMU global clock control numerator */
    Ifx_GTM_CMU_GCLK_DEN GCLK_DEN;          /**< \brief 8, CMU global clock control denominator */
    Ifx_GTM_CMU_CLK0_5   CLK0_5[6];         /**< \brief C, CLK objects */
    Ifx_GTM_CMU_CLK_6    CLK_6;             /**< \brief 24, CLK objects */
    Ifx_GTM_CMU_CLK_7    CLK_7;             /**< \brief 28, CLK objects */
    Ifx_GTM_CMU_ECLK     ECLK[3];           /**< \brief 2C, ECLK objects */
    Ifx_GTM_CMU_FXCLK    FXCLK;             /**< \brief 44, FXCLK objects */
    Ifx_GTM_CMU_GLB_CTRL GLB_CTRL;          /**< \brief 48, CMU synchronizing ARU and clock source */
    Ifx_GTM_CMU_CLK_CTRL CLK_CTRL;          /**< \brief 4C, CMU control for clock source selection */
} Ifx_GTM_CMU;

