Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  DPLL object */
typedef volatile struct _Ifx_GTM_DPLL
{
    Ifx_GTM_DPLL_CTRL_0                CTRL_0;                /**< \brief 0, DPLL Control Register 0 */
    Ifx_GTM_DPLL_CTRL_1                CTRL_1;                /**< \brief 4, DPLL Control Register 1 */
    Ifx_GTM_DPLL_CTRL_2                CTRL_2;                /**< \brief 8, DPLL Control Register 2 */
    Ifx_GTM_DPLL_CTRL_3                CTRL_3;                /**< \brief C, DPLL Control Register 3 */
    Ifx_GTM_DPLL_CTRL_4                CTRL_4;                /**< \brief 10, DPLL Control Register 4 */
    Ifx_GTM_DPLL_CTRL_5                CTRL_5;                /**< \brief 14, DPLL Control Register 5 */
    Ifx_GTM_DPLL_ACT_STA               ACT_STA;               /**< \brief 18, DPLL ACTION Status Register with connected shadow register */
    Ifx_GTM_DPLL_OSW                   OSW;                   /**< \brief 1C, DPLL Offset And Switch Old/New Address Register */
    Ifx_GTM_DPLL_AOSV_2                AOSV_2;                /**< \brief 20, DPLL Address Offset Register of RAM 2 Regions */
    Ifx_GTM_DPLL_APT                   APT;                   /**< \brief 24, DPLL Actual RAM Pointer Address for TRIGGER */
    Ifx_GTM_DPLL_APS                   APS;                   /**< \brief 28, DPLL Actual RAM Pointer Address for STATE */
    Ifx_GTM_DPLL_APT_2C                APT_2C;                /**< \brief 2C, DPLL Actual RAM Pointer for Region 2C */
    Ifx_GTM_DPLL_APS_1C3               APS_1C3;               /**< \brief 30, DPLL Actual RAM Pointer for RAM Region 1C3 */
    Ifx_GTM_DPLL_NUTC                  NUTC;                  /**< \brief 34, DPLL Number of Recent TRIGGER Events Used for Calculations */
    Ifx_GTM_DPLL_NUSC                  NUSC;                  /**< \brief 38, DPLL Number of Recent STATE Events Used for Calculations */
    Ifx_GTM_DPLL_NTI_CNT               NTI_CNT;               /**< \brief 3C, DPLL Number of Active TRIGGER Events to Interrupt */
    Ifx_GTM_DPLL_IRQ_NOTIFY            IRQ_NOTIFY;            /**< \brief 40, DPLL Interrupt Notification Register */
    Ifx_GTM_DPLL_IRQ_EN                IRQ_EN;                /**< \brief 44, DPLL Interrupt Enable Register */
    Ifx_GTM_DPLL_IRQ_FORCINT           IRQ_FORCINT;           /**< \brief 48, DPLL Interrupt Force Register */
    Ifx_GTM_DPLL_IRQ_MODE              IRQ_MODE;              /**< \brief 4C, DPLL Interrupt Mode Register */
    Ifx_GTM_DPLL_EIRQ_EN               EIRQ_EN;               /**< \brief 50, DPLL Error Interrupt Enable Register */
    unsigned char                      reserved_54[92];       /**< \brief 54, \internal Reserved */
    Ifx_GTM_DPLL_INC_CNT1              INC_CNT1;              /**< \brief B0, DPLL Counter for Pulses for TBU_CH1_BASE to be sent in Automatic End Mode */
    Ifx_GTM_DPLL_INC_CNT2              INC_CNT2;              /**< \brief B4, DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End Mode */
    Ifx_GTM_DPLL_APT_SYNC              APT_SYNC;              /**< \brief B8, DPLL Old RAM Pointer and Offset Value for TRIGGER */
    Ifx_GTM_DPLL_APS_SYNC              APS_SYNC;              /**< \brief BC, DPLL Old RAM Pointer and Offset Value for STATE */
    Ifx_GTM_DPLL_TBU_TS0_T             TBU_TS0_T;             /**< \brief C0, DPLL TBU_TS0 Value at last TRIGGER Event */
    Ifx_GTM_DPLL_TBU_TS0_S             TBU_TS0_S;             /**< \brief C4, DPLL TBU_TS0 Value at last STATE Event */
    Ifx_GTM_DPLL_ADD_IN_LD1            ADD_IN_LD1;            /**< \brief C8, DPLL Direct Load Input Value for SUB_INC1 */
    Ifx_GTM_DPLL_ADD_IN_LD2            ADD_IN_LD2;            /**< \brief CC, DPLL Direct Load Input Value for SUB_INC2 */
    unsigned char                      reserved_D0[44];       /**< \brief D0, \internal Reserved */
    Ifx_GTM_DPLL_STATUS                STATUS;                /**< \brief FC, DPLL Status Register */
    Ifx_GTM_DPLL_ID_PMTR               ID_PMTR[32];           /**< \brief 100, DPLL ID Information For Input Signal PMT 0 Register */
    unsigned char                      reserved_180[96];      /**< \brief 180, \internal Reserved */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER CTRL_0_SHADOW_TRIGGER; /**< \brief 1E0, DPLL Control 0 Shadow Trigger Register */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE   CTRL_0_SHADOW_STATE;   /**< \brief 1E4, DPLL Control 0 Shadow STATE Register */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER CTRL_1_SHADOW_TRIGGER; /**< \brief 1E8, DPLL Control 1 Shadow TRIGGER Register */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE   CTRL_1_SHADOW_STATE;   /**< \brief 1EC, DPLL Control 1 Shadow STATE Register */
    unsigned char                      reserved_1F0[12];      /**< \brief 1F0, \internal Reserved */
    Ifx_GTM_DPLL_RAM_INI               RAM_INI;               /**< \brief 1FC, DPLL RAM Initialization Register */
    Ifx_GTM_DPLL_PSA                   PSA[32];               /**< \brief 200, DPLL ACTION Position/Value Request */
    Ifx_GTM_DPLL_DLA                   DLA[32];               /**< \brief 280, DPLL ACTION Time To React Before PSAz */
    Ifx_GTM_DPLL_NA                    NA[32];                /**< \brief 300, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
    Ifx_GTM_DPLL_DTA                   DTA[32];               /**< \brief 380, DPLL Calculated Relative TIME To ACTION */
    Ifx_GTM_DPLL_TS_T                  TS_T;                  /**< \brief 400, DPLL Actual TRIGGER Time Stamp Value */
    Ifx_GTM_DPLL_TS_T_OLD              TS_T_OLD;              /**< \brief 404, DPLL Previous TRIGGER Time Stamp Value */
    Ifx_GTM_DPLL_FTV_T                 FTV_T;                 /**< \brief 408, DPLL Actual TRIGGER Filter Value */
    unsigned char                      reserved_40C[4];       /**< \brief 40C, \internal Reserved */
    Ifx_GTM_DPLL_TS_S                  TS_S;                  /**< \brief 410, DPLL Actual STATE Time Stamp */
    Ifx_GTM_DPLL_TS_S_OLD              TS_S_OLD;              /**< \brief 414, DPLL Previous STATE Time Stamp */
    Ifx_GTM_DPLL_FTV_S                 FTV_S;                 /**< \brief 418, DPLL Actual STATE Filter Value */
    unsigned char                      reserved_41C[4];       /**< \brief 41C, \internal Reserved */
    Ifx_GTM_DPLL_THMI                  THMI;                  /**< \brief 420, DPLL TRIGGER Hold Time Minimum Value */
    Ifx_GTM_DPLL_THMA                  THMA;                  /**< \brief 424, DPLL TRIGGER Hold Time Maximum Value */
    Ifx_GTM_DPLL_THVAL                 THVAL;                 /**< \brief 428, DPLL Measured TRIGGER Hold Time Value */
    unsigned char                      reserved_42C[4];       /**< \brief 42C, \internal Reserved */
    Ifx_GTM_DPLL_TOV                   TOV;                   /**< \brief 430, DPLL Time Out Value of Active TRIGGER Slope */
    Ifx_GTM_DPLL_TOV_S                 TOV_S;                 /**< \brief 434, DPLL Time Out Value of active STATE Slope */
    Ifx_GTM_DPLL_ADD_IN_CAL1           ADD_IN_CAL1;           /**< \brief 438, DPLL Calculated ADD_IN Value for SUB_INC1 Generation */
    Ifx_GTM_DPLL_ADD_IN_CAL2           ADD_IN_CAL2;           /**< \brief 43C, DPLL Calculated ADD_IN Value for SUB_INC2 Generation */
    Ifx_GTM_DPLL_MPVAL1                MPVAL1;                /**< \brief 440, DPLL Missing Pulses to be Added or Subtracted Directly 1 */
    Ifx_GTM_DPLL_MPVAL2                MPVAL2;                /**< \brief 444, DPLL Missing Pulses to be Added or Subtracted Directly 2 */
    Ifx_GTM_DPLL_NMB_T_TAR             NMB_T_TAR;             /**< \brief 448, DPLL Target Number of Pulses to be Sent in Normal Mode */
    Ifx_GTM_DPLL_NMB_T_TAR_OLD         NMB_T_TAR_OLD;         /**< \brief 44C, DPLL Last but one Target Number of Pulses to be Sent in Normal Mode */
    Ifx_GTM_DPLL_NMB_S_TAR             NMB_S_TAR;             /**< \brief 450, DPLL Target Number of Pulses to be Sent in Emergency Mode */
    Ifx_GTM_DPLL_NMB_S_TAR_OLD         NMB_S_TAR_OLD;         /**< \brief 454, DPLL Last but one Target Number of Pulses to be Sent in Emergency Mode */
    unsigned char                      reserved_458[8];       /**< \brief 458, \internal Reserved */
    Ifx_GTM_DPLL_RCDT_TX               RCDT_TX;               /**< \brief 460, DPLL Reciprocal Value of the Expected Increment Duration of TRIGGER */
    Ifx_GTM_DPLL_RCDT_SX               RCDT_SX;               /**< \brief 464, DPLL Reciprocal Value of the Expected Increment Duration of STATE */
    Ifx_GTM_DPLL_RCDT_TX_NOM           RCDT_TX_NOM;           /**< \brief 468, DPLL Reciprocal Value of the Expected Nominal Increment Duration of TRIGGER */
    Ifx_GTM_DPLL_RCDT_SX_NOM           RCDT_SX_NOM;           /**< \brief 46C, DPLL Reciprocal Value of the Expected Nominal Increment Duration of STATE */
    Ifx_GTM_DPLL_RDT_T_ACT             RDT_T_ACT;             /**< \brief 470, DPLL Reciprocal Value of the Last Increment of TRIGGER */
    Ifx_GTM_DPLL_RDT_S_ACT             RDT_S_ACT;             /**< \brief 474, DPLL Reciprocal Value of the Last Increment of STATE */
    Ifx_GTM_DPLL_DT_T_ACT              DT_T_ACT;              /**< \brief 478, DPLL Duration of the Last TRIGGER Increment */
    Ifx_GTM_DPLL_DT_S_ACT              DT_S_ACT;              /**< \brief 47C, DPLL Duration of the Last STATE Increment */
    Ifx_GTM_DPLL_EDT_T                 EDT_T;                 /**< \brief 480, DPLL Difference of Prediction to Actual Value of the Last TRIGGER Increment */
    Ifx_GTM_DPLL_MEDT_T                MEDT_T;                /**< \brief 484, DPLL Weighted Difference of Prediction Errors of TRIGGER */
    Ifx_GTM_DPLL_EDT_S                 EDT_S;                 /**< \brief 488, DPLL Difference of Prediction to Actual Value of the Last STATE Increment */
    Ifx_GTM_DPLL_MEDT_S                MEDT_S;                /**< \brief 48C, DPLL Weighted Difference of Prediction Errors of STATE */
    Ifx_GTM_DPLL_CDT_TX                CDT_TX;                /**< \brief 490, DPLL Prediction of the Actual TRIGGER Increment Duration */
    Ifx_GTM_DPLL_CDT_SX                CDT_SX;                /**< \brief 494, DPLL Prediction of the Actual STATE Increment Duration */
    Ifx_GTM_DPLL_CDT_TX_NOM            CDT_TX_NOM;            /**< \brief 498, DPLL Prediction of the Nominal TRIGGER Increment Duration */
    Ifx_GTM_DPLL_CDT_SX_NOM            CDT_SX_NOM;            /**< \brief 49C, DPLL Prediction of the Nominal STATE Increment Duration */
    Ifx_GTM_DPLL_TLR                   TLR;                   /**< \brief 4A0, DPLL TRIGGER Locking Range */
    Ifx_GTM_DPLL_SLR                   SLR;                   /**< \brief 4A4, DPLL STATE Locking Range */
    unsigned char                      reserved_4A8[88];      /**< \brief 4A8, \internal Reserved */
    Ifx_GTM_DPLL_PDT_0                 PDT_0;                 /**< \brief 500, DPLL Projected Increment Sum Relations for Action 0 */
    Ifx_GTM_DPLL_PDT_1                 PDT_1;                 /**< \brief 504, DPLL Projected Increment Sum Relations for Action 1 */
    Ifx_GTM_DPLL_PDT_2                 PDT_2;                 /**< \brief 508, DPLL Projected Increment Sum Relations for Action 2 */
    Ifx_GTM_DPLL_PDT_3                 PDT_3;                 /**< \brief 50C, DPLL Projected Increment Sum Relations for Action 3 */
    Ifx_GTM_DPLL_PDT_4                 PDT_4;                 /**< \brief 510, DPLL Projected Increment Sum Relations for Action 4 */
    Ifx_GTM_DPLL_PDT_5                 PDT_5;                 /**< \brief 514, DPLL Projected Increment Sum Relations for Action 5 */
    Ifx_GTM_DPLL_PDT_6                 PDT_6;                 /**< \brief 518, DPLL Projected Increment Sum Relations for Action 6 */
    Ifx_GTM_DPLL_PDT_7                 PDT_7;                 /**< \brief 51C, DPLL Projected Increment Sum Relations for Action 7 */
    Ifx_GTM_DPLL_PDT_8                 PDT_8;                 /**< \brief 520, DPLL Projected Increment Sum Relations for Action 8 */
    Ifx_GTM_DPLL_PDT_9                 PDT_9;                 /**< \brief 524, DPLL Projected Increment Sum Relations for Action 9 */
    Ifx_GTM_DPLL_PDT_10                PDT_10;                /**< \brief 528, DPLL Projected Increment Sum Relations for Action 10 */
    Ifx_GTM_DPLL_PDT_11                PDT_11;                /**< \brief 52C, DPLL Projected Increment Sum Relations for Action 11 */
    Ifx_GTM_DPLL_PDT_12                PDT_12;                /**< \brief 530, DPLL Projected Increment Sum Relations for Action 12 */
    Ifx_GTM_DPLL_PDT_13                PDT_13;                /**< \brief 534, DPLL Projected Increment Sum Relations for Action 13 */
    Ifx_GTM_DPLL_PDT_14                PDT_14;                /**< \brief 538, DPLL Projected Increment Sum Relations for Action 14 */
    Ifx_GTM_DPLL_PDT_15                PDT_15;                /**< \brief 53C, DPLL Projected Increment Sum Relations for Action 15 */
    Ifx_GTM_DPLL_PDT_16                PDT_16;                /**< \brief 540, DPLL Projected Increment Sum Relations for Action 16 */
    Ifx_GTM_DPLL_PDT_17                PDT_17;                /**< \brief 544, DPLL Projected Increment Sum Relations for Action 17 */
    Ifx_GTM_DPLL_PDT_18                PDT_18;                /**< \brief 548, DPLL Projected Increment Sum Relations for Action 18 */
    Ifx_GTM_DPLL_PDT_19                PDT_19;                /**< \brief 54C, DPLL Projected Increment Sum Relations for Action 19 */
    Ifx_GTM_DPLL_PDT_20                PDT_20;                /**< \brief 550, DPLL Projected Increment Sum Relations for Action 20 */
    Ifx_GTM_DPLL_PDT_21                PDT_21;                /**< \brief 554, DPLL Projected Increment Sum Relations for Action 21 */
    Ifx_GTM_DPLL_PDT_22                PDT_22;                /**< \brief 558, DPLL Projected Increment Sum Relations for Action 22 */
    Ifx_GTM_DPLL_PDT_23                PDT_23;                /**< \brief 55C, DPLL Projected Increment Sum Relations for Action 23 */
    Ifx_GTM_DPLL_PDT_24                PDT_24;                /**< \brief 560, DPLL Projected Increment Sum Relations for Action 24 */
    Ifx_GTM_DPLL_PDT_25                PDT_25;                /**< \brief 564, DPLL Projected Increment Sum Relations for Action 25 */
    Ifx_GTM_DPLL_PDT_26                PDT_26;                /**< \brief 568, DPLL Projected Increment Sum Relations for Action 26 */
    Ifx_GTM_DPLL_PDT_27                PDT_27;                /**< \brief 56C, DPLL Projected Increment Sum Relations for Action 27 */
    Ifx_GTM_DPLL_PDT_28                PDT_28;                /**< \brief 570, DPLL Projected Increment Sum Relations for Action 28 */
    Ifx_GTM_DPLL_PDT_29                PDT_29;                /**< \brief 574, DPLL Projected Increment Sum Relations for Action 29 */
    Ifx_GTM_DPLL_PDT_30                PDT_30;                /**< \brief 578, DPLL Projected Increment Sum Relations for Action 30 */
    Ifx_GTM_DPLL_PDT_31                PDT_31;                /**< \brief 57C, DPLL Projected Increment Sum Relations for Action 31 */
    unsigned char                      reserved_580[64];      /**< \brief 580, \internal Reserved */
    Ifx_GTM_DPLL_MLS1                  MLS1;                  /**< \brief 5C0, DPLL Calculated Number of Sub-Pulses between two nominal STATE Events for SMC=0 */
    Ifx_GTM_DPLL_MLS2                  MLS2;                  /**< \brief 5C4, DPLL Calculated Number of Sub-Pulses between two nominal STATE Events for SMC=1 and RMO=1 */
    Ifx_GTM_DPLL_CNT_NUM_1             CNT_NUM_1;             /**< \brief 5C8, DPLL Number of Sub-Pulses of SUB_INC1 in Continuous Mode */
    Ifx_GTM_DPLL_CNT_NUM_2             CNT_NUM_2;             /**< \brief 5CC, DPLL Number of Sub-Pulses of SUB_INC2 in Continuous Mode */
    Ifx_GTM_DPLL_PVT                   PVT;                   /**< \brief 5D0, DPLL Plausibility Value of Next TRIGGER Slope */
    unsigned char                      reserved_5D4[12];      /**< \brief 5D4, \internal Reserved */
    Ifx_GTM_DPLL_PSTC                  PSTC;                  /**< \brief 5E0, DPLL Actual Calculated Position Stamp of TRIGGER */
    Ifx_GTM_DPLL_PSSC                  PSSC;                  /**< \brief 5E4, DPLL Actual Calculated Position Stamp of STATE */
    Ifx_GTM_DPLL_PSTM                  PSTM;                  /**< \brief 5E8, DPLL Measured Position Stamp at Last TRIGGER Input */
    Ifx_GTM_DPLL_PSTM_OLD              PSTM_OLD;              /**< \brief 5EC, DPLL Measured Position Stamp at Last but one TRIGGER Input */
    Ifx_GTM_DPLL_PSSM                  PSSM;                  /**< \brief 5F0, DPLL Measured Position Stamp at Last STATE Input */
    Ifx_GTM_DPLL_PSSM_OLD              PSSM_OLD;              /**< \brief 5F4, DPLL Measured Position Stamp at Last but one STATE Input */
    Ifx_GTM_DPLL_NMB_T                 NMB_T;                 /**< \brief 5F8, DPLL Number of Pulses to be Sent in Normal Mode */
    Ifx_GTM_DPLL_NMB_S                 NMB_S;                 /**< \brief 5FC, DPLL Number of Pulses to be Sent in Emergency Mode */
    Ifx_GTM_DPLL_RDT_S                 RDT_S[64];             /**< \brief 600, DPLL Reciprocal Values of the Nominal STATE Increment Duration in FULL_SCALE */
    Ifx_GTM_DPLL_TSF_S                 TSF_S[64];             /**< \brief 700, DPLL Time Stamp Values of the Nominal STATE Events in FULL_SCALE */
    Ifx_GTM_DPLL_ADT_S                 ADT_S[64];             /**< \brief 800, DPLL Adapt and Profile Values of the STATE Increments in FULL_SCALE */
    Ifx_GTM_DPLL_DT_S                  DT_S[64];              /**< \brief 900, DPLL Nominal STATE Increment Duration in FULL_SCALE */
    unsigned char                      reserved_A00[1024];    /**< \brief A00, \internal Reserved */
    Ifx_GTM_DPLL_TSAC                  TSAC[32];              /**< \brief E00, DPLL Calculated Time Value to start Action 0 Register */
    Ifx_GTM_DPLL_PSAC                  PSAC[32];              /**< \brief E80, DPLL ACTION Position/Value Action 0 Request Register */
    Ifx_GTM_DPLL_ACB_0                 ACB_0;                 /**< \brief F00, DPLL Control Bits Register 0 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_1                 ACB_1;                 /**< \brief F04, DPLL Control Bits Register 1 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_2                 ACB_2;                 /**< \brief F08, DPLL Control Bits Register 2 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_3                 ACB_3;                 /**< \brief F0C, DPLL Control Bits Register 3 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_4                 ACB_4;                 /**< \brief F10, DPLL Control Bits Register 4 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_5                 ACB_5;                 /**< \brief F14, DPLL Control Bits Register 5 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_6                 ACB_6;                 /**< \brief F18, DPLL Control Bits Register 6 for up to 32 Actions */
    Ifx_GTM_DPLL_ACB_7                 ACB_7;                 /**< \brief F1C, DPLL Control Bits Register 7 for up to 32 Actions */
    Ifx_GTM_DPLL_CTRL_11               CTRL_11;               /**< \brief F20, DPLL Control Register 11 */
    Ifx_GTM_DPLL_THVAL2                THVAL2;                /**< \brief F24, DPLL Immediate THVAL Value Register */
    Ifx_GTM_DPLL_TIDEL                 TIDEL;                 /**< \brief F28, DPLL Additional TRIGGER Input Register */
    Ifx_GTM_DPLL_SIDEL                 SIDEL;                 /**< \brief F2C, DPLL Additional STATE Input Delay Register */
    Ifx_GTM_DPLL_APS_SYNC_EXT          APS_SYNC_EXT;          /**< \brief F30, DPLL Extension register for DPLL_APS_SYNC) */
    Ifx_GTM_DPLL_CTRL_EXT              CTRL_EXT;              /**< \brief F34, DPLL Extension register for DPLL_CTRL) */
    Ifx_GTM_DPLL_APS_EXT               APS_EXT;               /**< \brief F38, DPLL Extension register for DPLL_APS 4) */
    Ifx_GTM_DPLL_APS_1C3_EXT           APS_1C3_EXT;           /**< \brief F3C, DPLL Extension register for DPLL_APS_1C3) */
    Ifx_GTM_DPLL_STA                   STA;                   /**< \brief F40, DPLL Status of the State Machine States Register */
    Ifx_GTM_DPLL_INCF1_OFFSET          INCF1_OFFSET;          /**< \brief F44, DPLL Start Value of the ADD_IN_ADDER1 Register */
    Ifx_GTM_DPLL_INCF2_OFFSET          INCF2_OFFSET;          /**< \brief F48, DPLL Start Value of the ADD_IN_ADDER2 Register */
    Ifx_GTM_DPLL_DT_T_START            DT_T_START;            /**< \brief F4C, DPLL Start Value of DPLL_DT_T_ACT for the first Increment after SIP1 is set to 1 */
    Ifx_GTM_DPLL_DT_S_START            DT_S_START;            /**< \brief F50, DPLL Start Value of DPLL_DT_S_ACT for the first Increment after SIP2 is set to 1 */
    Ifx_GTM_DPLL_STA_MASK              STA_MASK;              /**< \brief F54, DPLL Trigger Masks for Signals DPLL_STA_T and DPLL_STA_S */
    Ifx_GTM_DPLL_STA_FLAG              STA_FLAG;              /**< \brief F58, DPLL STA Flag Register */
    Ifx_GTM_DPLL_INC_CNT1_MASK         INC_CNT1_MASK;         /**< \brief F5C, DPLL INC_CNT1 Trigger Mask */
    Ifx_GTM_DPLL_INC_CNT2_MASK         INC_CNT2_MASK;         /**< \brief F60, DPLL INC_CNT2 Trigger Mask */
    Ifx_GTM_DPLL_NUSC_EXT1             NUSC_EXT1;             /**< \brief F64, DPLL Extension register number 1 for DPLL_NUSC 4 */
    Ifx_GTM_DPLL_NUSC_EXT2             NUSC_EXT2;             /**< \brief F68, DPLL Extension register number 2 for DPLL_NUSC 4 */
    Ifx_GTM_DPLL_CTN_MIN               CTN_MIN;               /**< \brief F6C, DPLL Minimum CDT_T Nominal Value Register */
    Ifx_GTM_DPLL_CTN_MAX               CTN_MAX;               /**< \brief F70, DPLL Maximum CDT_T Nominal Value Register */
    Ifx_GTM_DPLL_CSN_MIN               CSN_MIN;               /**< \brief F74, DPLL Minimum CDT_S Nominal Value Register */
    Ifx_GTM_DPLL_CSN_MAX               CSN_MAX;               /**< \brief F78, DPLL Maximum CDT_S Nominal Value Register */
} Ifx_GTM_DPLL;

/** \\brief  F2A object */
typedef volatile struct _Ifx_GTM_F2A
{
    Ifx_GTM_F2A_RD_CH  RD_CH[8];            /**< \brief 0, F2A ARU RD FIFO address */
    Ifx_GTM_F2A_STR_CH STR_CH[8];           /**< \brief 20, F2A Stream configuration */
    Ifx_GTM_F2A_ENABLE ENABLE;              /**< \brief 40, F2A0 stream activation register */
    Ifx_GTM_F2A_CTRL   CTRL;                /**< \brief 44, F2A0 stream control register */
    unsigned char      reserved_48[56];     /**< \brief 48, \internal Reserved */
} Ifx_GTM_F2A;

