Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  FIFO object */
typedef volatile struct _Ifx_GTM_FIFO
{
    Ifx_GTM_FIFO_CH CH[8];                  /**< \brief 0, FIFO channel */
    unsigned char   reserved_200[14848];    /**< \brief 200, \internal Reserved */
} Ifx_GTM_FIFO;

/** \\brief  ICM object */
typedef volatile struct _Ifx_GTM_ICM
{
    Ifx_GTM_ICM_IRQG_0         IRQG_0;           /**< \brief 0, ICM Interrupt group register covering infrastructure and safety components ARU, BRC, AEI, PSM0, PSM1, MAP, CMP,SPE */
    Ifx_GTM_ICM_IRQG_1         IRQG_1;           /**< \brief 4, ICM Interrupt group register covering DPLL */
    Ifx_GTM_ICM_IRQG_2         IRQG_2;           /**< \brief 8, ICM Interrupt group register covering TIM0, TIM1, TIM2, TIM3 */
    Ifx_GTM_ICM_IRQG_3         IRQG_3;           /**< \brief C, ICM Interrupt group register covering TIM4, TIM5, TIM6, TIM7 */
    Ifx_GTM_ICM_IRQG_4         IRQG_4;           /**< \brief 10, ICM Interrupt group register covering MCS0 to MCS3 sub-modules */
    Ifx_GTM_ICM_IRQG_5         IRQG_5;           /**< \brief 14, ICM Interrupt group register covering MCS4 to MCS6 sub-modules */
    Ifx_GTM_ICM_IRQG_6         IRQG_6;           /**< \brief 18, ICM Interrupt group register covering GTM output sub-modules TOM0 to TOM1 */
    Ifx_GTM_ICM_IRQG_7         IRQG_7;           /**< \brief 1C, ICM Interrupt group register covering GTM output sub-modules TOM2 to TOM3 */
    Ifx_GTM_ICM_IRQG_8         IRQG_8;           /**< \brief 20, ICM Interrupt group register covering GTM output sub-modules TOM4 to TOM5 */
    Ifx_GTM_ICM_IRQG_9         IRQG_9;           /**< \brief 24, ICM Interrupt group register covering GTM output sub-modules ATOM0, ATOM1, ATOM2 and ATOM3 */
    Ifx_GTM_ICM_IRQG_10        IRQG_10;          /**< \brief 28, ICM Interrupt group register covering GTM output sub-modules ATOM4 to ATOM7 */
    Ifx_GTM_ICM_IRQG_11        IRQG_11;          /**< \brief 2C, ICM Interrupt group register covering GTM output sub-modules ATOM8 to ATOM11 */
    Ifx_GTM_ICM_IRQG_MEI       IRQG_MEI;         /**< \brief 30, ICM Interrupt group register for module error interrupt information */
    Ifx_GTM_ICM_IRQG_CEI0      IRQG_CEI0;        /**< \brief 34, ICM Interrupt group register 0 for channel error interrupt information */
    Ifx_GTM_ICM_IRQG_CEI1      IRQG_CEI1;        /**< \brief 38, ICM Interrupt group register 1 for channel error interrupt information */
    Ifx_GTM_ICM_IRQG_CEI2      IRQG_CEI2;        /**< \brief 3C, ICM Interrupt group register 2 for channel error interrupt information */
    Ifx_GTM_ICM_IRQG_CEI3      IRQG_CEI3;        /**< \brief 40, ICM Interrupt group register 3 for channel error interrupt information */
    Ifx_GTM_ICM_IRQG_CEI4      IRQG_CEI4;        /**< \brief 44, ICM Interrupt group register 4 for channel error interrupt information */
    unsigned char              reserved_48[28];  /**< \brief 48, \internal Reserved */
    Ifx_GTM_ICM_IRQG_MCS0_CEI  IRQG_MCS0_CEI;    /**< \brief 64, ICM Interrupt group MCS 0 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS1_CEI  IRQG_MCS1_CEI;    /**< \brief 68, ICM Interrupt group MCS 1 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS2_CEI  IRQG_MCS2_CEI;    /**< \brief 6C, ICM Interrupt group MCS 2 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS3_CEI  IRQG_MCS3_CEI;    /**< \brief 70, ICM Interrupt group MCS 3 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS4_CEI  IRQG_MCS4_CEI;    /**< \brief 74, ICM Interrupt group MCS 4 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS5_CEI  IRQG_MCS5_CEI;    /**< \brief 78, ICM Interrupt group MCS 5 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS6_CEI  IRQG_MCS6_CEI;    /**< \brief 7C, ICM Interrupt group MCS 6 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS7_CEI  IRQG_MCS7_CEI;    /**< \brief 80, ICM Interrupt group MCS 7 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS8_CEI  IRQG_MCS8_CEI;    /**< \brief 84, ICM Interrupt group MCS 8 for Channel Error Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS9_CEI  IRQG_MCS9_CEI;    /**< \brief 88, ICM Interrupt group MCS 9 for Channel Error Interrupt information */
    unsigned char              reserved_8C[24];  /**< \brief 8C, \internal Reserved */
    Ifx_GTM_ICM_IRQG_PSM_0_CEI IRQG_PSM_0_CEI;   /**< \brief A4, ICM Interrupt group PSM 0 for Channel Error Interrupt information of FIFO0, FIFO1, FIFO2 */
    unsigned char              reserved_A8[12];  /**< \brief A8, \internal Reserved */
    Ifx_GTM_ICM_IRQG_SPE_CEI   IRQG_SPE_CEI;     /**< \brief B4, ICM Interrupt group SPE for module Error Interrupt information */
    unsigned char              reserved_B8[88];  /**< \brief B8, \internal Reserved */
    Ifx_GTM_ICM_IRQG_CLS_0_MEI IRQG_CLS_0_MEI;   /**< \brief 110, ICM Interrupt group for module Error Interrupt information for each TIMm, MCSm, SPEm, FIFOm */
    Ifx_GTM_ICM_IRQG_CLS_1_MEI IRQG_CLS_1_MEI;   /**< \brief 114, ICM Interrupt group for module Error Interrupt information for each TIMm, MCSm, SPEm, FIFOm */
    Ifx_GTM_ICM_IRQG_CLS_2_MEI IRQG_CLS_2_MEI;   /**< \brief 118, ICM Interrupt group for module Error Interrupt information for each TIMm, MCSm, SPEm, FIFOm */
    unsigned char              reserved_11C[4];  /**< \brief 11C, \internal Reserved */
    Ifx_GTM_ICM_IRQG_MCS0_CI   IRQG_MCS0_CI;     /**< \brief 120, ICM Interrupt group MCS 0 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS1_CI   IRQG_MCS1_CI;     /**< \brief 124, ICM Interrupt group MCS 1 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS2_CI   IRQG_MCS2_CI;     /**< \brief 128, ICM Interrupt group MCS 2 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS3_CI   IRQG_MCS3_CI;     /**< \brief 12C, ICM Interrupt group MCS 3 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS4_CI   IRQG_MCS4_CI;     /**< \brief 130, ICM Interrupt group MCS 4 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS5_CI   IRQG_MCS5_CI;     /**< \brief 134, ICM Interrupt group MCS 5 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS6_CI   IRQG_MCS6_CI;     /**< \brief 138, ICM Interrupt group MCS 6 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS7_CI   IRQG_MCS7_CI;     /**< \brief 13C, ICM Interrupt group MCS 7 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS8_CI   IRQG_MCS8_CI;     /**< \brief 140, ICM Interrupt group MCS 8 for Channel Interrupt information */
    Ifx_GTM_ICM_IRQG_MCS9_CI   IRQG_MCS9_CI;     /**< \brief 144, ICM Interrupt group MCS 9 for Channel Interrupt information */
    unsigned char              reserved_148[24]; /**< \brief 148, \internal Reserved */
    Ifx_GTM_ICM_IRQG_PSM_0_CI  IRQG_PSM_0_CI;    /**< \brief 160, ICM Interrupt group PSM 0 for Channel Interrupt information of FIFO0, FIFO1, FIFO2 */
    unsigned char              reserved_164[12]; /**< \brief 164, \internal Reserved */
    Ifx_GTM_ICM_IRQG_SPE_CI    IRQG_SPE_CI;      /**< \brief 170, ICM Interrupt group SPE for module Interrupt information */
    unsigned char              reserved_174[28]; /**< \brief 174, \internal Reserved */
    Ifx_GTM_ICM_IRQG_ATOM_0_CI IRQG_ATOM_0_CI;   /**< \brief 190, ICM Interrupt group ATOM 0 for Channel Interrupt information of ATOMm */
    Ifx_GTM_ICM_IRQG_ATOM_1_CI IRQG_ATOM_1_CI;   /**< \brief 194, ICM Interrupt group ATOM 1 for Channel Interrupt information of ATOMm */
    Ifx_GTM_ICM_IRQG_ATOM_2_CI IRQG_ATOM_2_CI;   /**< \brief 198, ICM Interrupt group ATOM 2 for Channel Interrupt information of ATOMm */
    unsigned char              reserved_19C[4];  /**< \brief 19C, \internal Reserved */
    Ifx_GTM_ICM_IRQG_TOM_0_CI  IRQG_TOM_0_CI;    /**< \brief 1A0, ICM Interrupt group TOM 0 for Channel Interrupt information of TOMm */
    Ifx_GTM_ICM_IRQG_TOM_1_CI  IRQG_TOM_1_CI;    /**< \brief 1A4, ICM Interrupt group TOM 1 for Channel Interrupt information of TOMm */
    Ifx_GTM_ICM_IRQG_TOM_2_CI  IRQG_TOM_2_CI;    /**< \brief 1A8, ICM Interrupt group TOM 2 for Channel Interrupt information of TOMm */
} Ifx_GTM_ICM;

/** \\brief  INSEL / OUTSEL object */
typedef volatile struct _Ifx_GTM_INOUTSEL
{
    Ifx_GTM_INOUTSEL_TIM           TIM[8];        /**< \brief 0, TIM */
    Ifx_GTM_INOUTSEL_T             T;             /**< \brief 20, Timer */
    Ifx_GTM_INOUTSEL_DSADC         DSADC;         /**< \brief A8, DSADC */
    Ifx_GTM_INOUTSEL_ADCTRIG       ADCTRIG;       /**< \brief E0, ADCTRIG */
    Ifx_GTM_INOUTSEL_CAN           CAN;           /**< \brief 100, CAN */
    Ifx_GTM_INOUTSEL_OTBU0T        OTBU0T;        /**< \brief 104, OCDS TBU0 Trigger Register */
    Ifx_GTM_INOUTSEL_OTBU1T        OTBU1T;        /**< \brief 108, OCDS TBU1 Trigger Register */
    Ifx_GTM_INOUTSEL_OTBU2T        OTBU2T;        /**< \brief 10C, OCDS TBU2 Trigger Register */
    Ifx_GTM_INOUTSEL_OTSS          OTSS;          /**< \brief 110, OCDS Trigger Set Select Register */
    Ifx_GTM_INOUTSEL_OTSC0         OTSC0;         /**< \brief 114, OCDS Trigger Set Control 0 Register */
    Ifx_GTM_INOUTSEL_OTSC1         OTSC1;         /**< \brief 118, OCDS Trigger Set Control 1 Register */
    Ifx_GTM_INOUTSEL_ODA           ODA;           /**< \brief 11C, OCDS Debug Access Register */
    Ifx_GTM_INOUTSEL_OCS           OCS;           /**< \brief 120, OCDS Control and Status */
    Ifx_GTM_INOUTSEL_RESET_CLR     RESET_CLR;     /**< \brief 124, Kernel Reset Status Clear Register */
    Ifx_GTM_INOUTSEL_RESET2        RESET2;        /**< \brief 128, Kernel Reset Register 1 */
    Ifx_GTM_INOUTSEL_RESET1        RESET1;        /**< \brief 12C, Kernel Reset Register 0 */
    Ifx_GTM_INOUTSEL_ACCEN1        ACCEN1;        /**< \brief 130, Access Enable Register 1 */
    Ifx_GTM_INOUTSEL_ACCEN0        ACCEN0;        /**< \brief 134, Access Enable Register 0 */
    Ifx_GTM_INOUTSEL_DXOUTCON      DXOUTCON;      /**< \brief 138, Data Exchange Output Control Register */
    Ifx_GTM_INOUTSEL_TRIG          TRIG;          /**< \brief 13C, TRIG */
    Ifx_GTM_INOUTSEL_INT           INT;           /**< \brief 164, INT */
    Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL MCSTRIGOUTSEL; /**< \brief 18C, Trigger Output Sel Register */
    Ifx_GTM_INOUTSEL_MCSINTSTAT    MCSINTSTAT;    /**< \brief 190, MCS Interrupt Status Register */
    Ifx_GTM_INOUTSEL_MCSINTCLR     MCSINTCLR;     /**< \brief 194, MCS Interrupt Clear Register */
    Ifx_GTM_INOUTSEL_DXINCON       DXINCON;       /**< \brief 198, Data Exchange Input Control Register */
    Ifx_GTM_INOUTSEL_DATA          DATA;          /**< \brief 19C, DATAIN */
    Ifx_GTM_INOUTSEL_MSC           MSC;           /**< \brief 1C4, MSC */
    Ifx_GTM_INOUTSEL_PSI5OUTSEL    PSI5OUTSEL;    /**< \brief 284, PSI5 Output Select 0 Register */
    Ifx_GTM_INOUTSEL_PSI5S         PSI5S;         /**< \brief 288, PSI5S */
} Ifx_GTM_INOUTSEL;

/** \\brief  MCS objects */
typedef volatile struct _Ifx_GTM_MCS
{
    Ifx_GTM_MCS_CH0       CH0;                /**< \brief 0, MCS channel0 object */
    unsigned char         reserved_58[8];     /**< \brief 58, \internal Reserved */
    Ifx_GTM_MCS_REG_PROT  REG_PROT;           /**< \brief 60, MCS write protection register */
    Ifx_GTM_MCS_CTRL_STAT CTRL_STAT;          /**< \brief 64, MCS control and status register */
    Ifx_GTM_MCS_RESET     RESET;              /**< \brief 68, MCS reset register */
    Ifx_GTM_MCS_CAT       CAT;                /**< \brief 6C, MCS cancel ARU transfer instruction */
    Ifx_GTM_MCS_CWT       CWT;                /**< \brief 70, MCS cancel WURM instruction */
    unsigned char         reserved_74[8];     /**< \brief 74, \internal Reserved */
    Ifx_GTM_MCS_ERR       ERR;                /**< \brief 7C, MCS error register */
    Ifx_GTM_MCS_CH        CH1;                /**< \brief 80, MCS channel objects */
    Ifx_GTM_MCS_CH        CH2;                /**< \brief 100, MCS channel objects */
    Ifx_GTM_MCS_CH        CH3;                /**< \brief 180, MCS channel objects */
    Ifx_GTM_MCS_CH        CH4;                /**< \brief 200, MCS channel objects */
    Ifx_GTM_MCS_CH        CH5;                /**< \brief 280, MCS channel objects */
    Ifx_GTM_MCS_CH        CH6;                /**< \brief 300, MCS channel objects */
    Ifx_GTM_MCS_CH        CH7;                /**< \brief 380, MCS channel objects */
    unsigned char         reserved_400[3072]; /**< \brief 400, \internal Reserved */
} Ifx_GTM_MCS;

/** \\brief  MON object */
typedef volatile struct _Ifx_GTM_MON
{
    Ifx_GTM_MON_STATUS        STATUS;        /**< \brief 0, Monitor status register */
    Ifx_GTM_MON_ACTIVITY_0    ACTIVITY_0;    /**< \brief 4, Monitor activity register 0 */
    Ifx_GTM_MON_ACTIVITY_1    ACTIVITY_1;    /**< \brief 8, Monitor activity register 1 */
    Ifx_GTM_MON_ACTIVITY_MCS0 ACTIVITY_MCS0; /**< \brief C, Monitor activity register for MCS 0 */
    Ifx_GTM_MON_ACTIVITY_MCS1 ACTIVITY_MCS1; /**< \brief 10, Monitor activity register for MCS 1 */
    Ifx_GTM_MON_ACTIVITY_MCS2 ACTIVITY_MCS2; /**< \brief 14, Monitor activity register for MCS 2 */
    Ifx_GTM_MON_ACTIVITY_MCS3 ACTIVITY_MCS3; /**< \brief 18, Monitor activity register for MCS 3 */
    Ifx_GTM_MON_ACTIVITY_MCS4 ACTIVITY_MCS4; /**< \brief 1C, Monitor activity register for MCS 4 */
    Ifx_GTM_MON_ACTIVITY_MCS5 ACTIVITY_MCS5; /**< \brief 20, Monitor activity register for MCS 5 */
    Ifx_GTM_MON_ACTIVITY_MCS6 ACTIVITY_MCS6; /**< \brief 24, Monitor activity register for MCS 6 */
    Ifx_GTM_MON_ACTIVITY_MCS7 ACTIVITY_MCS7; /**< \brief 28, Monitor activity register for MCS 7 */
    Ifx_GTM_MON_ACTIVITY_MCS8 ACTIVITY_MCS8; /**< \brief 2C, Monitor activity register for MCS 8 */
    Ifx_GTM_MON_ACTIVITY_MCS9 ACTIVITY_MCS9; /**< \brief 30, Monitor activity register for MCS 9 */
} Ifx_GTM_MON;

/** \\brief  SPE objects */
typedef volatile struct _Ifx_GTM_SPE
{
    Ifx_GTM_SPE_CTRL_STAT   CTRL_STAT;       /**< \brief 0, SPE Control status register */
    Ifx_GTM_SPE_PAT         PAT;             /**< \brief 4, SPE Input pattern definition register. */
    Ifx_GTM_SPE_OUT_PAT     OUT_PAT[8];      /**< \brief 8, SPE Output definition register */
    Ifx_GTM_SPE_OUT_CTRL    OUT_CTRL;        /**< \brief 28, SPE output control register */
    Ifx_GTM_SPE_IRQ_NOTIFY  IRQ_NOTIFY;      /**< \brief 2C, SPE Interrupt notification register. */
    Ifx_GTM_SPE_IRQ_EN      IRQ_EN;          /**< \brief 30, SPE Interrupt enable register. */
    Ifx_GTM_SPE_IRQ_FORCINT IRQ_FORCINT;     /**< \brief 34, SPE Interrupt generation by software. */
    Ifx_GTM_SPE_IRQ_MODE    IRQ_MODE;        /**< \brief 38, SPE Interrupt mode configuration register */
    Ifx_GTM_SPE_EIRQ_EN     EIRQ_EN;         /**< \brief 3C, SPE Error interrupt enable register. */
    Ifx_GTM_SPE_REV_CNT     REV_CNT;         /**< \brief 40, SPE input revolution counter */
    Ifx_GTM_SPE_REV_CMP     REV_CMP;         /**< \brief 44, SPE Revolution counter compare value */
    Ifx_GTM_SPE_CTRL_STAT2  CTRL_STAT2;      /**< \brief 48, SPE Control status register 2 */
    Ifx_GTM_SPE_CMD         CMD;             /**< \brief 4C, SPE Command register */
    unsigned char           reserved_50[48]; /**< \brief 50, \internal Reserved */
} Ifx_GTM_SPE;

/** \\brief  TBU object */
typedef volatile struct _Ifx_GTM_TBU
{
    Ifx_GTM_TBU_CHEN             CHEN;             /**< \brief 0, TBU global channel enable */
    Ifx_GTM_TBU_CH0_CTRL         CH0_CTRL;         /**< \brief 4, TBU channel 0 control */
    Ifx_GTM_TBU_CH0_BASE         CH0_BASE;         /**< \brief 8, TBU channel 0 base */
    Ifx_GTM_TBU_CH1_CTRL         CH1_CTRL;         /**< \brief C, TBU channel 1 control */
    Ifx_GTM_TBU_CH1_BASE         CH1_BASE;         /**< \brief 10, TBU Channel 1 Base Register */
    Ifx_GTM_TBU_CH2_CTRL         CH2_CTRL;         /**< \brief 14, TBU channel 2 control */
    Ifx_GTM_TBU_CH2_BASE         CH2_BASE;         /**< \brief 18, TBU Channel 2 Base Register */
    Ifx_GTM_TBU_CH3_CTRL         CH3_CTRL;         /**< \brief 1C, TBU channel 3 control */
    Ifx_GTM_TBU_CH3_BASE         CH3_BASE;         /**< \brief 20, TBU channel 3 base */
    Ifx_GTM_TBU_CH3_BASE_MARK    CH3_BASE_MARK;    /**< \brief 24, TBU channel 3 modulo value */
    Ifx_GTM_TBU_CH3_BASE_CAPTURE CH3_BASE_CAPTURE; /**< \brief 28, TBU channel 3 base captured */
} Ifx_GTM_TBU;

/** \\brief  TIM objects */
typedef volatile struct _Ifx_GTM_TIM
{
    Ifx_GTM_TIM_CH      CH0;                /**< \brief 0, TIM channel objects */
    Ifx_GTM_TIM_INP_VAL INP_VAL;            /**< \brief 74, TIM input value observation register */
    Ifx_GTM_TIM_IN_SRC  IN_SRC;             /**< \brief 78, TIM channel x AUX IN source selection register */
    Ifx_GTM_TIM_RST     RST;                /**< \brief 7C, TIM global software reset register */
    Ifx_GTM_TIM_CH      CH1;                /**< \brief 80, TIM channel objects */
    unsigned char       reserved_F4[12];    /**< \brief F4, \internal Reserved */
    Ifx_GTM_TIM_CH      CH2;                /**< \brief 100, TIM channel objects */
    unsigned char       reserved_174[12];   /**< \brief 174, \internal Reserved */
    Ifx_GTM_TIM_CH      CH3;                /**< \brief 180, TIM channel objects */
    unsigned char       reserved_1F4[12];   /**< \brief 1F4, \internal Reserved */
    Ifx_GTM_TIM_CH      CH4;                /**< \brief 200, TIM channel objects */
    unsigned char       reserved_274[12];   /**< \brief 274, \internal Reserved */
    Ifx_GTM_TIM_CH      CH5;                /**< \brief 280, TIM channel objects */
    unsigned char       reserved_2F4[12];   /**< \brief 2F4, \internal Reserved */
    Ifx_GTM_TIM_CH      CH6;                /**< \brief 300, TIM channel objects */
    unsigned char       reserved_374[12];   /**< \brief 374, \internal Reserved */
    Ifx_GTM_TIM_CH      CH7;                /**< \brief 380, TIM channel objects */
    unsigned char       reserved_3F4[1036]; /**< \brief 3F4, \internal Reserved */
} Ifx_GTM_TIM;

