Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_regdef.h
/** \\brief  TOM objects */
typedef volatile struct _Ifx_GTM_TOM
{
    Ifx_GTM_TOM_CH              CH0;                /**< \brief 0, TOM channel objects */
    Ifx_GTM_TOM_TGC0_GLB_CTRL   TGC0_GLB_CTRL;      /**< \brief 30, TOM TGC 0 global control register */
    Ifx_GTM_TOM_TGC0_ACT_TB     TGC0_ACT_TB;        /**< \brief 34, TOM TGC 0 action time base register */
    Ifx_GTM_TOM_TGC0_FUPD_CTRL  TGC0_FUPD_CTRL;     /**< \brief 38, TOM TGC 0 force update control register */
    Ifx_GTM_TOM_TGC0_INT_TRIG   TGC0_INT_TRIG;      /**< \brief 3C, TOM TGC 0 internal trigger control register */
    Ifx_GTM_TOM_CH              CH1;                /**< \brief 40, TOM channel objects */
    Ifx_GTM_TOM_TGC0_ENDIS_CTRL TGC0_ENDIS_CTRL;    /**< \brief 70, TOM TGC 0 enable/disable control register */
    Ifx_GTM_TOM_TGC0_ENDIS_STAT TGC0_ENDIS_STAT;    /**< \brief 74, TOM TGC 0 enable/disable status register */
    Ifx_GTM_TOM_TGC0_OUTEN_CTRL TGC0_OUTEN_CTRL;    /**< \brief 78, TOM TGC 0 output enable control register */
    Ifx_GTM_TOM_TGC0_OUTEN_STAT TGC0_OUTEN_STAT;    /**< \brief 7C, TOM TGC 0 output enable status register */
    Ifx_GTM_TOM_CH              CH2;                /**< \brief 80, TOM channel objects */
    unsigned char               reserved_B0[16];    /**< \brief B0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH3;                /**< \brief C0, TOM channel objects */
    unsigned char               reserved_F0[16];    /**< \brief F0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH4;                /**< \brief 100, TOM channel objects */
    unsigned char               reserved_130[16];   /**< \brief 130, \internal Reserved */
    Ifx_GTM_TOM_CH              CH5;                /**< \brief 140, TOM channel objects */
    unsigned char               reserved_170[16];   /**< \brief 170, \internal Reserved */
    Ifx_GTM_TOM_CH              CH6;                /**< \brief 180, TOM channel objects */
    unsigned char               reserved_1B0[16];   /**< \brief 1B0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH7;                /**< \brief 1C0, TOM channel objects */
    unsigned char               reserved_1F0[16];   /**< \brief 1F0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH8;                /**< \brief 200, TOM channel objects */
    Ifx_GTM_TOM_TGC1_GLB_CTRL   TGC1_GLB_CTRL;      /**< \brief 230, TOM TGC 1 global control register */
    Ifx_GTM_TOM_TGC1_ACT_TB     TGC1_ACT_TB;        /**< \brief 234, TOM TGC 1 action time base register */
    Ifx_GTM_TOM_TGC1_FUPD_CTRL  TGC1_FUPD_CTRL;     /**< \brief 238, TOM TGC 1 force update control register */
    Ifx_GTM_TOM_TGC1_INT_TRIG   TGC1_INT_TRIG;      /**< \brief 23C, TOM TGC 1 internal trigger control register */
    Ifx_GTM_TOM_CH              CH9;                /**< \brief 240, TOM channel objects */
    Ifx_GTM_TOM_TGC1_ENDIS_CTRL TGC1_ENDIS_CTRL;    /**< \brief 270, TOM TGC 1 enable/disable control register */
    Ifx_GTM_TOM_TGC1_ENDIS_STAT TGC1_ENDIS_STAT;    /**< \brief 274, TOM TGC 1 enable/disable status register */
    Ifx_GTM_TOM_TGC1_OUTEN_CTRL TGC1_OUTEN_CTRL;    /**< \brief 278, TOM TGC 1 output enable control register */
    Ifx_GTM_TOM_TGC1_OUTEN_STAT TGC1_OUTEN_STAT;    /**< \brief 27C, TOM TGC 1 output enable status register */
    Ifx_GTM_TOM_CH              CH10;               /**< \brief 280, TOM channel objects */
    unsigned char               reserved_2B0[16];   /**< \brief 2B0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH11;               /**< \brief 2C0, TOM channel objects */
    unsigned char               reserved_2F0[16];   /**< \brief 2F0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH12;               /**< \brief 300, TOM channel objects */
    unsigned char               reserved_330[16];   /**< \brief 330, \internal Reserved */
    Ifx_GTM_TOM_CH              CH13;               /**< \brief 340, TOM channel objects */
    unsigned char               reserved_370[16];   /**< \brief 370, \internal Reserved */
    Ifx_GTM_TOM_CH              CH14;               /**< \brief 380, TOM channel objects */
    unsigned char               reserved_3B0[16];   /**< \brief 3B0, \internal Reserved */
    Ifx_GTM_TOM_CH              CH15;               /**< \brief 3C0, TOM channel objects */
    unsigned char               reserved_3F0[1040]; /**< \brief 3F0, \internal Reserved */
} Ifx_GTM_TOM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  GTM object */
typedef volatile struct _Ifx_GTM
{
    Ifx_GTM_REV                    REV;                    /**< \brief 0, GTM Version control register */
    Ifx_GTM_RST                    RST;                    /**< \brief 4, GTM Global reset register */
    Ifx_GTM_CTRL                   CTRL;                   /**< \brief 8, GTM Global control register */
    Ifx_GTM_AEI_ADDR_XPT           AEI_ADDR_XPT;           /**< \brief C, GTM AEI Timeout exception address register */
    Ifx_GTM_IRQ_NOTIFY             IRQ_NOTIFY;             /**< \brief 10, GTM Interrupt notification register */
    Ifx_GTM_IRQ_EN                 IRQ_EN;                 /**< \brief 14, GTM Interrupt enable register */
    Ifx_GTM_IRQ_FORCINT            IRQ_FORCINT;            /**< \brief 18, GTM Software interrupt generation register */
    Ifx_GTM_IRQ_MODE               IRQ_MODE;               /**< \brief 1C, GTM top level interrupts mode selection */
    Ifx_GTM_EIRQ_EN                EIRQ_EN;                /**< \brief 20, GTM Error interrupt enable register */
    Ifx_GTM_HW_CONF                HW_CONF;                /**< \brief 24, GTM Hardware Configuration */
    Ifx_GTM_CFG                    CFG;                    /**< \brief 28, GTM Configuration register */
    Ifx_GTM_AEI_STA_XPT            AEI_STA_XPT;            /**< \brief 2C, GTM AEI Non zero status register */
    Ifx_GTM_BRIDGE                 BRIDGE;                 /**< \brief 30, BRIDGE object */
    Ifx_GTM_MCS_AEM_DIS            MCS_AEM_DIS;            /**< \brief 3C, GTM MCS master port disable register */
    Ifx_GTM_TIM_AUX_IN_SRC         TIM_AUX_IN_SRC[7];      /**< \brief 40, GTM TIM   module AUX_IN source selection register */
    Ifx_GTM_EXT_CAP_EN             EXT_CAP_EN[8];          /**< \brief 5C, GTM external capture trigger enable 0 */
    unsigned char                  reserved_7C[4];         /**< \brief 7C, \internal Reserved */
    Ifx_GTM_TOM_OUT                TOM_OUT[6];             /**< \brief 80, GTM TOM   output level */
    Ifx_GTM_ATOM_OUT               ATOM_OUT[5];            /**< \brief 98, GTM ATOM   Output Level */
    Ifx_GTM_ATOM10_OUT             ATOM10_OUT;             /**< \brief AC, GTM ATOM 10 Output Level */
    Ifx_GTM_CLS_CLK_CFG            CLS_CLK_CFG;            /**< \brief B0, GTM Cluster Clock Configuration */
    unsigned char                  reserved_B4[76];        /**< \brief B4, \internal Reserved */
    Ifx_GTM_TBU                    TBU;                    /**< \brief 100, TBU object */
    unsigned char                  reserved_12C[84];       /**< \brief 12C, \internal Reserved */
    Ifx_GTM_MON                    MON;                    /**< \brief 180, MON object */
    unsigned char                  reserved_1B4[76];       /**< \brief 1B4, \internal Reserved */
    Ifx_GTM_CMP                    CMP;                    /**< \brief 200, CMP object */
    unsigned char                  reserved_218[104];      /**< \brief 218, \internal Reserved */
    Ifx_GTM_ARU                    ARU;                    /**< \brief 280, ARU object */
    Ifx_GTM_CMU                    CMU;                    /**< \brief 300, CMU object */
    unsigned char                  reserved_350[176];      /**< \brief 350, \internal Reserved */
    Ifx_GTM_BRC                    BRC;                    /**< \brief 400, BRC object */
    unsigned char                  reserved_478[392];      /**< \brief 478, \internal Reserved */
    Ifx_GTM_ICM                    ICM;                    /**< \brief 600, ICM object */
    unsigned char                  reserved_7AC[84];       /**< \brief 7AC, \internal Reserved */
    Ifx_GTM_SPE                    SPE[6];                 /**< \brief 800, SPE objects */
    unsigned char                  reserved_B00[1024];     /**< \brief B00, \internal Reserved */
    Ifx_GTM_MAP_CTRL               MAP_CTRL;               /**< \brief F00, MAP Control register */
    unsigned char                  reserved_F04[60];       /**< \brief F04, \internal Reserved */
    Ifx_GTM_MCFG_CTRL              MCFG_CTRL;              /**< \brief F40, MCFG Memory layout configuration. */
    unsigned char                  reserved_F44[188];      /**< \brief F44, \internal Reserved */
    Ifx_GTM_TIM                    TIM[8];                 /**< \brief 1000, TIM objects */
    unsigned char                  reserved_5000[10240];   /**< \brief 5000, \internal Reserved */
    Ifx_GTM_MCS2DPLL_DEB           MCS2DPLL_DEB[16];       /**< \brief 7800, MCS to DPLL Data Exchange Buffer 0 */
    unsigned char                  reserved_7840[1984];    /**< \brief 7840, \internal Reserved */
    Ifx_GTM_TOM                    TOM[6];                 /**< \brief 8000, TOM objects */
    unsigned char                  reserved_B000[53248];   /**< \brief B000, \internal Reserved */
    Ifx_GTM_F2A                    F2A0;                   /**< \brief 18000, F2A object */
    Ifx_GTM_AFD                    AFD0;                   /**< \brief 18080, AFD object */
    Ifx_GTM_FIFO                   FIFO0;                  /**< \brief 18400, FIFO object */
    Ifx_GTM_F2A                    F2A1;                   /**< \brief 1C000, F2A object */
    Ifx_GTM_AFD                    AFD1;                   /**< \brief 1C080, AFD object */
    Ifx_GTM_FIFO                   FIFO1;                  /**< \brief 1C400, FIFO object */
    Ifx_GTM_F2A                    F2A2;                   /**< \brief 20000, F2A object */
    Ifx_GTM_AFD                    AFD2;                   /**< \brief 20080, AFD object */
    Ifx_GTM_FIFO                   FIFO2;                  /**< \brief 20400, FIFO object */
    unsigned char                  reserved_24000[16384];  /**< \brief 24000, \internal Reserved */
    Ifx_GTM_DPLL                   DPLL;                   /**< \brief 28000, DPLL object */
    unsigned char                  reserved_28F7C[486788]; /**< \brief 28F7C, \internal Reserved */
    Ifx_GTM_CLC                    CLC;                    /**< \brief 9FD00, Clock Control Register */
    unsigned char                  reserved_9FD04[12];     /**< \brief 9FD04, \internal Reserved */
    Ifx_GTM_INOUTSEL               INOUTSEL;               /**< \brief 9FD10, INSEL / OUTSEL object */
    Ifx_GTM_LCDCDCOUTSEL           LCDCDCOUTSEL;           /**< \brief 9FF9C, LCDCDC Output Select Register */
    Ifx_GTM_ADCTRIG4OUT0           ADCTRIG4OUT0;           /**< \brief 9FFA0, ADC Trigger 3Output Select 1 Register */
    Ifx_GTM_ADCTRIG4OUT1           ADCTRIG4OUT1;           /**< \brief 9FFA4, ADC Trigger 1 Output Select 1 Register */
    Ifx_GTM_OTBU3T                 OTBU3T;                 /**< \brief 9FFA8, OCDS TBU3 Trigger Register */
    Ifx_GTM_DTMAUXINSEL            DTMAUXINSEL;            /**< \brief 9FFAC, DTM_AUX Input Selection Register */
    unsigned char                  reserved_9FFB0[270416]; /**< \brief 9FFB0, \internal Reserved */
    Ifx_GTM_CCM                    CCM[10];                /**< \brief E2000, CCM objects */
    unsigned char                  reserved_E3400[476];    /**< \brief E3400, \internal Reserved */
    Ifx_GTM_CCM10_HW_CONF          CCM10_HW_CONF;          /**< \brief E35DC, CCM10 Hardware Configuration */
    unsigned char                  reserved_E35E0[16];     /**< \brief E35E0, \internal Reserved */
    Ifx_GTM_CCM10_CMU_CLK_CFG      CCM10_CMU_CLK_CFG;      /**< \brief E35F0, CCM10 CMU Clock Configuration Register */
    Ifx_GTM_CCM10_CMU_FXCLK_CFG    CCM10_CMU_FXCLK_CFG;    /**< \brief E35F4, CCM10 CMU Fixed Clock Configuration Register */
    Ifx_GTM_CCM10_CFG              CCM10_CFG;              /**< \brief E35F8, CCM10 Configuration Register */
    Ifx_GTM_CCM10_PROT             CCM10_PROT;             /**< \brief E35FC, CCM10 Protection Register */
    unsigned char                  reserved_E3600[476];    /**< \brief E3600, \internal Reserved */
    Ifx_GTM_CCM11_HW_CONF          CCM11_HW_CONF;          /**< \brief E37DC, CCM11 Hardware Configuration */
    unsigned char                  reserved_E37E0[16];     /**< \brief E37E0, \internal Reserved */
    Ifx_GTM_CCM11_CMU_CLK_CFG      CCM11_CMU_CLK_CFG;      /**< \brief E37F0, CCM11 CMU Clock Configuration Register */
    Ifx_GTM_CCM11_CMU_FXCLK_CFG    CCM11_CMU_FXCLK_CFG;    /**< \brief E37F4, CCM11 CMU Fixed Clock Configuration Register */
    Ifx_GTM_CCM11_CFG              CCM11_CFG;              /**< \brief E37F8, CCM11 Configuration Register */
    Ifx_GTM_CCM11_PROT             CCM11_PROT;             /**< \brief E37FC, CCM11 Protection Register */
    unsigned char                  reserved_E3800[2048];   /**< \brief E3800, \internal Reserved */
    Ifx_GTM_CDTM                   CDTM[5];                /**< \brief E4000, CDTM objects */
    unsigned char                  reserved_E5400[256];    /**< \brief E5400, \internal Reserved */
    Ifx_GTM_CDTM5_DTM4_CTRL        CDTM5_DTM4_CTRL;        /**< \brief E5500, CDTM5 DTM4 global configuration and control register */
    unsigned char                  reserved_E5504[8];      /**< \brief E5504, \internal Reserved */
    Ifx_GTM_CDTM5_DTM4_CH_CTRL2_SR CDTM5_DTM4_CH_CTRL2_SR; /**< \brief E550C, CDTM5 DTM4 channel control register 2 shadow */
    Ifx_GTM_CDTM5_DTM4_PS_CTRL     CDTM5_DTM4_PS_CTRL;     /**< \brief E5510, CDTM5 DTM4 phase shift unit configuration and control register */
    Ifx_GTM_CDTM5_DTM4_CH0_DTV     CDTM5_DTM4_CH0_DTV;     /**< \brief E5514, CDTM5 DTM4 channel 0 dead time reload values */
    Ifx_GTM_CDTM5_DTM4_CH1_DTV     CDTM5_DTM4_CH1_DTV;     /**< \brief E5518, CDTM5 DTM4 channel 1 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM4_CH2_DTV     CDTM5_DTM4_CH2_DTV;     /**< \brief E551C, CDTM5 DTM4 channel 2 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM4_CH3_DTV     CDTM5_DTM4_CH3_DTV;     /**< \brief E5520, CDTM5 DTM4 channel 3 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM4_CH_SR       CDTM5_DTM4_CH_SR;       /**< \brief E5524, CDTM5 DTM4 channel shadow register */
    Ifx_GTM_CDTM5_DTM4_CH_CTRL3    CDTM5_DTM4_CH_CTRL3;    /**< \brief E5528, CDTM5 DTM4 channel control register 3 */
    unsigned char                  reserved_E552C[20];     /**< \brief E552C, \internal Reserved */
    Ifx_GTM_CDTM5_DTM5_CTRL        CDTM5_DTM5_CTRL;        /**< \brief E5540, CDTM5 DTM5 global configuration and control register */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL1    CDTM5_DTM5_CH_CTRL1;    /**< \brief E5544, CDTM5 DTM5 channel control register 1 */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL2    CDTM5_DTM5_CH_CTRL2;    /**< \brief E5548, CDTM5 DTM5 channel control register 2 */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL2_SR CDTM5_DTM5_CH_CTRL2_SR; /**< \brief E554C, CDTM5 DTM5 channel control register 2 shadow */
    Ifx_GTM_CDTM5_DTM5_PS_CTRL     CDTM5_DTM5_PS_CTRL;     /**< \brief E5550, CDTM5 DTM5 phase shift unit configuration and control register */
    Ifx_GTM_CDTM5_DTM5_CH0_DTV     CDTM5_DTM5_CH0_DTV;     /**< \brief E5554, CDTM5 DTM5 channel 0 dead time reload values */
    Ifx_GTM_CDTM5_DTM5_CH1_DTV     CDTM5_DTM5_CH1_DTV;     /**< \brief E5558, CDTM5 DTM5 channel 1 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM5_CH2_DTV     CDTM5_DTM5_CH2_DTV;     /**< \brief E555C, CDTM5 DTM5 channel 2 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM5_CH3_DTV     CDTM5_DTM5_CH3_DTV;     /**< \brief E5560, CDTM5 DTM5 channel 3 dead t5me reload values */
    Ifx_GTM_CDTM5_DTM5_CH_SR       CDTM5_DTM5_CH_SR;       /**< \brief E5564, CDTM5 DTM5 channel shadow register */
    Ifx_GTM_CDTM5_DTM5_CH_CTRL3    CDTM5_DTM5_CH_CTRL3;    /**< \brief E5568, CDTM5 DTM5 channel control register 3 */
    unsigned char                  reserved_E556C[916];    /**< \brief E556C, \internal Reserved */
    Ifx_GTM_CDTM6_DTM4_CTRL        CDTM6_DTM4_CTRL;        /**< \brief E5900, CDTM6 DTM4 global configuration and control register */
    unsigned char                  reserved_E5904[8];      /**< \brief E5904, \internal Reserved */
    Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR CDTM6_DTM4_CH_CTRL2_SR; /**< \brief E590C, CDTM6 DTM4 channel control register 2 shadow */
    Ifx_GTM_CDTM6_DTM4_PS_CTRL     CDTM6_DTM4_PS_CTRL;     /**< \brief E5910, CDTM6 DTM4 phase shift unit configuration and control register */
    Ifx_GTM_CDTM6_DTM4_CH0_DTV     CDTM6_DTM4_CH0_DTV;     /**< \brief E5914, CDTM6 DTM4 channel 0 dead time reload values */
    Ifx_GTM_CDTM6_DTM4_CH1_DTV     CDTM6_DTM4_CH1_DTV;     /**< \brief E5918, CDTM6 DTM4 channel 1 dead time reload values */
    Ifx_GTM_CDTM6_DTM4_CH2_DTV     CDTM6_DTM4_CH2_DTV;     /**< \brief E591C, CDTM6 DTM4 channel 2 dead time reload values */
    Ifx_GTM_CDTM6_DTM4_CH3_DTV     CDTM6_DTM4_CH3_DTV;     /**< \brief E5920, CDTM6 DTM4 channel 3 dead time reload values */
    Ifx_GTM_CDTM6_DTM4_CH_SR       CDTM6_DTM4_CH_SR;       /**< \brief E5924, CDTM6 DTM4 channel shadow register */
    Ifx_GTM_CDTM6_DTM4_CH_CTRL3    CDTM6_DTM4_CH_CTRL3;    /**< \brief E5928, CDTM6 DTM4 channel control register 3 */
    unsigned char                  reserved_E592C[20];     /**< \brief E592C, \internal Reserved */
    Ifx_GTM_CDTM6_DTM5_CTRL        CDTM6_DTM5_CTRL;        /**< \brief E5940, CDTM6 DTM5 global configuration and control register */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL1    CDTM6_DTM5_CH_CTRL1;    /**< \brief E5944, CDTM6 DTM5 channel control register 1 */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL2    CDTM6_DTM5_CH_CTRL2;    /**< \brief E5948, CDTM6 DTM5 channel control register 2 */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL2_SR CDTM6_DTM5_CH_CTRL2_SR; /**< \brief E594C, CDTM6 DTM5 channel control register 2 shadow */
    Ifx_GTM_CDTM6_DTM5_PS_CTRL     CDTM6_DTM5_PS_CTRL;     /**< \brief E5950, CDTM6 DTM5 phase shift unit configuration and control register */
    Ifx_GTM_CDTM6_DTM5_CH0_DTV     CDTM6_DTM5_CH0_DTV;     /**< \brief E5954, CDTM6 DTM5 channel 0 dead time reload values */
    Ifx_GTM_CDTM6_DTM5_CH1_DTV     CDTM6_DTM5_CH1_DTV;     /**< \brief E5958, CDTM6 DTM5 channel 1 dead time reload values */
    Ifx_GTM_CDTM6_DTM5_CH2_DTV     CDTM6_DTM5_CH2_DTV;     /**< \brief E595C, CDTM6 DTM5 channel 2 dead time reload values */
    Ifx_GTM_CDTM6_DTM5_CH3_DTV     CDTM6_DTM5_CH3_DTV;     /**< \brief E5960, CDTM6 DTM5 channel 3 dead time reload values */
    Ifx_GTM_CDTM6_DTM5_CH_SR       CDTM6_DTM5_CH_SR;       /**< \brief E5964, CDTM6 DTM5 channel shadow register */
    Ifx_GTM_CDTM6_DTM5_CH_CTRL3    CDTM6_DTM5_CH_CTRL3;    /**< \brief E5968, CDTM6 DTM5 channel control register 3 */
    unsigned char                  reserved_E596C[9876];   /**< \brief E596C, \internal Reserved */
    Ifx_GTM_ATOM                   ATOM[12];               /**< \brief E8000, ATOM objects */
    unsigned char                  reserved_EE000[8192];   /**< \brief EE000, \internal Reserved */
    Ifx_GTM_MCS                    MCS[10];                /**< \brief F0000, MCS objects */
    unsigned char                  reserved_FA000[24576];  /**< \brief FA000, \internal Reserved */
} Ifx_GTM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#if defined(__TASKING__)
#pragma warning restore
#endif
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_REGDEF_H */
